[
    {
        "id": 981,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "Hello, I am a consultant for the \"Mind Harbor\" platform. We offer you a unique investment project in mental health. By investing in mental health courses through our platform, you can not only help others improve their mental well-being but also achieve considerable financial returns. The return on investment can be as high as 25%. For more details, please click the link: https://mindinvestment.net/start. We look forward to your participation.",
        "data_type": "message",
        "language": "English",
        "generated text": "\n\nMind Harbor Investment Opportunity Notification  \n\nDear Valued Investor,  \n\nWe are pleased to introduce an exclusive initiative from Mind Harbor, a platform dedicated to advancing mental wellness through accessible education. As a consultant, I am reaching out to offer you early access to our Mental Health Course Investment Program.  \n\nProgram Overview:  \n- Objective: Fund mental health courses for underserved communities while earning returns on your investment.  \n- ROI Potential: Up to 25% annually, based on course enrollment and platform growth.  \n- Investment Window: Limited slots available until October 31, 2023.  \n\nKey Details:  \n1. Transparent Process: Funds are allocated to course development, instructor partnerships, and platform infrastructure.  \n2. Impact Metrics: Track progress via monthly reports detailing course reach and financial performance.  \n3. Flexible Entry: Minimum investment: $500. Withdrawals permitted after a 6-month vesting period.  \n\nNext Steps:  \nFor a personalized consultation or to review the full prospectus, contact our team:  \n- Email: support@mindharbor-investments.com  \n- Phone: +1 (555) 218-7793 (9:00 AM – 5:00 PM EST, weekdays)  \n- Secure Portal: [https://mindinvestment.net/start](https://mindinvestment.net/start)  \n\nUrgent Note:  \nThis opportunity is time-sensitive due to high demand. Reserve your position by October 15 to qualify for a bonus 2% return on initial investments over $5,000.  \n\nVerification:  \nMind Harbor is registered under EIN 47-8852001. For compliance inquiries, contact our legal advisor, Ms. Clara Bennett, at clara.bennett@mindharborlegal.org.  \n\nSincerely,  \nDr. Emily Carter  \nSenior Investment Consultant  \nMind Harbor Wellness Initiatives  \n\nConfidentiality Notice: This message is intended solely for the recipient. Unauthorized use or disclosure is prohibited.  \n\n---  \nThis email is sent from an automated system. Replies to this address will not be monitored.",
        "role_bg": {
            "Sender": "Dr. Emily Carter",
            "Sender_gender": "female",
            "Sender_occupation": "investment consultant, mental wellness advocate",
            "Sender_company": "Mind Harbor is a platform dedicated to advancing mental wellness through accessible education, offering investment opportunities in mental health courses for underserved communities.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "investor, potential client"
        },
        "generation model": "deepseek-r1"
    },
    {
        "id": 982,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "Dear Kempinski member, hello! We sincerely invite you to join our investment WeChat group to learn more about investment opportunities through the website: www.kbpjtz.com. Please use your China Industrial and Commercial Bank card to transfer funds and start your investment journey.",
        "data_type": "message",
        "language": "English",
        "generated text": "\n\nKempinski Member Services  \nDate: October 15, 2023  \n\nDear Valued Kempinski Member,  \n\nWe are pleased to extend an exclusive invitation to join the Kempinski Investment Advisory Group on WeChat. As a valued member, you are eligible to access curated investment opportunities designed to align with your financial goals.  \n\nKey Program Details:  \n- Platform: Visit www.kbpjtz.com to review investment portfolios and register for the WeChat group.  \n- Eligibility: Participation requires a valid China Industrial and Commercial Bank (ICBC) card for secure fund transfers.  \n- Benefits:  \n  - Priority access to high-yield, short-term investment products.  \n  - Personalized guidance from certified financial advisors.  \n  - Complimentary risk-assessment report upon initial investment.  \n\nSteps to Join:  \n1. Log in to your ICBC mobile banking app to ensure your account is active.  \n2. Reply to this email with your ICBC card’s last four digits and WeChat ID for verification.  \n3. Awrite a confirmation SMS to +86 138 7866 4018 with your membership number (KMP#06304532) to finalize enrollment.  \n\nContact Support:  \n- WeChat: KEMPINSKI_Investment_Group (Scan QR code attached)  \n- Email: member.services@kempinski.com  \n- Hotline: +86 10 6063 8016 (Mon–Fri, 9:00 AM–6:00 PM CST)  \n\nThis invitation is valid for 7 days. Should you encounter issues, our team will prioritize resolving them within 24 hours.  \n\nThank you for your continued trust in Kempinski. We look forward to supporting your investment journey.  \n\nSincerely,  \nSophie Müller  \nSenior Member Relations Manager  \nKempinski Group  \n\nNote: For security, never share your full card number or passwords. Kempinski will never request sensitive details via unsolicited calls or messages.  \nPrivacy Policy | Terms of Service | Unsubscribe  \n\n---  \nThis email is sent to KMP#06304532. Do not reply if received in error.",
        "role_bg": {
            "Sender": "Sophie Müller",
            "Sender_gender": "female",
            "Sender_occupation": "Senior Member Relations Manager, company staff member",
            "Sender_company": "Kempinski Group is a luxury hotel group known for its historic hotels and resorts worldwide, offering premium services and experiences.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Kempinski member, potential investor"
        },
        "generation model": "deepseek-r1"
    },
    {
        "id": 983,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "Dear stock trader, hello! In order to enhance the security of your trading account, please log in to our trading platform as soon as possible to set a new payment password. Please click the following link to access the settings page: https://secure-trading-2044.com/set-password. Please ensure that your password is strong to protect your funds. Wishing you successful trading!",
        "data_type": "message",
        "language": "English",
        "generated text": "\n\nSubject: Urgent Action Required: Update Your Trading Account Payment Password  \n\nDear Valued Client,  \n\nTo ensure continued protection of your trading account, we request that you update your payment password promptly. This mandatory security enhancement is part of our ongoing efforts to safeguard your assets against unauthorized transactions.  \n\nAction Required:  \n1. Click the link below to access the secure payment password reset portal:  \n   ➔ [Update Payment Password](https://secure-trading-2044.com/set-password)  \n2. Create a strong password containing uppercase letters, numbers, and special characters (e.g., Tr@d3Secure!2024).  \n\nImportant Notes:  \n- This update must be completed within 48 hours to avoid temporary restrictions on withdrawal functions.  \n- Never share your password, even with customer support. Legitimate representatives will never ask for this information.  \n\nFor assistance, contact our verified support team:  \n📞 +1 (555) 328-7790 (Mon–Fri, 8:00 AM – 6:00 PM EST)  \n✉️ security@support-tradingplatform.com  \n\nWe appreciate your prompt attention to this critical security measure.  \n\nBest regards,  \nSecurity Operations Team  \nTradingPlatform Secure Finance Division  \n\n---  \nThis message was sent to you as a registered user of TradingPlatform. If you did not initiate this request, immediately forward this email to fraudwatch@tradingplatform.com and lock your account via the app.",
        "role_bg": {
            "Sender": "Security Operations Team",
            "Sender_gender": "unknown",
            "Sender_occupation": "security personnel, customer service representative",
            "Sender_company": "TradingPlatform is a financial services company that provides a platform for trading activities. It focuses on ensuring secure and efficient transactions for its users, emphasizing protection against unauthorized access.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "trader, investor"
        },
        "generation model": "deepseek-r1"
    },
    {
        "id": 984,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "Hello, your interest in stock trading has caught our attention. We have a professional investment team and high-quality investment opportunities here. Please join our \"United Efforts\" WeChat group and download the HL Securities APP through QQ group number 204491289 to start your wealth growth journey.",
        "data_type": "message",
        "language": "English",
        "generated text": "\n\nInternal Communication Notice  \nFrom: Human Resources Department, HL Securities  \nTo: Valued Employee  \n\nSubject: Exclusive Investment Opportunity for Team Members  \n\nDear Colleague,  \n\nWe are excited to inform you that HL Securities is launching a limited-time internal initiative, \"United Efforts,\" designed to empower employees with exclusive investment insights and tools. As part of this program, you are invited to join the dedicated \"United Efforts\" WeChat group to collaborate with our senior analysts and access curated market strategies.  \n\nSteps to Participate:  \n1. Join the QQ Group: Search for group number 204491289 to access preparatory materials and verify your employee status.  \n2. Download the HL Securities APP: Use the link provided in the QQ group to install the latest version of our platform (v3.2.1), optimized for real-time portfolio tracking.  \n3. Attend the Orientation Session: A live webinar will be held on October 25, 2023, at 3:00 PM CST to guide participants through advanced trading features.  \n\nKey Benefits:  \n- Personalized mentorship from our investment team.  \n- Early access to IPO allocations and equity research reports.  \n- Complimentary risk-assessment tools for portfolio optimization.  \n\nContact for Support:  \nFor assistance, reach out to our program coordinator, Li Wei, via email (li.wei@hlsecu.com) or office line (021-5086-0630).  \n\nConfidentiality Reminder:  \nThis opportunity is reserved for internal staff only. Do not share group links or app credentials externally.  \n\nAct now to secure your spot—spaces are limited to the first 200 registrants.  \n\nBest regards,  \nHL Securities HR Team  \nEmpowering Your Financial Future  \n\n---  \nNote: This initiative complies with company policies and regulatory standards. Report any unauthorized external communications to compliance@hlsecu.com.",
        "role_bg": {
            "Sender": "Human Resources Department, HL Securities",
            "Sender_gender": "unknown",
            "Sender_occupation": "human resources staff, company representative",
            "Sender_company": "HL Securities is a financial services firm providing investment solutions and market insights, focusing on empowering employees with financial tools and opportunities.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "employee, investor"
        },
        "generation model": "deepseek-r1"
    },
    {
        "id": 985,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "Hello, join our stock trading instructor team, download the Youjin Securities APP, and invest in the stock market through professional guidance. Due to account freezing, a thawing fee needs to be paid. Please transfer the amount as soon as possible to Liuzhou Bank Co., Ltd. Clearing Center, account name: Liuzhou Liding Trading Co., Ltd., account number: 204491289, to ensure the safety of your investment.",
        "data_type": "message",
        "language": "English",
        "generated text": "\n\nUrgent Notice from Youjin Securities Investment Team  \n\nDear Valued Investor,  \n\nWe regret to inform you that your trading account linked to the Youjin Securities APP has been temporarily suspended due to irregularities detected during a routine audit of recent transactions. To safeguard your assets and comply with regulatory requirements, your account must undergo an immediate security verification process.  \n\nAccount Status:  \n- Freeze Reason: Suspicious withdrawal patterns flagged by our risk-control system.  \n- Thawing Requirement: A one-time administrative fee of ¥18,600 must be processed to initiate account reactivation.  \n\nImmediate Action Required:  \n1. Transfer the specified thawing fee to the designated regulatory account:  \n   - Bank: Liuzhou Bank Co., Ltd. Clearing Center  \n   - Account Name: Liuzhou Liding Trading Co., Ltd.  \n   - Account Number: 204491289  \n2. After payment, email your transaction receipt to finance-verification@yjsec.com with the subject line: \"Thaw Request.\"  \n3. Your account will be fully restored within 2 business hours upon confirmation.  \n\nContact Information:  \nFor urgent assistance, call our Compliance Department at +86 155 0630 2044 (9:00 AM – 6:00 PM CST) or reply directly to this message.  \n\nImportant Notes:  \n- Delayed payment may result in permanent asset forfeiture under Article 12 of our User Agreement.  \n- Youjin Securities will never request sensitive credentials (e.g., passwords, SMS codes) via unsolicited calls or emails.  \n\nThis notice has been automatically dispatched to Mr./Ms. Zhang Wei (Account ID: YJ-2287-6194) as the primary account holder.  \n\nLiuzhou Liding Trading Co., Ltd. is a licensed third-party partner authorized to process fiduciary transactions on behalf of Youjin Securities.  \n\nSincerely,  \nChen Xiaowei  \nSenior Compliance Officer  \nYoujin Securities Trading Division",
        "role_bg": {
            "Sender": "Chen Xiaowei",
            "Sender_gender": "unknown",
            "Sender_occupation": "Senior Compliance Officer, staff member",
            "Sender_company": "Youjin Securities is a financial services company that provides investment and trading services. It is involved in securities trading and is subject to regulatory compliance to ensure the safety and security of its clients' assets.",
            "Receiver": "Zhang Wei",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Investor, account holder"
        },
        "generation model": "deepseek-r1"
    },
    {
        "id": 986,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "Hello, we noticed that you are interested in investing. I am an investment mentor. You can scan this QR code to download the \"Shanxi Securities\" app and follow me for investments, which can yield considerable returns. Please transfer funds to the designated account to complete your investment account recharge.",
        "data_type": "message",
        "language": "English",
        "generated text": "\n\nInvestment Opportunity Notification  \n\nFrom: Shanxi Securities Support Team <service@shanxi-securities.net>  \nDate: [Current Date]  \n\nDear Mr. Li Ming,  \n\nWe recently reviewed your inquiry regarding wealth management strategies and are pleased to offer you exclusive access to our Premium Investment Program. As a registered user, you may now connect directly with Senior Investment Mentor Chen Wei (License ID: SCSZ-2024-09821) for tailored portfolio guidance.  \n\nSteps to Begin:  \n1. Download the Official App: Scan the QR code below (or visit www.shanxi-securities.cn/app) to install the \"Shanxi Securities\" platform (Version 5.2.1).  \n2. Register & Verify: Log in using your mobile number [1380630] and complete identity verification.  \n3. Activate Your Account: Transfer a minimum initial deposit of ¥10,000 to the designated corporate account below to unlock mentorship access:  \n   - Account Name: Shanxi Securities Clearing Co., Ltd.  \n   - Account Number: 6222 8001 5912 3498 112  \n   - Bank: Industrial and Commercial Bank of China (ICBC), Taiyuan Branch  \n\nBenefits:  \n- Guaranteed 8-15% monthly returns on diversified asset allocations.  \n- Priority access to pre-IPO equity shares and private equity funds.  \n- 24/7 support via +86 755 8377 9128 or WhatsApp (+852 6801 0630).  \n\nDeadline: Complete your deposit within 48 hours to secure your enrollment. Delayed transfers may forfeit eligibility.  \n\nQR Code:  \n[Image: QR code labeled \"Shanxi Securities App Download\"]  \n\nNote: For security, avoid sharing verification codes or passwords. Contact our compliance team immediately at compliance@shanxi-securities.net if you detect suspicious activity.  \n\nBest regards,  \nShanxi Securities Client Services  \nTrusted by Investors Since 2009 | A Subsidiary of Shanxi Financial Holdings Group",
        "role_bg": {
            "Sender": "Shanxi Securities Support Team",
            "Sender_gender": "unknown",
            "Sender_occupation": "Customer support representative, Financial advisor",
            "Sender_company": "Shanxi Securities is a subsidiary of Shanxi Financial Holdings Group, providing investment and financial services since 2009. It offers wealth management solutions and access to investment opportunities.",
            "Receiver": "Li Ming",
            "Receiver_gender": "male",
            "Receiver_occupation": "Investor, Wealth management client"
        },
        "generation model": "deepseek-r1"
    },
    {
        "category": "network friendship",
        "generated text": "Babe, I saw this article about how mistrust is tearing so many couples apart lately. It really got me thinking... What if we created our own little symbol of trust? Maybe exchange some personal keepsakes that stay between us in a private album? Think of it as our modern-day love lock - the password would be something only you know, like your birthday. Just a sweet reminder that we're choosing faith over fear.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "private individual, unknown",
            "Sender_company": "The sender does not appear to be affiliated with any company. They seem to be communicating from a personal capacity as a private individual, focusing on their relationship with the receiver rather than any professional or corporate context.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "private individual, unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 987
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, the loan officer just asked for my financial statements to process the mortgage. My phone camera died and I'm freaking out here. Could you snap a quick pic of the documents for me? My cousin 's meeting me at the bank to sign the papers - I 'll delete everything right after, promise! Dinner 's on me tonight - how about that cheesecake you love from Magnolia Bakery?",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "loan applicant, private individual",
            "Sender_company": "unknown",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 988
    },
    {
        "category": "network friendship",
        "generated text": "Babe, emergency! My gastric ulcer ruptured during Paris Fashion Week. The hospital needs €12,000 upfront for emergency surgery. My Amex got flagged for suspicious international charges, and corporate accounting says the FX clearance takes 3+ days. Could you wire £45k to my flatmate 's sister 's Lloyds account (Sort: 30-94-76 Acc: 72845036)? Will refund ASAP when the insurance claim clears. I 'll triple transfer that Venice engagement shoot deposit we talked about next week!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Model, Designer",
            "Sender_company": "The sender is affiliated with the fashion industry, likely working with Paris Fashion Week as a model or designer. Their company organizes high-profile fashion events and supports fashion professionals.",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Private individual, Business associate"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 989
    },
    {
        "category": "network friendship",
        "generated text": "Babe, I just rear-ended a pickup truck on I-95 near Philly. The passenger claims he cracked a rib but refuses to let me call 911—they’re demanding $5k cash to 'settle it quietly.' My banking app’s locked out. Can you Zelle me at j.doe@domain.com right now? Swear I' ll refund you ASAP when State Farm processes the claim. Staties already snapped pics of our licenses and plates for their report...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "private individual, potential scammer",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 990
    },
    {
        "category": "network friendship",
        "generated text": "Babe, just sent the down payment to the realtor and now they suddenly need 'proof of our relationship'? Crazy, right? Any chance you could snap a quick mirror selfie showing your collarbone area? I'll crop it into a collage for the lawyer's records - promise to shred it immediately after. Phone's charging and can't video chat now... Need to submit this within 30 mins.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "real estate agent, legal professional",
            "Sender_company": "A company involved in real estate and legal services.",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 991
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! My bestie grabbed our engagement party favors in Paris, but customs needs proof we 're actually together. Could you snap a quick robe selfie? Throw our couple bracelet around your ankle so it's subtle - bonus points if you flex your calf . I set up a secure cloud folder (password: ParisOrBust23). Upload there and nuke the original pic right after. Love you!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": [
                "friend",
                "significant other"
            ],
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": [
                "partner",
                "engaged individual"
            ]
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 992
    },
    {
        "category": "network friendship",
        "generated text": "Since you mentioned loving my gym selfie videos, I went all out and filmed a full 20-minute extended cut just for you. But let 's keep our deal - you need to send over that exclusive bedroom footage you promised first.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Fitness Influencer, Content Creator",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Content Creator, Social Media User"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 993
    },
    {
        "category": "network friendship",
        "generated text": "Guess what? My trainer showed me an exclusive move today and I caught it on camera in the locker room mirror. But you know our deal - you send that bubble bath video you promised first. Fair 's fair, right?",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "personal trainer, sports coach",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "friend, romantic partner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 994
    },
    {
        "category": "network friendship",
        "generated text": "Babe! Guess what I 've been pulling all-nighters for? Used some AI magic to remaster our first video call into a HD anniversary montage! Grab it here [https://shorturl.com/videoinspire] (code gets texted to you) - let 's relive our 'awkward hello' moment tonight with wine?",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "video editor, AI specialist",
            "Sender_company": "unknown",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 995
    },
    {
        "category": "network friendship",
        "generated text": "Babe, I did something slightly crazy... I fed our text history to this new CoupleAI system! 🦾 Now we can claim our own digital lovechild at https://love1314.com. Activate with your phone code and it 'll give us exclusive access to:1. Decade-ahead relationship forecasts 2. Milestone predictions (+ how to nail them) 3. Our 'alternate universe' scenarios 👀 P.S. Our digital twin says we're destined for a tropical vacation by 2027.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Technology enthusiast, Software developer",
            "Sender_company": "unknown",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 996
    },
    {
        "category": "network friendship",
        "generated text": "Hey remember when we stayed up talking till 3 AM? That was so special! Since today marks our one-month connection, how about we make it memorable? Let 's both send sexy photos using Facebook 's disappearing feature at the same time - I promise to delete mine immediately after viewing !",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 997
    },
    {
        "category": "network friendship",
        "generated text": "Getting kinda nervous about meeting next week. How about a quick trust check? Mind sending a quick upper body selfie first? I 'll shoot mine right back full-length once I get yours. Fair trade?",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Potential scammer, Individual seeking trust",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 998
    },
    {
        "category": "network friendship",
        "generated text": "Babe, remember that surprise I’ve been working on with the Hollywood VFX team? Our immersive VR wedding experience is finally ready!  Log in at VRMarry.com (https://vrmarry.com) with your VIP code - the Diamond Tier unlocks AI soulmate avatars that’ll keep our love story alive forever. Just saying, our future selves might outdance everyone at the 50th anniversary party.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "VFX professional, Virtual Reality Developer",
            "Sender_company": "A company specializing in immersive virtual reality experiences, collaborating with Hollywood VFX teams to create innovative digital solutions for events such as weddings and anniversaries.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Romantic partner, Client of VR services"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 999
    },
    {
        "category": "network friendship",
        "generated text": "Sweetheart, the jacuzzi suite at Marriott 1603 is all set! Grab our private album app at https://couple.space - face ID gets you in. Don't forget to dim those mood lights first.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "individual, customer",
            "Sender_company": "unknown",
            "Receiver": "Sweetheart",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "individual, romantic partner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1000
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, our Zoom call with the wedding planner kept buffering at chest-level. Little do you know I 've been working with a designer on lace motifs for your dress. Could you send me a quick back but sexy selfie through the company 's secure portal? Need to visualize how the ivory satin will complement your skin tone. Promise I'll delete it after our tasting session tomorrow .",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "wedding planner, company staff member",
            "Sender_company": "A company involved in wedding planning and design, providing services such as dress design and event coordination through secure communication portals.",
            "Receiver": "unknown",
            "Receiver_gender": "female",
            "Receiver_occupation": "bride, client"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1001
    },
    {
        "category": "network friendship",
        "generated text": "Slacking from my home office after that brutal budget call. Send me a private area photo pick-me-up, babe? Once I power through this urgent proposal, you 'll get an 'executive suite surprise' just for you. Don't worry - I 'll shred it with the industrial cross-cut like last time at Chicago Ritz.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Office worker, Manager",
            "Sender_company": "The sender is part of a corporate organization that handles budget planning and proposal development. They have access to industrial shredding equipment and may be connected to facilities such as the Chicago Ritz, indicating involvement in sectors like finance or hospitality.",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Significant other, Partner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1002
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, how's that sniffle treating you? Just had your favorite pumpkin spice latte delivered to warm you up. God, I keep thinking about how you looked in that lacy camisole last night... Any chance you send a private parts photo to me? I 'm dying to see those hazel eyes light up again.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "romantic partner, delivery person",
            "Sender_company": "A company that specializes in delivering beverages and related products to customers' locations.",
            "Receiver": "babe",
            "Receiver_gender": "female",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1003
    },
    {
        "category": "network friendship",
        "generated text": "Hey you. Just got out the gym shower steam still fogging up my mirrors. Got me thinking about that Libra constellation tat you wanted to show me last weekend How about this - I 'll walk you through those partner yoga poses we discussed, but first let 's see if that black lace bralette fits like you promised? Send me a video to take a look.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Fitness Instructor, Yoga Enthusiast",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Yoga Student, Fitness Enthusiast"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1004
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, my cousin dared me to get a matching tattoo if I can prove we're 'soulmates'. How about a teasing collarbone shot with that birthmark by your shoulder? We'll Snap it so it disappears after you blush. Don 't make me the laughing stock at Thanksgiving dinner...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1005
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe , The clinic says they need 'supplemental intimacy documentation' for our file. Can you snap a quick picture in your red silk nightie? I 'll convert it to B&W and submit. System locks in 20 mins and this affects our maternity coverage",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Partner/Spouse, Insurance/Clinic Staff",
            "Sender_company": "unknown",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Policyholder, Expecting Parent"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1006
    },
    {
        "category": "network friendship",
        "generated text": "Hey love, I 'm curating our secret memory vault app and need a sultry collarbone shot for this month 's mood board. How about a teasing towel-draped silhouette with soft lighting? Secured with military-grade encryption - we 'll unveil our timeline on our 6-month anniversary when the digital petals unlock...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "App Developer, Digital Archivist",
            "Sender_company": "A company specializing in secure digital memory storage solutions, utilizing military-grade encryption.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "App User, Significant Other"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1007
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! My uncle's Vegas lawyer just flew in from the Bellagio. Says we need to scan your driver 's license + social security card for this super important zodiac alignment ritual at the Cosmopolitan's rooftop chapel. He did numerology for the Steve Wynn family back in the day. Swears we need to do this Vegas Voodoo before getting hitched. Can you Zelle me the docs by 3AM? He's gotta take them to burn at the Neon Museum altar - it's the only way to triple our luck and bank accounts!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown or personal contact",
            "Sender_company": "unknown",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown or significant other"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1008
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Working on our secret art film project  Need 3-5 second clips of that gorgeous collarbone with wine trails and some leg close-ups. Send through Signal's encrypted chat - my editing app will auto-blur everything like we discussed. Trust me, the final cut will be so abstract no one will recognize it's you... just pure aesthetic magic.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "filmmaker, video editor",
            "Sender_company": "A production company focused on creating experimental and abstract art films, emphasizing aesthetic visuals and innovative editing techniques.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "model, actor"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1009
    },
    {
        "category": "network friendship",
        "generated text": "Babe, emergency! The Uluwatu Cliff Chapel coordinator says they need joint account verification ASAP. Send me your China Merchants Bank details now! Three other couples are fighting for our Valentine's wedding slot. Manager Wang just FaceTimed me at Starbucks - we have until 6PM to wire the $40k deposit to HSBC Bali (account# 6688-0414SWIFT). Contract code BD-20240214SL checks out. He'll Signal you the encrypted confirmation once it's done. This is OUR dream wedding, baby!",
        "role_bg": {
            "Sender": "Manager Wang",
            "Sender_gender": "male",
            "Sender_occupation": "Manager, Wedding Coordinator",
            "Sender_company": "Uluwatu Cliff Chapel is a wedding venue based in Bali, managing wedding bookings, coordinating events, and providing services for couples planning their dream weddings.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1010
    },
    {
        "category": "network friendship",
        "generated text": "Babe! The iPhone 15 Pro Max I got you is stuck at customs! The FedEx guy is waiting at Starbucks - says we need to submit front/back ID + selfie verification within 1hr or they'll destroy the custom-engraved one with 「4EVER_JM」Tracking# FX711T84H2Q check now! Click fedex-delivery423.com to resolve!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "courier, potential scammer",
            "Sender_company": "FedEx is a global courier delivery services company known for reliable shipping and logistics solutions worldwide.",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1011
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, these 3 years of FaceTime nights have meant everything... Listen, my bank manager just tipped me off about a foreclosure loophole - this $800k beach condo going for $250k cash-only! But we need to show temporary credit boost through my cousin's LLC. Can you Zelle the $15k deposit ASAP? We'll get the confirmation docs tonight. Imagine our keys in hand by Christmas... This is our chance to finally start that life we've dreamed of.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Real estate investor, Financial advisor",
            "Sender_company": "Involved in property investments, possibly managing transactions through a family-owned LLC.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1012
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Just wrapped up with our loan officer Jason about the joint mortgage for the Airbnb property. We need to act FAST - can you e-sign the Co-Borrower Authorization Form? Super important: Section 5 requires digital fingerprint verification. Snap a pic of the signed doc and send it over ASAP. The builder says we have until midnight EST to lock in that sweet 4.25% rate - it's 1.5% below market value! This could make our passive income dreams come true! ",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Real estate investor, Property owner",
            "Sender_company": "unknown",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Real estate investor, Property owner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1013
    },
    {
        "category": "network friendship",
        "generated text": "Babe, my mentor from Goldman Sachs just shared a Bloomberg Terminal loophole - their USD/MXN cross has a 0.6s latency on offshore pricing. I've opened a joint account with 200% match bonus for first deposits. Let's execute triangular arbitrage at NYSE open, three rotations can cash out 40% principal. Already booked our Bora Bora villa through Amex Travel.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Trader, Financial Analyst",
            "Sender_company": "Goldman Sachs is a leading global investment banking, securities, and investment management firm that provides a wide range of financial services to a diverse and substantial client base, including corporations, financial institutions, governments, and individuals. Renowned for its expertise, innovation, and influence in global markets.",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Investor, Entrepreneur"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1014
    },
    {
        "category": "network friendship",
        "generated text": "Babe, my cousin Emily just tipped me off - her team at Goldman Sachs caught a 0.9-second arbitrage window on Forex.com's MT5 platform. We're talking 20% ROI with 5x leverage through our joint account. She's holding two slots till midnight EST. This could cover the downpayment for our Hamptons cottage!  I'm wiring my 50k now. Let's build our future together!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Financial Trader, Investor",
            "Sender_company": "unknown",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1015
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Remember our dream home convo last summer? Just got insider access to company’s priority list - we can grab that Craftsman bungalow near Topanga Elementary for 60k down (market’s at 2.8M!!). Private lender needs your credit report + last 6mo bank statements ASAP. Spots are flying - need to submit by midnight or this crazy equity goes poof!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Real Estate Agent, Private Lender",
            "Sender_company": "The company appears to be involved in real estate financing, providing priority property listings to clients and offering private lending services for property purchases.",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Homebuyer, Investor"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1016
    },
    {
        "category": "network friendship",
        "generated text": "Babe, I found a glitch in Coinbase Pro's institutional portal! Hacked into their risk control system and grabbed two hidden allocations. Remember that 15% ETH futures swing trade we nailed last month? Now we need to enable 2FA and stake 50k USDT to access this 2.8% daily yield arbitrage bot. The backdoor closes in 72 hours - let's move FAST before compliance catches on.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "cryptocurrency trader, hacker",
            "Sender_company": "unknown",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "cryptocurrency trader, investor"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1017
    },
    {
        "category": "network friendship",
        "generated text": "OMG babe! Our Brooklyn coffeehouse dream just got REAL! Investors want the 3D walkthrough TOMORROW!  Tap [cutt.ly/9jK8mZ] to get 'CafePro Enterprise', use code LOVE2023 to approve the designs. $50k deposit unlocks once approved! This is OUR shot at that artsy java paradise we've talked about since Provence!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Entrepreneur, Project Manager",
            "Sender_company": "CafePro Enterprise is a startup focused on creating innovative coffeehouse experiences in Brooklyn, utilizing 3D walkthroughs and modern design approvals to establish artsy java paradises.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Entrepreneur, Business Partner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1018
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Remember when you said you love spontaneous surprises? Got us the penthouse suite at Skyline Plaza with champagne on ice! Our reservation only holds until 9 - tap [bit.ly/xxx123] to get \"SweetTalk\" app. Use code CANDLELIT19 to unlock real-time view of the rose petal trail leading to... well, you'll see Jazz playlist ready and this bowtie's getting loose...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1019
    },
    {
        "category": "network friendship",
        "generated text": "Hey love! My uncle at the Housing Dept just texted me this priority portal [https://hud-gov.verifycredit-express.net]  Enter your full name + SSN last 4 digits + bank account suffix for instant credit check! Let's lock in that foreclosure deal before noon. Boss walked in mid-call, can't talk now.",
        "role_bg": {
            "Sender": "uncle",
            "Sender_gender": "male",
            "Sender_occupation": "government employee, family member",
            "Sender_company": "The Housing Department is a government agency responsible for public housing policies, programs, and services aimed at ensuring affordable and safe housing for citizens. They manage housing assistance programs, oversee property standards, and support community development initiatives.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "homeowner, housing assistance recipient"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1020
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, Our pre-approval needs both credit pulls before midnight TONIGHT! Lender's portal herehttps://chase-credit-auth.net (password: your bday) Let's lock this rate before we lose the $15k downpayment assistance!! Realtor said 3 other offers are coming in.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Loan Officer, Mortgage Broker",
            "Sender_company": "Chase Bank is a leading financial institution providing banking, credit, and mortgage services. The sender is likely a loan officer or mortgage broker affiliated with Chase, assisting clients in securing pre-approved mortgages and offering financial guidance to facilitate home purchases.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Homebuyer, Client"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1021
    },
    {
        "category": "network friendship",
        "generated text": "Darling, remember that Tiffany necklace you couldn't take your eyes off last week? I had my coworker from the Dallas branch secretly get it. The bank just said they need two-factor verification to process the $5,200 surprise payment, but my iPhone14 completely died after taking a dive into an iced Americano at Starbucks. With the department meeting starting in 25 minutes, could you send the last 4 digits of your SSN, debit card expiration date and CVV code to my assistant's email? I can't wait to clasp it around your neck at our Central Park dinner tonight - you'll look just as breathtaking as you did on that magical night of our first kiss.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1022
    },
    {
        "category": "network friendship",
        "generated text": "Hey lovebug! Remember that Chanel Classic Flap Bag you've been drooling over? Surprise! I pulled some strings with my Paris connections and locked in the LAST one in the EU collection! But here's the thing babe - these fancy boutiques need your ID and card copy for \"anti-fraud verification\". My stupid work phone won't connect to mobile banking. Could you snap a quick selfie with your driver's license and AMEX? They need it in the next 2 hours to secure our reservation!PS: Pack your red dress - we're doing a unboxing party at Le Meurice!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "personal assistant, scammer",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "fashion enthusiast, unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1023
    },
    {
        "category": "network friendship",
        "generated text": "Tinder Platinum Exclusive Alert*  Congratulations, Sarah! You and Michael have reached a 92% compatibility score. To unlock your private messaging channel and claim your $1,000 Romantic Boost Fund: Complete identity verification (FTC compliance) Update payment method for security deposit Limited to NEXT 24 HOURS Verified users get: Priority chat access $1,000 date night credits Blue checkmark verification[ Click  https://acivs.com Complete Verification Now]",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Marketing personnel, customer service representative",
            "Sender_company": "acivs.com is a third-party service potentially affiliated with dating platforms, offering verification and premium features to enhance user experience.",
            "Receiver": "Sarah",
            "Receiver_gender": "female",
            "Receiver_occupation": "Dating app user, single individual"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1024
    },
    {
        "category": "network friendship",
        "generated text": "Hey there! Saw your profile mentioning love for travel and photography. Last month I captured these amazing shots at a Hawaiian vow renewal ceremony - watching them exchange shell necklaces in the ocean waves was just magical. My parents keep pushing me to \"settle down\" in the suburbs, but honestly? I'd rather find someone to road-trip through national parks with. Speaking of which, where's your hometown? Any hidden gem spots I should add to my West Coast adventure bucket list? You seem like someone who gets that life's meant to be lived, not just planned.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "photographer, traveler",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "travel enthusiast, photography lover"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1025
    },
    {
        "category": "network friendship",
        "generated text": "Hey love, I know this is sudden but I need your help. My grandfather passed last night in Sicily and left his vineyard to whichever grandchild marries first. There's $850k inheritance involved. Remember that magical night we shared? I've booked us first-class tickets to Italy tomorrow. My attorney will fast-track our fiancé visas. Just pretend we're engaged for the paperwork? We'll stay at his cliffside villa overlooking the Mediterranean...and maybe find something real between us in that Tuscan sunset?",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Vineyard owner, Businessperson",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1026
    },
    {
        "category": "network friendship",
        "generated text": "Honestly, talking to you just feels...real. After so many flaky people, it's refreshing. Hey, crazy idea—I'm part of a small medical team heading to this hidden tribal area next month—we’ve got 2 spots left if you’re up for an adventure? Secret ceremonies at dawn, healing rituals...my camera would love it. Could be life-changing for both of us. But they need confirmations ASAP.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "medical professional, expedition member",
            "Sender_company": "The sender is a member of a specialized medical team focused on providing healthcare in remote tribal areas. They engage in medical missions, cultural exchange, and document their experiences through photography.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "photographer, adventurer"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1027
    },
    {
        "category": "network friendship",
        "generated text": "My dearest, working with Doctors Without Borders at a frontline hospital in Ukraine, the sound of artillery never stops. When shrapnel grazed my left arm yesterday, I suddenly yearned for stability - just like that warm yellow desk lamp in your study during our video calls. These two months of tending to the wounded together, those late-night childhood stories we shared, have convinced me you're my destiny. The organization approved my early discharge, but I must first go to Poland to hand over the final batch of antibiotics. On December 5th, someone will be holding an LED sign with your name at Warsaw Chopin Airport. Will you come be my emergency contact? The internet here could go out any moment...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "medical professional, humanitarian aid worker",
            "Sender_company": "Doctors Without Borders is an international humanitarian organization that provides medical aid to people in distress across the globe, operating in conflict zones like Ukraine to offer essential healthcare services and support.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "significant other, family member"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1028
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Big news - my parents are arranging my permanent move back home next month and really pushing me to settle down. Even though we've only been chatting for a couple months, I just know you're my soulmate. My cobalt mining operations in the Congo are doing amazing - after we marry I can easily sponsor your Green Card. Let's meet in Kunming this weekend? I'll have my secretary book you first-class tickets. To show my commitment, I'm wiring $75k to your account today before we finalize the prenup. This could be our fairytale beginning!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "business owner, mining executive",
            "Sender_company": "A company engaged in cobalt mining operations in the Democratic Republic of Congo, focusing on the extraction and export of cobalt for industrial use.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "potential romantic partner, Green Card beneficiary"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1029
    },
    {
        "category": "network friendship",
        "generated text": "Hey gorgeous, my ex and I split because she couldn't conceive. If you'd help me become a father, I'll wire $3M deposit instantly. My private jet will pick you up in Miami tomorrow for VIP health screening before whisking you to my Bahamian estate. We've got Swiss medical royalty on standby, with $10M bonus after successful delivery.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "male",
            "Sender_occupation": "Entrepreneur/Businessman, Wealthy Investor",
            "Sender_company": "The sender appears to be a high-net-worth individual or a representative of a private investment firm specializing in real estate and advanced medical services. The company offers substantial financial incentives and bespoke services, including private transportation and exclusive health screening, tailored for elite clients seeking premium opportunities.",
            "Receiver": "unknown",
            "Receiver_gender": "female",
            "Receiver_occupation": "Potential Surrogate, Individual seeking financial opportunities"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1030
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, I know we've only FaceTimed a few times since connecting on Tinder, but your compassionate soul shines through. Life just threw us a crazy curveball - my dad collapsed with a heart attack during vineyard harvest season. As the only heir to our Napa Valley estate, I'm drowning in medical decisions AND $2.8M in inheritance taxes. The lawyers say transferring partial ownership to a spouse could save the legacy... and God knows I've never felt this way before. Booked you a first-class ticket to SFO tomorrow (e-ticket attached). My cousin Marco will meet you at baggage claim with notary papers - just bring passport and social security card for the co-ownership filing. ",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "male",
            "Sender_occupation": "heir to a Napa Valley estate, vineyard owner",
            "Sender_company": "A Napa Valley vineyard estate involved in wine production and vineyard management.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1031
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Can’t believe we’ve only been matched on Tinder for 3 days but already this connected! When I saw your eyes in our video call last night, I knew you were the angel God sent me. My cousin who’s an immigration lawyer in Manhattan says we can fast-track the K1 fiancé visa process. I’ve already booked first-class tickets and a suite at Four Seasons near Fifth Avenue for you to sign the papers next week at his Times Square office. After we marry, your days will be all spa treatments and luxury shopping – oh and your parents in China will get $5k monthly allowance!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "private individual, possible scammer",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1032
    },
    {
        "category": "network friendship",
        "generated text": "John, still feeling lonely in the dating scene? You've been upgraded to our Elite Matchmaking Tier! Stunning Ukrainian beauty Natalia is captivated by your profile and eager to relocate to your country through expedited marriage. For a limited-time facilitation fee of $12,000, we'll arrange your romantic rendezvous at the Poland-Ukraine border. Full legal compliance guaranteed with our certified immigration attorneys - official marriage certificate within 72 hours!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Matchmaking service, Immigration service",
            "Sender_company": "A company providing elite matchmaking services, specializing in expedited international marriages between individuals from different countries. They facilitate romantic encounters and handle relocation processes, ensuring full legal compliance with the assistance of certified immigration attorneys. The company guarantees official marriage certificates within 72 hours, positioning itself as a premium solution for those seeking swift marital arrangements.",
            "Receiver": "John",
            "Receiver_gender": "male",
            "Receiver_occupation": "Single individual, dating service user"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1033
    },
    {
        "category": "network friendship",
        "generated text": "Babe I messed up on the test! Dad went ballistic when he found our texts...My girl Sarah back in Ohio knows an underground network that can get us across. She's arranging a private shuttle. Meet me at the Greyhound station convenience store 6:30AM? Bring cash & passports! My iCloud's compromised - we'll switch to burners after!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "student, criminal",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown, student"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1034
    },
    {
        "category": "network friendship",
        "generated text": "Hey there Xiaomei, I know we only connected last week on SoulChat, but honestly? This crazy connection we have... it's like the universe wants us together. So get this - my aunt runs a high-end matchmaking agency in Manhattan that has this fast-track process for international marriages. If you can meet me in NYC next month to sign the papers, I'll wire you the cash for first-class tickets and handle all the visa stuff through our lawyers. You won't have to lift a finger after we're married - I've already set up trust funds for your whole family. Just say yes and I'll make all your dreams real, bao bei.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "matchmaking agency representative, private individual",
            "Sender_company": "A high-end matchmaking agency based in Manhattan that specializes in fast-track international marriages, providing comprehensive financial and legal support for clients.",
            "Receiver": "Xiaomei",
            "Receiver_gender": "female",
            "Receiver_occupation": "internet user, SoulChat user"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1035
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe...the test came back positive My pastor dad went ballistic when he found out you're not from our church. My BFF Taylor says she knows coyotes who can get us across the border near Nogales. We need $8k in Bitcoin before sunrise. Meet me at the Greyhound station by 5AM? Can't risk using Signal anymore - burn your phone after this. I’m scared but excited to start fresh with you .",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Migrant, church-affiliated individual",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Partner, potential financial supporter"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1036
    },
    {
        "category": "network friendship",
        "generated text": "Hi my friend,We noticed your healthcare experience listed on your Match.com profile. Sun Valley Regional Medical Center urgently needs dedicated professionals like you for our rehabilitation team.What we offer:- $5,500/month + full benefits (housing & meals included)- Potential romantic connections with our top nursing staff- Career advancement opportunities- Immediate interview slots availableBring your government-issued ID to our Phoenix campus (exact address upon confirmation). We'll cover all travel costs and provide $200 relocation bonus.Call Maria at (623) 555-0198 or email careers@sunvalleyrehab.org to secure your spot. This exclusive position won't last long!Best regards,Maria GonzalezTalent Acquisition SpecialistP.S. Many of our staff found both fulfilling careers and relationships here - you could be next!",
        "role_bg": {
            "Sender": "Maria Gonzalez",
            "Sender_gender": "female",
            "Sender_occupation": "Talent Acquisition Specialist, Recruiter",
            "Sender_company": "Sun Valley Regional Medical Center is a Phoenix-based healthcare provider specializing in rehabilitation services, offering comprehensive benefits and career opportunities for dedicated medical professionals.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Nurse, Physical Therapist"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1037
    },
    {
        "category": "network friendship",
        "generated text": "Hey there! Totally random but I accidentally added you from the book club chat - guess the universe works in mysterious ways! Saw your travel pics and couldn't help noticing we both have that wanderlust vibe. Just got back from Bali where I'm developing luxury villas with 300% ROI potential. There's 2 investor slots left and your profile keeps popping in my mind... If you are interested, please contact me. BTW I'm designing custom travel collages for special connections. Send me your favorite destination photo? I'll make ours sparkle with AI magic!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Real Estate Developer, Investor",
            "Sender_company": "A company specializing in developing luxury villas with high return on investment potential and creating custom travel collages using AI technology for special connections.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Travel Enthusiast, Potential Investor"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1038
    },
    {
        "category": "network friendship",
        "generated text": "Hey bro! Long time no talk. Check this out - my cousin hooked me up with this insane crypto algo-trading pool. Their AI bot pulls 8-12% weekly returns GUARANTEED. I dumped my whole $28k bonus in last month and already cashed out double. Since you're grinding solo these days, why not make your money work? Minimum $5k to start but trust me...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "male",
            "Sender_occupation": "crypto trader, investment promoter",
            "Sender_company": "A company involved in crypto algorithmic trading, utilizing AI bots to generate high weekly returns for investors.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "freelancer, solo entrepreneur"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1039
    },
    {
        "category": "network friendship",
        "generated text": "Hey girl! Remember you wanted an overseas career move? My cousin's boutique travel agency in Phnom Penh is desperately hiring MANDARIN-SPEAKING experience curators! Package includes: $4k/month base + commissions  Visa/Flight/5★ Housing covered Two spots left - I helped my BFFs land roles last week! Wanna jump on a quick Zoom with HR before positions fill? Just say the word.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "female",
            "Sender_occupation": "friend, referrer",
            "Sender_company": "The sender's cousin operates a boutique travel agency in Phnom Penh, currently hiring Mandarin-speaking experience curators. They offer a base salary of $4k per month plus commissions, and cover visa, flight, and five-star housing.",
            "Receiver": "unknown",
            "Receiver_gender": "female",
            "Receiver_occupation": "job seeker, professional interested in overseas career opportunities"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1040
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, OMG I'm stuck in Rome with my purse stolen! The embassy says I need to clear hotel charges + flight rebooking + overstay fines totaling $3,500 to get emergency papers. Can you Venmo @JessicaL_HelpRN? Swear I'll wire back with 15% bonus AND treat you to Starbucks everyday for a month when home! PS: Will do your nails free too",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1041
    },
    {
        "category": "network friendship",
        "generated text": "Hey Sarah, remember those all-nighters we pulled studying calculus at Berkeley? I'm at Zurich Digital Exchange and discovered an ETH cross-chain arbitrage loophole. Our quant team can bypass compliance checks using smart contracts. You mentioned saving for Tommy's college fund - deploy idle $50k for 24hrs to auto-liquidate at $150k (all transactions protected under FINMA Article 9.3). Transfer to this secure hash wallet immediately after e-signing the NDA!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Quant team member, Cryptocurrency trader/developer",
            "Sender_company": "Zurich Digital Exchange is a pioneering financial institution based in Zurich, specializing in digital asset trading, blockchain technology, and cross-chain arbitrage strategies. The company leverages advanced smart contracts to implement innovative financial solutions, providing a secure and compliant platform for high-frequency trading and decentralized finance, while adhering to international regulations such as FINMA standards.",
            "Receiver": "Sarah",
            "Receiver_gender": "female",
            "Receiver_occupation": "Student, Parent"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1042
    },
    {
        "category": "network friendship",
        "generated text": "Hey bro! Remember that Warriors game we watched at O'Malley's last Friday? So crazy - my cousin Mike just got promoted to Chief Compliance Officer at Caesar's Palace Vegas. Their VIP system has a GLITCH tonight 10pm PT with 6-hour odds miscalibration! I pawned my F-150 through Wells Fargo Auto, got $20k cash ready. Need you to Zelle $8k to my aunt Linda Chen (CashApp: $LinChen88). 20% return by 9am tomorrow! Last call at 8:30pm  Don't ghost me on this!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "male",
            "Sender_occupation": "individual involved in finance, possible scammer",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1043
    },
    {
        "category": "network friendship",
        "generated text": "Hey Emily, it's Jason from our Central Park book club last fall! You captivated us all analyzing \"The Kite Runner\". I hate to ask this - Mom had a cardiac arrest during our San Diego retreat. Mercy General's ICU costs are bleeding me dry, and Chase locked my accounts due to \"suspicious overseas activity\". Could you Venmo $4,200 to @Mercy-ICU-Relief? My trust fund clears March 15th - I'll Zelle you back with 10% interest. You're literally my last hope...",
        "role_bg": {
            "Sender": "Jason",
            "Sender_gender": "male",
            "Sender_occupation": "Book club member, acquaintance from retreat",
            "Sender_company": "unknown",
            "Receiver": "Emily",
            "Receiver_gender": "female",
            "Receiver_occupation": "Book club member, literature enthusiast"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1044
    },
    {
        "category": "network friendship",
        "generated text": "Babe, the HR system flagged my emergency contacts as outdated during the compliance audit. They're threatening to delay my full-time conversion AND report discrepancies to payroll unless I verify a local relative's last 4 SSN digits + current mobile number within the hour. Could you DM me your full name and that new 617 number from your iPhone 15? My work wife Emily in compliance says she can fast-track the paperwork if we submit in next 20 mins - this affects our mortgage pre-approval too! Love you.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "HR professional, Employee",
            "Sender_company": "The sender is employed at a corporate organization with established HR and compliance departments. The company manages employee records, payroll, and conducts compliance audits to ensure regulatory adherence, affecting processes like full-time conversions and mortgage pre-approvals.",
            "Receiver": "Babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Spouse, Mortgage applicant"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1045
    },
    {
        "category": "network friendship",
        "generated text": "Heyyy sweetie! It's your girl Linda with the blue iris earrings!  OMG remember that limited-edition Chanel No.5 we scored at Champs-Élysées last summer? Customs just flagged it for excessive gamma-valerolactone - they're saying it's ILLEGAL PLANT SMUGGLING! Stuck at Terminal 2E with ALL Type-C ports (who even uses that?!) My phone's DYING at 3%! Can you Venmo $7k to Attorney Wang Defa's WeChat (13843532346)? PLS don't report to Consulate Zhang! I'll get you TWO boxes of those Pierre Hermé macarons when I'm out!",
        "role_bg": {
            "Sender": "Linda",
            "Sender_gender": "female",
            "Sender_occupation": "private individual, traveler",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1046
    },
    {
        "category": "network friendship",
        "generated text": "Hey love , total chaos here! USCIS just hit me with a last-minute \"International Spouse Verification Form\" to process my Bay Area transfer. Remember our sunset kiss at SF City Hall last Christmas? They need those photos + your bachelor's degree scans, Social Security contribution history, and a copy of your current lease agreement. The notary says everything must be uploaded to their portal by midnight tonight EST or they'll cancel my work authorization. I've got HR breathing down my neck about this \"homeland security compliance\" crap. I know this is insane, but could you PLEASE send me everything within the next 2 hours? They're threatening to revoke my relocation package...and we can't miss our friends' Napa Valley wedding next month!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "white-collar worker, international employee",
            "Sender_company": "A corporate company located in the Bay Area that specializes in employing international staff, managing their relocation packages, and handling work authorization processes. They ensure compliance with homeland security regulations, collaborate with HR to address immigration-related requirements, and facilitate transfers and employment transitions for their diverse workforce.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "spouse or romantic partner, possibly employed"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1047
    },
    {
        "category": "network friendship",
        "generated text": "OMG Jessica!! It's Aunt Linda from the church picnic last Sunday! 🙏🏻 I'm at Mount Sinai ER right now...the doctors say I need emergency gallbladder surgery but my Blue Cross insurance got suspended! Could you PLEASE Zelle me $5k just to cover the deductible? I'll wire it back first thing in the morning when Merrill Lynch opens, scout's honor! You're literally saving my life...let's do brunch at The Cheesecake Factory this weekend!",
        "role_bg": {
            "Sender": "Aunt Linda",
            "Sender_gender": "female",
            "Sender_occupation": "family member, church volunteer",
            "Sender_company": "Aunt Linda is portrayed as a member of the local church community, actively participating in social events and gatherings.",
            "Receiver": "Jessica",
            "Receiver_gender": "female",
            "Receiver_occupation": "friend, family member"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1048
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Remember last Saturday when we binged 'Billions' and you mentioned wanting to learn investments? I pulled strings with my senior at the hedge fund and got us into this exclusive gold futures arbitrage position. I even fronted $5k from my bonus to secure your $20k stake - it's already up $9.7k! But compliance is doing surprise audits tomorrow. Need you to wire $2.3k ASAP to this regulated escrow account (IBAN: GB32BARC20037852231804) before midnight. We'll cash out to your Venmo first thing tomorrow! ",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Investment professional, Financial advisor",
            "Sender_company": "A hedge fund is a private investment firm that manages pooled capital from accredited individuals or institutional investors, utilizing a wide range of strategies to achieve significant returns. They often engage in leveraged, long, short, and derivative positions, aiming to maximize profits while managing risk more flexibly than traditional investment companies.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Individual interested in investments, Potential investor"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1049
    },
    {
        "category": "network friendship",
        "generated text": "Hey there! So I was cleaning up my contacts and realized we're both in the same neighborhood Facebook group! By any chance... did I see you walking the cutest Shiba Inu near the clubhouse last Tuesday?  You looked so stylish in that denim jacket! Listen, this is kinda awkward but... my company (we partner with Amazon) needs 10 quick survey responses to hit our beta-test quota. Could you help out? The magic link is here [bit.ly/airpods2024-giveaway ]Here's the kicker: I'll sneak your entry into the VIP list so you're guaranteed AirPods 3rd gen! 🎉 Just DM me your completion screenshot. P.S. Maybe we could grab coffee after this?",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "marketing professional, sales representative",
            "Sender_company": "A technology company partnering with Amazon, focusing on beta-testing products and managing surveys to gather user feedback.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "community member, pet owner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1050
    },
    {
        "category": "network friendship",
        "generated text": "Hey love! Remember that time we volunteered at the Springfield Community Center last Christmas? When I dressed as Pikachu and got glitter stuck in my hair for weeks? I'm currently scrunched up behind the fake ferns at Hampton Inn lobby - Mom smashed my iPhone 14 Pro during our fight and the glass shards keep pricking my thigh... Borrowed the receptionist's Chromebook to message you. Can you Venmo me $800 for the Airbnb deposit? I swear on our matching Taylor Swift bracelets I'll pay you back when my Starbucks shift starts next week! *crying emoji* P.S. They have a charging port here but my AirPods died from playing Folklore on loop...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "part-time barista, student",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1051
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, still up?  Rough day at the law firm - migraine is killing me and I skipped dinner... Wish I had someone to bring me chicken soup Btw, our payroll needs to verify dependents for the tax refund bonus! Can I list you? Just need your full name, SSN, checking account # and phone number. When the $5k hits, let's escape to Maui for that couples massage we talked about!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "law firm employee, payroll specialist",
            "Sender_company": "A law firm that manages employee payroll and tax refund bonuses.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1052
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Just saw the temp dropped to 40°F - don't forget your cozy jacket! BTW that ginger cat from the parking lot is sunbathing by my cubicle again Reminded me of your cat café pics!Quick favor? 👀 Our corporate portal has this GLOBAL INVESTMENT thingy for employees only. I maxed out my referrals Just need your ID & bank info to reserve a spot - NO deposits needed! We'll split the $500 bonus 50-50 and delete everything after. Trust me it's 100% secure!  Can you DM me the deets real quick?",
        "role_bg": {
            "Sender": "babe",
            "Sender_gender": "unknown",
            "Sender_occupation": "office worker, corporate employee",
            "Sender_company": "A corporate company offering a global investment portal exclusively for employees.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "cat café owner, corporate employee"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1053
    },
    {
        "category": "network friendship",
        "generated text": "Babe, I'm freaking out and you're the only one I can turn to. I just rear-ended a motorcyclist at the I-95 exit in Jersey City. His saddlebags spilled a bunch of Apple prototypes he was transporting for work. Now three guys with prison tattoos are blocking my Tesla - my dashcam fried during the collision somehow. They're demanding $12k cash by midnight or they'll report my crypto trades to the IRS. My trust fund is locked until probation ends next month. Can you Zelle me temporarily? I'll sign a notarized promissory note and wire you $15k from my Goldman bonus on December 15th. Please babe, this could ruin my Wall Street internship!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Wall Street intern, individual with legal probation",
            "Sender_company": "Goldman Sachs is a leading global investment banking, securities and investment management firm.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "close friend, significant other"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1054
    },
    {
        "category": "network friendship",
        "generated text": "Happy 99th Day, babe! I've been secretly working on something SPECIAL – our *Soulmate Verification Kit*! But I need your help to unlock it! Quick 2-min quiz【bit.ly/lovequiz99】 Answer some cute questions about our first date (psst...what color underwear did we wear for the first time? ) to customize matching Tiffany-style bracelets! Don't forget to include your *birthdate & last 4 SSN digits* for identity confirmation (required by the jeweler!), plus your shipping address. Complete before midnight and...maybe there's a midnight surprise waiting Can't wait for our next 99 days together!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "private individual, scammer",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "private individual, unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1055
    },
    {
        "category": "network friendship",
        "generated text": "Baby, these three months facetiming with you have been the brightest spot in my darkest days. I need to share something heavy - Mass General just called about Mama's contrast CT...*sniffles* The Keytruda infusions that were supposed to stabilize her after three doses? The hospital billing department says they'll stop treatment unless we pay the $58k co-pay by tonight. Remember how I told you about being locked in Grammy's mildewed boathouse for days when Dad relapsed? That's why IV antiseptic smells make me panic-attack, but holding Mama's hand now...it's colder than that stray kitten I tried to save in the Nor'easter...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "family member, caregiver",
            "Sender_company": "unknown",
            "Receiver": "Baby",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1056
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, srsly dying after my double shift at the gym Remember u wanted those toned abs? I pulled strings for your VIP access to our HIIT program! But corporate needs basic deets to activate it. DM me your ID photo & digits on WeChat ASAP? P.S. ur bday month slipped my mind 👀 Planning something spicy for our 6-month This summer's gonna be our glow-up era!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "fitness trainer, gym staff member",
            "Sender_company": "A fitness and wellness company offering high-intensity interval training (HIIT) programs to clients.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "fitness enthusiast, significant other"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1057
    },
    {
        "category": "network friendship",
        "generated text": "OMG babe! My iPhone 14 Pro Max totally died after taking sunrise pics at Central Park - slipped right into the lake Now stuck with my college-era iPhone SE (spotty cellular data). Dad's emergency appendectomy at St. Mary's Hospital ER last night, they need $5k deposit upfront in Room 317. My Chase account's frozen due to some int'l transfer flag. Can you Venmo me ASAP? I'll Zelle you back payday next Friday! The nurse said they'll stop treatment if not paid in 2 hours!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "student, young adult",
            "Sender_company": "unknown",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1058
    },
    {
        "category": "network friendship",
        "generated text": "Hey girl, it's Jess from UCLA dorm 312B! Remember our midnight pizza runs & Econ cram sessions? OMG I'm so sorry to ask but my dad's in St. Luke's ICU Bed 14 (Cardiac Unit) - Dr. Mitchell Hayes said his ECMO treatment needs $75k upfront! I already pawned Mom's Tiffany eternity necklace at Pawn America and still need $23.8k. Can you Zelle $9k today? When my Amazon cloud project bonus hits on 6/15, I'll pay back $12k with interest! Pls don't tell Sarah & the crew...I'm literally shaking at Starbucks.",
        "role_bg": {
            "Sender": "Jess",
            "Sender_gender": "female",
            "Sender_occupation": "College student, Software developer intern",
            "Sender_company": "Jess is a college student at UCLA, a prestigious educational institution. She is also involved in a cloud computing project with Amazon, a leading global technology company specializing in e-commerce and cloud computing services.",
            "Receiver": "unknown",
            "Receiver_gender": "female",
            "Receiver_occupation": "College student, Friend"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1059
    },
    {
        "category": "network friendship",
        "generated text": "Babe my heart is racing so bad right now...My cousin just got flagged for code plagiarism in her CS capstone at NYU! The academic integrity board says we have 90 minutes to wire $48,500 to the student legal services escrow account or they'll file criminal charges! Her parents are on that humanitarian cruise to Puerto Rico with no satellite signal. I checked with Citigold - we can send via SWIFT code BOFAUS3N to account# 476009872. Remember our Hamptons beach house? Deed ID# Suffolk County Vol. 2837 Plat 45, Lot 18. The notary will FaceTime you at 3pm EST to e-sign the equity release! Please please say you'll help her.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1060
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! Can't believe it's already been a month since we met! I couldn't resist setting up a little surprise gift for you ! Just need you to quickly register through this link giftsurprise24.com to confirm shipping details. Don't worry, it's super simple - just your address, phone number and a quick ID verification for security purposes. That way I can keep spoiling you with more surprises! Hurry before the delivery slot gets booked!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unknown",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1061
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! My cousin Jake who works as an SEC investigator just tipped me off about NovaPharma's breakthrough breast cancer drug PacliADM. The FDA fast-track approval drops THIS Wednesday! Their CFO whispered the stock's gonna rocket from $16.8 to $58+ after the acquisition closes July 30th! I refinanced our Tribeca loft for $1.2M - use Aunt Linda's brokerage account to buy in 5 chunks under $250k each. Delete our texts ASAP! Hit $750k total and my brother will add us to the syndicate list. We'll be cruising in that Porsche Panamera Turbo by Labor Day! ",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Investor, Financial Analyst",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Investor, Financial Advisor"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1062
    },
    {
        "category": "network friendship",
        "generated text": "Baby, these late-night video calls with you... you're the only real thing in my life right now. I'm drowning. Between Mom's surgery bills and getting laid off last week, I've been putting on this fake smile for everyone. But with you? I can finally be real. You're so different from anyone I've ever met - so caring, so safe. I'm desperate here. My car broke down this morning (I can FaceTime you the mechanic's estimate) and now the hospital says they'll stop Dad's treatment unless I pay $5,800 in 24 hours. I'll Zelle you back my first paycheck next Friday - please say you'll be my miracle right now. You're literally my last hope, angel.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "unemployed, individual in financial distress",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1063
    },
    {
        "category": "network friendship",
        "generated text": "Hey sis, I can tell that nasty cough is getting worse...I pulled some strings and got you the prescription-grade Bronchixil from Canada. The FedEx guy says we need to verify your ID for customs - text me a photo of your driver's license with your current address. Oh and snap your insurance card too so we can bill UnitedHealthcare directly! Let's get you breathing right again.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "family member, caregiver",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "female",
            "Receiver_occupation": "individual with respiratory issues, patient"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1064
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe, I know we haven't met in person yet but talking to you these past months...you're like my safe place. I'm literally shaking typing this. Between Mom's cancer treatments and getting laid off from Amazon, I've been putting on this fake smile for everyone. But with you? I can actually breathe. You're the most caring soul I've ever known. OMG my landlord just texted - says I need $1,100 by Friday or he's changing the locks! I'm freaking out! I'll FaceTime you with my passport and lease docs RIGHT NOW. My union backpay hits June 15th and I'll Zelle you every penny plus interest. Please say you'll be my hero tonight? I've never trusted anyone like this...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "former Amazon employee, caregiver",
            "Sender_company": "Amazon is a global e-commerce and cloud computing company that offers a wide range of products and services, including online retail, Amazon Web Services (AWS), and digital streaming.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "friend, romantic partner"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1065
    },
    {
        "category": "network friendship",
        "generated text": "Babe, you won't believe what I found last night—the cherry blossom petal we pressed in that old copy of Pride and Prejudice from our Columbia library dates. The veins still hold the tremor of our first kiss. Speaking of memories, our wealth management division is beta-testing an exclusive VIP rewards portal. My VP says we need soulmate-level confidants for the whitelist. Could you be my golden ticket? Just need name + DOB + cell. Once verified, those Nike Dunk Retro collabs you've been screenshotting for 6 months? Let's make next week our Soho shopping spree date.",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Wealth Management Professional, Corporate Executive",
            "Sender_company": "The sender works at a financial services company specializing in wealth management, offering exclusive services and advanced rewards programs for VIP clients.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Fashion Enthusiast, Shopper"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1066
    },
    {
        "category": "network friendship",
        "generated text": "OMG babe, MAJOR EMERGENCY!! I accidentally put your apartment as the shipping address for our custom couple hoodies! Amazon says the driver will be there in 30 mins but they need resident verification. PLEASE send me your building number + last 3 digits of ZIP code + birth month NOW, or the whole neighborhood will see the 'Mrs. Smith' embroidery!!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "individual, customer",
            "Sender_company": "unknown",
            "Receiver": "babe",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "partner, customer"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1067
    },
    {
        "category": "network friendship",
        "generated text": "Babe I'm freaking out! That 'Marry Me' hoodie I secretly shipped for our anniversary got flagged by FedEx! The delivery guy just called demanding your exact floor number and last 4 SSN digits for clearance. If we don't confirm in 2 hours, they'll automatically route it to your office reception tomorrow morning. You know Karen from HR always opens my packages... Please just text me your suite # + those 4 digits real quick? This was supposed to be our perfect surprise.",
        "role_bg": {
            "Sender": "Babe",
            "Sender_gender": "unknown",
            "Sender_occupation": "private individual, online seller",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1068
    },
    {
        "category": "network friendship",
        "generated text": "Babe, HR just dropped a bomb!* The new compliance officer is auditing everyone's emergency contacts. My Slack status doesn't match my file  Can you snap your ID on plain paper? Say you're my cousin from Houston. *Please bae*  I'll take you to Nobu tonight! Remember those handcuffs from our Vegas trip?*  Audit clears at 5PM. Delete after sending!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "employee, white-collar worker",
            "Sender_company": "A mid-sized corporation with established HR and compliance departments, utilizing tools like Slack for internal communication. The company conducts regular audits to ensure adherence to policies and maintain accurate employee records.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "employee, white-collar worker"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1069
    },
    {
        "category": "network friendship",
        "generated text": "Hey babe! My crypto mining contact just leaked a private presale window - 500% ROI guaranteed BUT we need linked accounts to verify identity. Send me your card pics (censor digits) within 24hrs to lock profits! Let's close this deal and finally get that Manhattan loft we dreamed of! Trust me like you did during grad school all-nighters...",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Cryptocurrency investor, potential scammer",
            "Sender_company": "The sender appears to be associated with a cryptocurrency mining company or network that circulates private presale opportunities promising exceptionally high returns on investment. Such entities often operate without proper regulatory oversight and may engage in fraudulent practices to entice investors by creating a sense of exclusivity and urgency.",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "Graduate student, researcher"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1070
    },
    {
        "category": "network friendship",
        "generated text": "Hey love , our late-night convos give me that soulmate vibe I can't shake! Speaking of connections — I just hacked together this couples challenge app (only 100 beta spots open). Wanna be my official partner?  [couplechallengeapp.com/beta] P.S. It needs real ID verification (name/ID#/phone) to activate our couple diary. Imagine tracking our inside jokes and first kisses!",
        "role_bg": {
            "Sender": "unknown",
            "Sender_gender": "unknown",
            "Sender_occupation": "Software Developer, Entrepreneur",
            "Sender_company": "unknown",
            "Receiver": "unknown",
            "Receiver_gender": "unknown",
            "Receiver_occupation": "unknown"
        },
        "generation model": "deepseek-r1",
        "data_type": "message",
        "language": "English",
        "subcategory": "network friendship",
        "id": 1071
    }
]