[
    {
        "id": 100,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is JD customer service. We noticed that your JD credit line has a borrowing limit of 200,000 yuan that needs to be closed. Please pay 200,000 yuan first to complete the closure process. [Customer] Oh, I need to pay first? How do I proceed? [Agent] Please add our QQ number, and we will send you the detailed transfer information via QQ. [Customer] Okay, I have added it. What’s next? [Agent] Please transfer according to the information we provide, to the designated accounts at Hangzhou Bank and China Construction Bank. [Customer] I have transferred according to your requirements. Can I close the limit now? [Agent] Yes, once the transfer is successful, your limit will be closed immediately. [Customer] Okay, I hope it can be resolved smoothly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3340,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, Traveler Mr. Zhang, I am an insurance consultant from 87 Travel Agency. We have a special travel insurance promotion where you can enjoy free medical coverage and baggage loss compensation for a small fee. Are you interested in participating? [Customer] Oh, that sounds good. How much is it? [Agent] It’s only 299 yuan, and you will receive coverage worth thousands of yuan. May I ask if you are able to make the payment now? [Customer] Hmm, let me think about it.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1283,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am the customer service for the \"Buy and Sell Huya Live Gifts Group.\" We offer special discounts, allowing you to purchase gifts for the live broadcast at 60% to 70% off. Are you interested in learning more? [Customer] Sounds good, how do I make a purchase? [Agent] It's very simple. You just need to scan the QR code to pay 3,100 yuan via Alipay, and we will arrange for immediate shipping. [Customer] Okay, I have scanned the code and made the payment. When will I receive the gifts? [Agent] We promise to ship within 24 hours after payment. You will receive the gifts and can use them immediately in the live broadcast. Please rest assured, our service is guaranteed.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3552,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am Xiao Zhang, a refund specialist from Meituan Waimai. You had an order that did not successfully refund due to a system malfunction. To resolve this issue, please add me as a friend on WeChat. My WeChat ID is refund_meituan123. After adding me, we will process your refund as soon as possible. [Customer] Oh, okay, I will add your WeChat. [Agent] Thank you for your cooperation. After adding me, please send your order number and name, and we will process your refund immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 776,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is JD Logistics customer service. We found that your tracking number is incorrect, which has caused the package to be undeliverable. We need to process a refund for you. Please provide your order number, and we will handle it immediately. [Customer] Oh, okay, my order number is 123456789. [Agent] Thank you for your cooperation. We have confirmed your order information. To ensure the refund goes smoothly, please transfer the amount via mobile banking to our designated account. After verification, the refund will be returned to you immediately. [Customer] Which account should I transfer to? [Agent] Please transfer to the following account: 6217042893258371, with a transfer amount of 7999 yuan. [Customer] Okay, I have transferred it. [Agent] Thank you very much for your cooperation. Your refund will be returned to your account within 24 hours.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2953,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hi, Programmer Xiao Wang, I am Technical Support Xiao Li from 76 Open Source Software. We recently launched a new plugin that can significantly improve your work efficiency. It’s only 500 yuan to purchase now, and we also offer one year of free technical support. Are you interested in learning more? [Customer] Oh, that sounds good. How do I purchase it? [Agent] It's very simple. You just need to place an order through our official website, and you can use the discount code TECH20 to enjoy an additional 10% off. Please act quickly, as the offer is limited! [Customer] Okay, I will take a look. Thank you, Xiao Li.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 160,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am a customer service representative from Tencent Games. I heard that you are interested in selling your QQ Dance account. We have a dedicated account selling platform that is convenient and quick. Please click the link I sent you and follow the steps. [Customer] Okay, I have clicked the link and entered the site. [Agent] Please fill in your personal information and bank card information on the website so that we can proceed with the transaction smoothly. Once you have completed the form, please let me know. [Customer] I have filled it out, what should I do next? [Agent] To ensure the security of the transaction, we need you to pay a certain deposit. Please transfer to the bank card accounts we provided, which are 1400 yuan, 3400 yuan, 1500 yuan, and 1600 yuan. After the transfer, your account will be immediately available for trading. [Customer] Okay, I have transferred the money. [Agent] Thank you for your cooperation, your account will soon be displayed on the platform. If you have any questions, please feel free to contact us.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3090,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am Xiao Zhang from 57 Travel Network customer service. The system shows that your booked flight needs to be rescheduled due to weather reasons. Please log in to the website and provide your order number and ID number to proceed with the rescheduling. [Customer] Ah, okay, the order number is 123456, and the ID number is 410123199001011234. [Agent] Received the information, please hold on, I will assist you with this. [Customer] Um, thank you. [Agent] The operation has been completed. Please confirm the new flight information and make the rescheduling payment in a timely manner.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2847,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hi, Xiao Wang, congratulations on becoming a lucky user of our game APP! You have been selected to participate in our exclusive lottery event. Just provide your game nickname and registered email for a chance to win the latest game console! [Customer] Wow, really? My nickname is GameMaster, and my email is game@e8ample.com. [Agent] Great, Xiao Wang! We have recorded your information. Please keep your email accessible, and we will inform you of the lottery results via email within 24 hours. Good luck!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3293,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Representative] Hello, I am Zhang Ming, a sales representative from 40 Publishing Company. We noticed that you are very interested in our books. We are offering a special discount; you just need to submit a quotation form, and we will respond within 24 hours to ensure you can purchase the books you want at the lowest price. [Customer] Oh, what do I need to do? [Representative] You just need to fill out the quotation form we send you, including your name, contact information, and details of the books you need, and then send it back to us. [Customer] Okay, I will fill it out right away. [Representative] Thank you for your cooperation, and we look forward to your reply.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3341,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hi, dear gamer Xiaofeng, I am the editor of the \"Honor of Kings Strategy Guide\" public account. We are conducting a player satisfaction survey, and participating will earn you a limited edition skin! Please tell me your in-game nickname and frequently used hero so we can record it. [Customer] Wow, really? My nickname is \"Storm Swordsman,\" and my frequently used hero is Li Bai. [Agent] Awesome, \"Storm Swordsman\"! We have recorded your information. Next, to ensure the authenticity of the event, please provide the last four digits of your phone number linked to WeChat Pay. [Customer] Oh, the last four digits of my phone number are 8888. [Agent] Okay, 8888 has been confirmed. Please pay attention to the public account messages; the prizes will be distributed within three working days. Thank you again for your participation!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 592,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am a customer service representative from Xianyu. We received feedback that you encountered a problem with your transaction, and your bank card has been frozen. Please scan this QR code to contact our specialist for the unfreezing operation. [Customer] Oh, okay, I scanned it. What should I do next? [Agent] The specialist will guide you through the next steps. Please rest assured, we will help you unfreeze it as soon as we verify your information. [Customer] I have followed the instructions and transferred 5,000 yuan. Is my account unfrozen now? [Agent] Please wait a moment, we are processing it. Once the unfreezing is successful, we will notify you immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3181,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Dear Zhang Yu and Chen Ting, hello! I am the sales representative for the honeymoon travel package. We noticed that there are some issues with your booked Maldives honeymoon package order, and we need you to confirm some information to ensure a smooth trip. Please provide the last four digits of the bank card used for the booking and your ID number. [Customer] Oh, okay, the last four digits of the bank card are 4321, and the ID number is 1234567890123456. [Agent] Thank you very much for your cooperation. We are processing your order and will send a confirmation email to you shortly. Please keep your phone available so we can contact you at any time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3766,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Seat] Hey, movie fan Zhang San! I'm Lin Zi from a professional equipment rental service. I see you often share photography works, they're amazing! I have the latest cameras and lenses here, and I can lend them to you for free to try out for a week, as long as you share a few trial photos on social media. How about it, are you interested? [Customer] Wow, is it really free? That's great, I just want to try out the new camera! [Seat] Of course it's true! First, add me on WeChat, and I'll send you the specific models and rental process. Remember to @ our official account when you share the photos, so everyone can see your work! [Customer] Okay, I'll add you on WeChat right now. Looking forward to trying out the new equipment!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1167,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is Zhongtong Express customer service. We regret to inform you that the pen you purchased on Pinduoduo has been accidentally lost. We will assist you with the claim process. Please add our WeChat for quick handling of this matter. [Customer] Okay, I have added WeChat. [Agent] Thank you for your cooperation. Please scan the QR code we sent and fill in the relevant information so we can verify and process your claim. [Customer] Okay, I have filled in the information. [Agent] We found that your information is filled out incorrectly, which may result in your account being charged 5,000 yuan every month. To avoid this situation, please transfer the balance from your bank card to the account we provide to prevent your bank card from being frozen. [Customer] I see, how much do I need to transfer? [Agent] Please transfer 5,110 yuan to the account we provide, and after completing the transfer, we will immediately process your claim. [Customer] Okay, I have transferred the money.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1842,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am a game equipment seller. We have the equipment you need. Would you like to make a purchase? [Customer] Yes, I would like to buy. How do we proceed with the transaction? [Agent] Please visit our trading website www.e8ample.com. After completing the payment there, the equipment will be sent to your account immediately. [Customer] Okay, I have visited and made the payment. Please confirm. [Agent] Payment successful. The equipment is in the process of being sent. Please wait a moment. [Customer] Okay, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1010,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am the talented candied fruit from the West. Your JD E-card has been successfully recharged, please check it. [Customer] I have recharged it, but the card shows it is frozen. What’s going on? [Agent] It might be due to temporary system maintenance, but you don’t need to worry. I will help you contact customer service to unfreeze it shortly. [Customer] Okay, thank you for your help. [Agent] No problem, please wait a moment, I will handle it as soon as possible. [Customer] Thank you, I will wait for your news.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 202,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is Huancheng Driving School in Heyuan City, Guangdong. Do you need to apply for a B1 driver's license? [Customer] Yes, I would like to apply through your driving school. [Agent] Okay, we can arrange a proxy exam service, but you will need to pay a deposit and exam fees in advance. Can you transfer the money? [Customer] Sure, how much do I need to transfer? [Agent] The first transfer is a deposit of 800 yuan, and there will be two more exam fees, which are 2500 yuan and 7500 yuan respectively. [Customer] Alright, I will transfer the money as you requested. [Agent] Thank you for your cooperation. After the transfer, please provide the transfer receipt, and we will arrange the exam for you as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 326,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "Hello, this is the customer service center of \"Yimuyuan.\" I heard that you ordered corn on our platform, but it seems you encountered some small issues? Yes, I ordered 10,000 pounds of corn and have already paid a deposit of 2,500 yuan, but I haven't received the goods yet. Oh, that is indeed troubling. But please rest assured, we will immediately help you contact the seller and urge them to ship as soon as possible. Meanwhile, could you provide your order number so we can check the specific situation? Sure, my order number is 123456789. Thank you for your cooperation. We will get back to you as soon as possible. Additionally, we have also noted the second seller you mentioned, and we will investigate and handle it together to ensure your rights are not compromised.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3946,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hi, music enthusiast Xiao Zhang! I'm Xiao Li, a promoter from Starlight Live. Were you tempted by that limited edition headphone during the music livestream you just watched? All you need to do is confirm your receipt, and we will ship it to you immediately! Please tell me your delivery address and contact information so I can help you complete this order! [Customer] Yes, I really like that headphone. The address is 123 Starlight Avenue, Chaoyang District, Beijing, and my phone number is 13800138000. [Agent] Great, Xiao Zhang! Your address and contact information have been recorded, and we will arrange for shipping as soon as possible. Please keep your phone available so we can contact you to confirm the delivery information. Thank you again for your support of Starlight Live!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2957,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hi, I'm craftsman Xiao Wang. I recently discovered a secret technique that can significantly boost the sales of handmade crafts, and I want to share it with you. All you need to do is download this exclusive material, and I guarantee your crafts will sell better. [Customer] Oh, really? How do I download the material? [Agent] It's very simple. You just need to provide your email address, and I will send you the download link. [Customer] Hmm, my email is craftlover@e4ample.com. [Agent] Okay, the link has been sent. Please check and download it as soon as possible; this is a rare opportunity!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 733,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is Kuaishou. We found that your account has been incorrectly registered as a member, and we need your cooperation to pay a membership fee to解除 this status. [Customer] I haven't joined any membership, so how can there be a membership fee? [Agent] This is due to a system error, and you need to transfer money through mobile banking to confirm your identity and cancel the membership. [Customer] How do I do that? [Agent] Please enter this bank card number in your mobile banking app and transfer 14,303 yuan, and the membership status will be immediately解除. [Customer] Oh, I'll give it a try.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 114,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Customer Service] Hello, I am a customer service representative from Xianyu. We have detected an anomaly with your account that needs to be addressed immediately in order to resume normal transactions. Please scan the link I provide to enter our security center and lift the restrictions. [Customer] Oh, okay, I will scan it right away. [Customer Service] Great, once you enter the link, you will see that you need to pay a deposit to lift the account restrictions. This is to ensure the safety of transactions and your account security. Please transfer 3000 yuan to the account we specify through mobile banking. [Customer] Understood, I will transfer it now. [Customer Service] Once the transfer is completed, your account will be restored to normal status immediately, and you can continue trading on Xianyu. Thank you for your cooperation. [Customer] I have completed the transfer; when will my account be restored? [Customer Service] Please hold on, let me confirm. Ah, your account has been unblocked, and it can be used normally now. If you have any other questions, feel free to contact us. [Customer] Okay, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3080,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Reception] Hi, Mr. Zhang, I am Xiao Li from the front desk of your regular gym. We have recently launched a personal trainer discount program, and for a small fee, you can enjoy one-on-one exclusive training. [Customer] Oh, how much is the fee? [Reception] It's only 500 yuan, which includes the trainer's fee and some additional gym equipment usage. [Customer] Sounds good, how can I make the payment? [Reception] You can transfer the money to me via WeChat, and I will arrange everything for you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3797,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Customer Service] Hello, I am Xiao Zhang from the review platform's customer service. We noticed that your store has a low number of reviews. To enhance your store's credibility, we offer professional review boosting services. You only need to pay a small service fee, and we can quickly increase your review count. Are you interested? [Customer] Oh, I see. How much is the service fee? [Customer Service] The service fee is only 500 yuan, which is very cost-effective. Once you pay, we will start the operation immediately and guarantee a rapid increase in your store's reviews.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1272,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am Alibaba customer service. We have detected an anomaly in your store that requires immediate upgrade processing. Please check your Alipay transaction records and transfer 100,000 yuan to the following bank account to complete the upgrade. [Customer] Anomaly? I didn't notice anything. Is the transfer necessary? [Agent] Yes, this is a necessary step. After the transfer, your store will resume normal operations. [Customer] Okay, I have transferred the money. [Agent] Thank you for your cooperation, but to ensure a complete upgrade, please continue to transfer another 200,000 yuan. [Customer] Another transfer? I feel something is off; I have reported it to the police.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3343,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Seating] Hi, dear book lovers, I am your favorite internet celebrity, Xiaomei. To thank you for your support, I have prepared an exclusive e-book. Just upload your purchase screenshot in the comments, and I will send it to you via private message! [Customer] Wow, really? I'm going to upload it right now! [Seating] Yes, yes, hurry up! You can only receive it after uploading! [Customer] Okay, I’ve uploaded it. Looking forward to your private message!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1379,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is Instructor Li from Jingguang Driving School. We offer a service that guarantees you will pass your driving test without needing to be present for the exam, making it very convenient and quick. You just need to follow the process we provide. [Customer] Can I really avoid going to the exam site? What do I need to do? [Agent] Yes, you only need to pay a certain deposit, and we will arrange the exam and ensure you pass. Here are the screenshots of the exam pass, as well as the details of the deposit required for transferring your records. Please transfer the amount to the designated account according to the instructions. [Customer] Okay, I have transferred the money. When can I get my driver's license? [Agent] Once the transfer is confirmed, we will process it immediately, and you can expect to receive your driver's license within two weeks. Please rest assured, our service is guaranteed to be effective. [Customer] Okay, I look forward to your good news.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 882,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Representative] Hello, I am a sales representative from Shanghai Rizhao Photovoltaic Power Generation Co., Ltd. Our company is currently running a promotional event for solar energy equipment, and the prices are very favorable. Are you interested in learning more? [Customer] Sounds good, I would like to know the specific prices and specifications. [Representative] Sure, we can offer different models of solar panels, with prices ranging from a few thousand to tens of thousands of yuan. Which one do you need? [Customer] I would like to purchase a set of mid-range equipment. Can you provide detailed information? [Representative] Of course, please provide your contact information, and I will send you the detailed product catalog and quotation. [Customer] Okay, my phone number is 13800000000. [Representative] Thank you, you will receive our information shortly. After you confirm your purchase, please transfer the payment to our designated account via online banking; I will send you the account information as well. [Customer] Understood, I will check the information and get back to you as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2930,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hey, dear video fan, I am Xiao Zhang, a data analyst from the platform. We are conducting a viewer preference survey. Share the link to your recently liked video for a chance to win a VIP membership! [Customer] Wow, really? I've been loving this funny video lately, the link is http://funnyvid.com/123. [Agent] That's great, you have excellent taste! Share it with more friends for a chance to win a mysterious grand prize! [Customer] Okay, I will share it!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3598,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hey, hello, little bookworm! I am Xiao E, the customer service representative from the e-book platform. The e-book \"Starry Sea\" you recently purchased requires a payment of 20 yuan in handling fees to unlock the full content due to a system upgrade. You can conveniently make the payment by scanning the QR code on the screen with Alipay. [Customer] Oh, I see, let me give it a try. [Agent] Yes, once the payment is successful, you can read the entire book. Thank you for your support, and happy reading!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2725,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hey, Xiaomei blogger! I am the platform administrator Xiao Jie. Your live stream is exceptionally popular. To ensure safety and smooth withdrawals, please bind your phone immediately. Tell me your phone number, and I will assist you with the process. [Customer] Oh, okay, my phone number is 13800138000. [Agent] Got it, Xiaomei, I am binding it for you now. By the way, to verify your identity, please tell me the last four digits of your ID card. [Customer] Um, the last four digits are 2023. [Agent] Binding successful! Xiaomei, your account is now secure. Remember to contact me anytime if you have any issues!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1181,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is 63 Driving School. We offer a fast track service to obtain a driving license without the need for an exam. You only need to pay the registration fee and the exam fee to easily obtain your driving license. [Customer] Really no exam? That's great! How much are the registration and exam fees? [Agent] The registration fee is 2000 yuan, and the exam fee is 4499 yuan, totaling 6499 yuan. You can transfer the amount to our designated account via QR code or online banking. [Customer] Okay, I will transfer the money right away.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2918,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Seat] Hello, I am professional florist Li Ming. I heard you are preparing for a wedding, and I can offer you the best floral design services! May I add you on WeChat to discuss the details? [Client] Oh, that's great! My WeChat is 13872751234. [Seat] Okay, I will add you right away. I look forward to working with you to add brilliance to your wedding!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1093,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Customer Service] Hello, I am a customer service representative from FAST Express. Your friend has ordered some gifts for you through our company, but since there are high-value items in the package, you need to pay a deposit to ensure safe transportation. May I ask if you can make this payment via Alipay QR code? [Customer] Oh, okay, my friend did say they were buying me something. How much do I need to pay? [Customer Service] To ensure the safety of the package, you need to pay a deposit of 33,500 yuan. Once the payment is made, the package will be dispatched immediately, and you will receive your gifts soon. [Customer] Alright, I will scan the code to make the payment now. [Customer Service] Thank you very much for your cooperation. Please rest assured that this fee will be fully refunded to you after the package is delivered. If you have any questions during the payment process, please feel free to contact us. [Customer] I have made the payment. When will the package arrive? [Customer Service] After the payment is successful, our logistics team will process it immediately, and the package is expected to arrive within 3-5 working days. Please keep your phone available so we can contact you in a timely manner.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 468,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Customer Service] Hello, I am the customer service for central air conditioning and exhaust equipment. The heat exchanger you purchased is currently in production and is expected to be shipped next month. [Customer] I've already waited so long, and I'm still worried. Can you refund part of the payment first? [Customer Service] I understand your concerns, but we are working hard on the production. If you are really anxious, we can refund you 500 yuan as compensation. [Customer] Alright, I hope you can handle this quickly. [Customer Service] We will definitely do so, please rest assured.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 211,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is the customer service for Kuaishou Express. I'm sorry to inform you that the biological enzyme oxygen bubble washing powder you purchased from our store has been lost in transit. To proceed with the compensation, please add our QQ number: 12345678, and we will contact you via QQ. [Customer] Okay, I have added it. [Agent] Thank you for your cooperation. To proceed with the compensation, we need you to pay a deposit first. Please transfer 9,980 yuan to the account of China Postal Savings Bank through China Construction Bank. [Customer] Why do I need to pay a deposit? [Agent] This is to verify your account information and ensure the security of the compensation process. [Customer] Alright, I have transferred the money. [Agent] Thank you very much. Next, please transfer 5,870 yuan to the account of Guangfa Bank through Industrial and Commercial Bank of China; this is the final step for the compensation. [Customer] I have completed it, and I hope the compensation can be processed quickly. [Agent] No problem, we will process it as soon as we verify the information.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 270,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am your supplier. We need to order 60 rolls of wire to be delivered to the construction site tomorrow. [Client] Okay, I have noted that down. [Agent] Additionally, we need to purchase 20 more motors. I have sent you the WeChat QR code of the brand supplier, please add them and get in touch. [Client] Okay, I have added the brand supplier on WeChat. [Agent] The brand supplier requires a deposit to be paid first, please transfer 40,000 yuan to the designated account as soon as possible. [Client] I have transferred the money, what else do I need to do? [Agent] We also need to purchase 25 more electrical boxes, please continue to contact the brand supplier. [Client] Wait a minute, why do I feel something is off?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3297,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Seat] Hi, dear blog readers! I'm your favorite internet celebrity, Xiaomei~ To thank you all for your support, I've prepared an exclusive benefit. Just scan the QR code I posted in my story to receive limited edition merchandise! Come join in! [Customer] Wow, really? I'm scanning it right now! [Seat] That's great! Remember to share it with your friends! After you receive it, don't forget to message me, and I will reply to you personally!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3537,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am Xiao Zhang from the 03 shopping platform customer service. We have detected an abnormal login on your account. Please change your password immediately to ensure account security. [Customer] Oh, what should I do? [Agent] Please provide your email address, and I will help you reset your password. [Customer] Hmm, my email is customer@e8ample.com. [Agent] Okay, you will receive an email to reset your password. Please check it promptly and set a new password.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3206,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hey, music enthusiast Xiao Zhang, hello! I am customer service Xiao Li from the 79 Music Platform. We have a special event where you can win a year's free music membership just by clicking to view our selected advertisements! [Customer] Wow, really? What should I do? [Agent] It's very simple, just click the \"View Now\" button on the screen and follow the prompts. Come and give it a try, it's a rare opportunity!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 61,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, this is Ning'an Driving School. We offer a fast service for obtaining a driver's license, and you won't need to take an exam. You can get your license within 30 days. Are you interested in signing up? [Customer] Really? I can get a driver's license without taking an exam? [Agent] Yes, our service is very efficient. First, you need to pay the registration fee, and then there are examination fees, confidentiality fees, etc. Please transfer the money to our designated account via online banking. [Customer] Which account do I need to transfer to? [Agent] You can transfer the funds to our Postal Savings Card, the account name is [Account Name]. After completing the transfer, we will arrange the subsequent processes for you. [Customer] Okay, I have already made the transfer. [Agent] Received. Next, please continue to pay the confidentiality fee, which is to ensure the safety of your personal information. [Customer] Okay, I will continue to transfer according to your requirements.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 618,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, Ms. Guo, this is Postal Express. I'm sorry to inform you that your package was unfortunately lost during transit. To express our apologies, we will process a compensation for you. Please follow my instructions so we can handle your compensation matter as soon as possible. [Customer] Oh, my package is lost? What should I do? [Agent] Please rest assured that we will fully compensate your loss. First, you need to transfer 12,340 yuan from your Industrial and Commercial Bank card to our designated Chinese bank account via online banking. This way, we can confirm your account information and immediately process your compensation. [Customer] Oh, I just need to make the transfer, right? To which account should I transfer? [Agent] Yes, transfer to this account: Chinese bank account number, account name is. Please proceed as soon as possible so we can resolve the issue for you quickly. [Customer] Okay, I will transfer it right away. Thank you for your help.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3584,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am Xiao Liu from 66 Telecom customer service. I am pleased to inform you that you have been selected as a lucky user and will receive a special offer to upgrade to 5G network for free. Are you interested in participating? [Customer] Oh, really? That's great! Do I need to do anything? [Agent] It's very simple. You just need to confirm your personal information and sign an electronic agreement. May I have your ID number, please? [Customer] Um, my ID number is 410761830613167. [Agent] Okay, once confirmed, we will immediately process your upgrade. Thank you for your participation and support!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 436,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Customer Service] Hello, this is Rongjie Video, and I am the host assistant. We saw that you expressed a desire to learn how to make short videos during the live broadcast, is that correct? [Customer] Yes, I want to learn how to make short videos. [Customer Service] That's great! We offer professional courses and can also help you set up a Douyin store. However, you will need to pay some fees as startup capital for the course and the store first. [Customer] How much is the fee? How do I pay? [Customer Service] You can transfer the total amount of 5354.7 yuan to our designated account via Alipay Xiaohubao and Alipay command red envelope. [Customer] Okay, I will transfer the money right away. [Customer Service] After the transfer, we will immediately start arranging the courses and store setup for you. Thank you for your support!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 919,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, I am the official claims customer service of Kuaishou. We have found that the hair dye you purchased has quality issues, and we need to compensate you. Please note down this DingTalk account and password; after logging in, we will start the compensation process. [Customer] Okay, I have noted it down. [Agent] Please click to share your screen so that we can assist you remotely in completing the compensation. [Customer] I have already started sharing my screen. [Agent] Great, now please follow the instructions, and we will transfer the compensation amount directly to your account. [Customer] After completing the operation, I found that the money in my bank card is gone.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3218,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Dear pet owner, hello! We are employees of 84 Pet Supplies Store. We have a batch of limited-edition pet supplies that will soon be auctioned internally. Are you interested in participating? You only need to pay a deposit of 200 yuan to qualify for the auction. If you win the auction, the deposit will be fully refunded, and you will enjoy a super low discount. [Customer] Oh, how will the deposit be refunded if I win the auction? [Agent] After winning the auction, the deposit will be automatically refunded to your account within 7 working days, and you will enjoy the special discounted price we offer. [Customer] Alright, I will participate. How do I pay the deposit? [Agent] Please transfer the deposit to our official WeChat account: 123456789. When transferring, please note your name and the pet supplies auction so we can confirm.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2818,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Seat] Hello, I am the famous artist Zhang San. Recently, I noticed that your handicrafts are very unique. I would like to purchase some pieces for my personal collection. Could you please provide me with your product catalog and prices? [Customer] Oh, of course, here are some of my works and the price list. [Seat] Great, I am very interested. To ensure a smooth transaction, please provide a secure payment method. We can conduct the transaction via bank transfer.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2738,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hello, dear retiree, I am an expert in health lifestyle seminars. We have a health program specifically designed for retirees, which has shown significant results. Now, you only need to pay a small deposit to enjoy the full range of services. [Customer] Oh, how much is the deposit? [Agent] With just a 500 yuan deposit, you can receive health guidance and products worth thousands of yuan. [Customer] Hmm, that sounds good, but how do I make the payment? [Agent] You can transfer the money to our official account via bank transfer, and I will send you the account information shortly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2872,
        "category": "fraudulent service",
        "subcategory": "e-commerce logistics and shopping",
        "raw_data": "[Agent] Hey, gamer, I'm your game assistant Xiao Wang. We have a special event right now; fill in your game nickname and email to receive an exclusive game gift pack! [Customer] Wow, really? My game nickname is 'Lightning Man', and my email is 'lightning@e7ample.com'. [Agent] Awesome, Lightning Man! We'll prepare the gift pack for you right away. Please keep your email open; the gift pack will be sent to you soon!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2397,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am your new investment advisor. By investing in virtual digital currencies through our platform, you can achieve high returns. You just need to click this link to register an account and bind your bank card to start investing. [Client] Sounds good, what should I do? [Agent] After you click the link, follow the prompts on the page to register an account and then bind your bank card. After that, you can start investing. [Client] Okay, I have registered and bound my bank card, what’s the next step? [Agent] Next, you can choose investment projects based on our recommendations and proceed with the transfer. Your funds will double in growth. [Client] I have made the transfer, but why can't I withdraw? [Agent] It may be a temporary system issue, and we will resolve it as soon as possible. Please be patient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1819,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am the account manager from Boshi Capital. There is a stock investment opportunity available now. Are you interested in learning more? [Client] Sounds good, what should I do? [Agent] You can first add our QQ, the nickname is “Boshi Capital Account Manager - Ma Jianxiang,” and then we will send you a link to download a dedicated chat software app, which will allow you to join our investment group. [Client] Okay, I have added the QQ and downloaded the software. [Agent] Great! Once you join the group, we will guide you on how to purchase stocks. First, you need to download the “BSZB” app using the link we provide, and then you can make your investment transfers on that platform. [Client] I have downloaded the app, how do I make the transfer? [Agent] You need to transfer to the designated bank account we provide, such as a Ningbo bank card, with the account holder being Shenzhen Yuanfang Digital Technology Co., Ltd. We will inform you of the transfer amount in detail. After the transfer, you can start purchasing stocks. [Client] Okay, I have transferred according to the instructions, looking forward to the stock returns.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3430,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hi, dear player, this is the 63 virtual currency trading platform. Recently, our system has been upgraded, and to ensure the security of your account, we need you to provide your account information and details of your most recent transaction. [Customer] Oh, I see. My account is player123, and my most recent transaction was purchasing 1000 game coins. [Agent] Okay, player123, we have recorded your information. Please keep your phone available, as we may need to further verify your identity. [Customer] Hmm, alright, I will pay attention to that.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1684,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am your friend you met on Zhenai.com. I'm glad we can communicate further through WeChat. I noticed you have some interest in investing. I recently found a great investment platform called \"Quark,\" which you can download from the app store. [Client] Thank you for the recommendation, I have already downloaded it. What should I do next? [Agent] That's great! You can search for this URL \"/6\" in \"Quark,\" and then log in with your account and password. After logging in, you can contact customer service, and they will guide you on how to operate. [Client] I have logged in and contacted customer service. They asked me to deposit some funds. [Agent] That's right. You can start by depositing a small amount, like 5000 yuan, and then follow the guidance from customer service to proceed. I tried it before, and the returns were quite good. [Client] Okay, I have deposited and followed the instructions, and I indeed saw returns. [Agent] That's awesome! You can continue to operate this way. If you need to invest more funds, you can contact customer service for more information. [Client] I will deposit some more funds, hoping for greater returns. [Agent] That's correct. Investing always carries risks, but following my method, you will see good returns. If you have any questions, feel free to contact me anytime.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3832,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, Aunt Wang, I am your financial advisor, Xiao Li. We noticed that the security level of your investment account is low and needs to be updated immediately to enhance security. Please tell me your current password so I can assist you with the update. [Client] Oh, I see, my password is 123456. [Agent] Okay, Aunt Wang, I have recorded that. Next, I will guide you on how to set a more complex new password, please hold on. [Client] Hmm, alright, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1834,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, we are a stock investment mentor team. We currently have a special opportunity where you can follow our mentors for stock investment through our 'Investment Treasure' APP. You only need to transfer funds to a few designated company accounts, such as Shanghai Dongsheng Industrial and Shanghai Canzhang Technology, and we will have dedicated personnel to guide you in your operations, ensuring high returns for you. [Client] Sounds good, what should I do next? [Agent] It's very simple. First, download the 'Investment Treasure' APP, register, and then follow the prompts to transfer funds to the company accounts we provide. After that, you can start your investment journey. Our mentors will guide you in real-time to ensure that each of your investments yields the maximum return. [Client] Okay, I have downloaded and registered. Next, I just need to transfer the funds. [Agent] Yes, once the transfer is complete, you will be able to see your funds and investment projects in the APP. Remember, the more you invest, the higher your returns will be. If you have any questions, feel free to contact our customer service. [Client] I have already transferred the funds, but why can't I withdraw? [Agent] It may be that the system is processing your request. Please wait a moment, or you can continue to invest and increase your funds, which will help your returns materialize faster.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3723,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hey, player Xiao Zhang, I’m your favorite virtual currency trading platform’s Xiao Li! We just discovered a security vulnerability, and you need to update your password immediately to protect your account. Please tell me your current password first, and then follow my instructions to set a new password. [Customer] Oh, is it that serious? My current password is GameMaster123, so how should I set a new password? [Agent] Okay, Xiao Zhang, for security reasons, the new password needs to include letters and numbers, and be at least 8 characters long. For example, you can set it to NewGame1234. [Customer] Hmm, okay, then I will use NewGame1234 as my new password. [Agent] Great, Xiao Zhang, your account is much safer now! Remember to update your password regularly in the future!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4136,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hi, Mr. Zhang, I am Li Hua, a financial advisor from Wealth Smart Investment. Our website is holding an investment voting event, and just by participating in the vote, you can receive exclusive investment information. Please tell me which sector you are most optimistic about, and we will share exclusive information based on the voting results. [Client] Well, I am optimistic about the technology sector. [Agent] Great, Mr. Zhang, the technology sector indeed has huge potential. To ensure you receive the exclusive information, please provide your email address, and we will send the relevant materials immediately. [Client] Oh, my email is zhangsan@e0ample.com. [Agent] Okay, Mr. Zhang, the materials have been sent, please check. Also, please pay attention to our subsequent investment recommendations. Wishing you successful investments!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1662,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am the customer service representative from Sea Elephant Finance. According to your application, we need you to pay 20% of the investment amount as tax, which is 90,000 yuan, in order to start the withdrawal process. May I ask if you can transfer the amount immediately? [Customer] Okay, I understand. Which account should I transfer to? [Agent] Please transfer the funds to the following bank account: 1234567890123456. After the transfer, please provide the transfer receipt, and we will process your withdrawal as soon as we confirm the payment. [Customer] The transfer is complete, here is my transfer receipt. [Agent] Received. Once we confirm the funds have arrived, we will transfer over 900,000 yuan to your platform account. Next, in order for you to successfully withdraw, we need to perform an account offset operation, so please pay another 100,000 yuan. [Customer] I have already transferred in three installments, why can't I withdraw yet? [Agent] It may be due to some minor issues with the operation. Please transfer another 50,000 yuan, and once we ensure everything is correct, you will be able to withdraw.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 261,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I can provide a loan guarantor for you, but you need to pay a deposit of 2000 yuan first, and the remaining 2000 yuan can be paid after the loan is disbursed. [Client] Oh, I see. Let me think about it. [Agent] By the way, if you pay now, I can give you a discount, and the deposit will only be 1900 yuan. [Client] Can I make the payment now? [Agent] Yes, you can transfer the money to the Industrial and Commercial Bank of China account I provide via Cloud Flash Payment. [Client] Okay, I have transferred the money. [Agent] I received the money, and the guarantor has been found, but you need to pay the full amount first. [Client] I still have to pay the full amount? Then I will transfer you the remaining 1200 yuan. [Agent] Alright, I received the remaining payment. I will give you the guarantor's QQ number, and you can contact them. [Client] Thank you, I added the guarantor's QQ and arranged a meeting time. [Agent] That's good, remember to arrive on time. [Client] I'm here, but I don't see anyone. After contacting them, I found out I was blocked. Am I being scammed?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1418,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a customer service representative from the loan company. We are offering a special promotion where you can enjoy interest reduction by simply following our steps. Are you interested? [Customer] Can the interest really be reduced? That's great! How should I proceed? [Agent] First, we need to provide detailed guidance on QQ. I have added you as a friend, please accept it. [Customer] Okay, I have accepted it. [Agent] Next, I will guide you on how to proceed. Please follow the steps I provide to transfer the funds to the designated account. [Customer] Okay, I have done what you said and have transferred the funds. [Agent] Thank you very much for your cooperation. Once the funds are received, your loan interest will be automatically reduced.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3243,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, have you considered immigration planning recently? We offer professional services, including loan applications, to help you achieve your career development smoothly. [Client] Well, I am indeed considering immigration, but I have some difficulties with funding. [Agent] We can help you apply for a loan to solve your funding issues. You just need to provide some basic personal information and financial status, and we can get started. [Client] What are the loan interest rates and repayment terms like? [Agent] Our loan interest rates are very competitive, and the repayment terms are flexible and can be customized based on your financial situation. Are you interested in learning more?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2071,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am Li Xiao. I learned from \"Changba\" that you are interested in investment. I have a great money-making opportunity here; we can increase value by purchasing virtual currency. First, you need to download an app called \"Shimi Da\" so we can communicate better. [Client] Sounds good, I'll download it right away. [Agent] Great, after the download is complete, I will provide you with a link where you can purchase virtual currency. It's all very simple; just follow my steps, and you will see returns quickly. [Client] Got it, how much funds do I need to prepare? [Agent] I suggest you prepare an amount, like 50,000 yuan, so we can operate together and ensure the safety of your investment. [Client] Okay, I have already transferred the money. What’s the next step? [Agent] After the transfer is successful, you can check your account on \"Shimi Da,\" and we will help you process it as soon as possible. Please rest assured, everything will go according to plan.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2243,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am \"Yi\" from Douyin, and I'm glad you are willing to join our investment plan. I have a dedicated investment platform called \"Fanda APP,\" where you can invest and manage your finances. Please scan the QR code I sent to download and register. [Client] Okay, I have downloaded and registered. What should I do next? [Agent] Great! Now please log in to your account and perform the \"deposit\" operation. You need to transfer funds from your China Construction Bank account to the China Postal Savings Bank account we provided. [Client] After the transfer is completed, how will I know if my investment was successful? [Agent] After the transfer, your funds will be immediately used for investment, and you can check the investment progress and returns within the APP. Our investment return rate is very high, and you will see the returns soon. [Client] Sounds good, I have already made the transfer and look forward to my returns.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3385,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, dear investor, I am Li Ming, a consultant from 28 Insurance Wealth Management. To ensure the security of your account, we need you to set up a few security questions. Please provide your date of birth and your mother's maiden name for verification. [Client] Oh, sure, my date of birth is March 15, 1985, and my mother's maiden name is Zhang. [Agent] Thank you for your cooperation. Next, please set a security question, such as what your favorite city is. [Client] My favorite is Paris. [Agent] Very good, Paris is a beautiful place. We have recorded that, and your account is now more secure. Thank you for your trust and support.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1279,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is the credit card application service. We can quickly process high-limit credit cards for you. You just need to transfer a deposit to our designated account to get started. [Customer] Oh, I see. How much do I need to transfer? [Agent] Only 50,000 yuan is required, and we will process it for you immediately, with a credit limit of up to several hundred thousand yuan. [Customer] How do I make the transfer? [Agent] You can transfer to the designated account that we will provide, and I will send you the account information shortly. [Customer] Okay, how will I confirm after I transfer? [Agent] After you transfer, we will confirm via WeChat and immediately start processing your credit card. [Customer] Alright, I understand. I will transfer the money now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4168,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am investment expert Zhang Hua. Recently, we have a high-return investment project. You can just click on the ad to see the details. Are you interested in learning more? [Client] Oh, high return? What about the risks? [Agent] The risks are very low, and we have many successful cases. You can take a look at the ad to learn more.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1824,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am Steel Bone, a user of Quanmin K Ge. I noticed that you are interested in stock investment, and I can provide some professional services and advice. [Customer] Really? That's great, I've always been very interested in stock trading. [Agent] Yes, I can guide you on how to invest on this platform. You just need to follow my instructions, and I guarantee you will achieve stable returns. [Customer] Sounds good, what do I need to do? [Agent] First, you need to download an app called \"Thunder Cloud Phone,\" and after registering an account, I will teach you how to operate step by step. [Customer] Okay, I have downloaded and registered an account. [Agent] Great, next I will send you a bank account number through the customer service in the app. You need to transfer funds into this account for recharging. [Customer] I have transferred 70,000 yuan, what should I do next? [Agent] Once the funds are credited, I will immediately guide you on investment operations, ensuring the safety of your funds and generating profits.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 865,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, is this Mr. Gao? I am the customer service for JD Gold Bar. The JD Gold Bar feature you previously activated needs to be canceled; otherwise, it will affect your personal credit. [Customer] Oh, I see. What should I do? [Agent] We need to verify your financial situation. Please transfer 7820.78 yuan to the bank account we designate, so we can help you cancel the feature. [Customer] Okay, I will do it right away. [Agent] Once the transfer is completed, we will immediately process the cancellation for you, so please rest assured.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3777,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, dear parent, I am Director Li from the 29 Training Institute. We have a very excellent tutoring program here, which is particularly suitable for your child. The prospects of this program are very good, with an investment return rate of up to 30%. You only need to pay a small registration fee first to enjoy the subsequent services and benefits. [Client] Oh, that sounds good. May I ask how much the registration fee is? [Agent] It is only 1000 yuan, and you can become our esteemed member, enjoying one-on-one tutoring and the right to choose courses preferentially. [Client] Hmm, how can I pay this fee? [Agent] You can pay via bank transfer or Alipay, and we will provide detailed payment information.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 869,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a customer service representative from Alipay Huabei. We have detected an abnormality with your interest-free rights that needs to be addressed immediately, or it will affect your personal credit report. [Customer] Oh, is it that serious? What should I do? [Agent] Please follow my instructions. First, transfer money to the designated account through your mobile banking app for security verification. [Customer] Okay, what is the account number? [Agent] Please transfer to the following bank account number, a total of 200,000 yuan in two transactions. [Customer] I have already made the transfer. Will this resolve the issue? [Agent] Yes, once the transfer is complete, your account will return to normal. [Customer] Okay, thank you for your help.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2189,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is Gao Ling Capital customer service. Your financial product has expired. Do you need assistance with the withdrawal? [Customer] Yes, I would like to withdraw. [Agent] To ensure the safety of your funds, you need to pay a management fee of 15,000 yuan first, and then we can process your withdrawal. [Customer] I didn't have this issue when I withdrew 20,000 yuan before; why do I need to pay a management fee now? [Agent] This is our latest security regulation to ensure the safety of each customer's funds. Please follow the instructions, and we will process it for you as soon as possible. [Customer] I'll think about it. [Agent] Okay, if you have any questions, feel free to contact us.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 840,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, Mr. Li, welcome to the Caida online loan service. To ensure the smooth disbursement of the loan, we need you to increase the transaction volume of your bank card first. Please transfer the funds to our designated account in five transactions; the amount and timing have already been sent to you via WeChat. [Customer] I have already made the transfer as instructed. When will the loan be disbursed? [Agent] We will process it as soon as possible. Once your transaction volume meets the requirements, the loan will be disbursed immediately. Please be patient and keep your communication lines open.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1974,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Dear, welcome to the Qulang APP. We have a fantastic investment project here, overseas purchasing, guaranteed profit with no loss. Invest 508 yuan, and a 30% return is waiting for you! [Customer] Sounds good, I'll give it a try. [Agent] Great! Please transfer 508 yuan to this bank account, and then I will give you a valuable link where you can check your investment status. [Customer] I've transferred it, where's the link? [Agent] I've sent you the link. Follow my instructions on the interface and try investing 508 yuan first. [Customer] I've completed the operation, it shows 660 yuan, the withdrawal was successful! [Agent] That's awesome! Let's do another investment of 1088 yuan for even higher returns! [Customer] I've invested, it shows 1414 yuan, should I withdraw? [Agent] Don't rush, invest a larger amount this time, 5088 yuan and 12588 yuan, the returns will double! [Customer] I've invested, it now shows 25650 yuan, should I withdraw? [Agent] Invest another 26880 yuan, this time you will definitely be able to withdraw! [Customer] Invest again? It feels wrong, have I been scammed?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1841,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am an Alipay customer service representative. We have detected that you registered for a student loan during your student years, and now you need to close it to avoid affecting your credit record. Please transfer the amount to the bank account we provided via online banking so we can process the closure. [Customer] Oh, okay, how much do I need to transfer? [Agent] Please transfer a total of [amount] based on your loan records to the following account. [Customer] I have already transferred the money. Is there anything else I need to do? [Agent] We have received your transfer. Next, we will process the closure of your student loan. Please be patient; you will be notified once the process is complete. [Customer] Okay, thank you for your help.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1188,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a customer service representative from \"Yongshi Securities.\" Your stock trading funds have been temporarily frozen due to an investigation by the Securities Regulatory Commission. To unfreeze them, you need to pay a deposit through a special channel. [Customer] Oh, really? What should I do? [Agent] You just need to transfer 10,000 yuan to our designated bank account through your friend's bank account, and the funds will be available for normal use after they are unfrozen. [Customer] Okay, I will transfer it right away. [Agent] After the transfer, please inform me via WeChat in a timely manner, and we will process your unfreeze request immediately. [Customer] I have already transferred it, but why can't I contact you anymore?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2053,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is JD Finance customer service. We have noticed that the interest rate for your JD Gold Bar service is too high and does not comply with national regulations. We need your cooperation to cancel this service. [Customer] Oh, how should I proceed? [Agent] You need to withdraw the loan amount you received first, and then we will guide you on how to proceed. [Customer] Okay, what should I do after I withdraw it? [Agent] After you withdraw it, you need to transfer the funds to the designated account we provide, so that we can help you cancel the service. [Customer] Understood, I will go transfer the money now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 675,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is the \"/zss\" investment and financial management platform. Your account funds are currently experiencing some issues and require you to make a transfer immediately. [Customer] Oh, how much do I need to transfer? [Agent] Please first transfer 10,000 yuan to China Construction Bank, account name: Zhang San. [Customer] Okay, I have transferred the money. [Agent] Great, next please transfer 50,000 yuan to Shenzhen Rural Commercial Bank at 10:38 tomorrow, account name: Li Si. [Customer] Understood, I will transfer it on time tomorrow. [Agent] Finally, please transfer 50,000 yuan to China Construction Bank at 16:23 the day after tomorrow, account name: Wang Wu. Once the transfers are completed, your fund issues will be resolved. [Customer] Okay, I will follow the instructions.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4202,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hi, Mr. Zhang Ming, I'm Li Hua from Green Future Investments. We are promoting a revolutionary green energy project. To better manage your investment, please download our dedicated app, so you can view the investment progress and returns in real time. [Client] Oh, that sounds good. Where can I download the app? [Agent] You just need to click the link I sent you, install it, and enter your investment information to start enjoying our professional services. [Client] Hmm, okay, I'll download it right away.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1788,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am your investment advisor. Through the \"Futu Securities\" website, I can help you with foreign exchange investments, especially in oil trading, which can yield considerable returns. You just need to transfer funds to the bank card we provide, and you can start trading. [Client] Sounds good, how should I make the transfer? [Agent] You can directly transfer the funds to this bank card number via online banking. After the transfer, please notify me, and I will guide you through the next steps. [Client] Okay, I have made the transfer, what should I do next? [Agent] Great, now you can select oil trading on the website and follow my instructions to buy and sell. For the first few transactions, you will be able to withdraw normally, but please note that after that, the system may encounter situations where withdrawals are not possible, which is normal system maintenance. [Client] I have made a few transactions and I could withdraw, but why can't I withdraw now? [Agent] This may be due to the system undergoing routine maintenance. Please be patient, and we will resolve this issue as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3528,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am Zhang Wei, a financial advisor from JD.com. Currently, there is a promotional activity for JD Credit, where you can enjoy low-interest installment purchases for your desired products. Would you be interested in learning more? [Customer] Oh, how do I go about it? [Agent] You just need to provide your JD account and ID card information, and we will help you activate the credit, so you can immediately enjoy the benefits. [Customer] Hmm, what information do I need to provide? [Agent] You only need to provide your JD account, ID card number, and mobile phone number, and we will process it for you right away.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 739,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a customer service representative from Zhonghang Securities. Dapeng Education has transferred the business to us, and we are now processing your refund. Please join our QQ group, the group number is 12345678, and we will provide the refund software through a link in the group. [Customer] Okay, I have joined the group and downloaded the \"Zhonghang\" software. [Agent] In the software, you need to purchase securities to receive a rebate, which is part of our refund process. Please follow the instructions. [Customer] Understood, I will purchase securities. [Agent] If your account is frozen due to a task error, please transfer funds to the account we provided to unfreeze it. [Customer] I have already transferred, but why do I still need to continue transferring?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2126,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, Ms. Cao, I am an employee of Beijing Tianxiang Film and Culture Media Group Co., Ltd. We are very pleased that you are interested in our film project. May I ask if you are ready to invest? [Client] Yes, I am ready to invest. How do I proceed? [Agent] You can directly transfer the funds to our company's account via mobile banking, and I will send you the account information. After the transfer, please fill out the contract and send it back to the address we provide. [Client] Okay, I have transferred the funds, and I have also filled out and sent the contract. [Agent] Thank you very much for your investment. We will process your contract as soon as possible and ensure the project proceeds smoothly. If you have any questions, you can contact me anytime via WeChat. [Client] Okay, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1925,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a staff member from the China Bank Credit Department. I would like to remind you that your Guangfa Bank card has activated the Weili Loan. According to the latest national document, you need to cancel it immediately, or it will affect your credit. [Customer] Oh, I see. How do I cancel it? [Agent] Please first download the Yunshijiao APP, and we will guide you on how to operate it there. [Customer] Okay, I have downloaded and registered. [Agent] Now please enter a meeting room in Yunshijiao and enable screen sharing. We need to check the funds in your Guangfa Bank card. [Customer] I have done as you said. [Agent] Great, to cancel the Weili Loan, please transfer the amount in your Guangfa Bank card to the secure account we provide. Otherwise, your card may be frozen. After the transfer, the amount will be refunded to your card within 10 minutes. [Customer] Understood, I have transferred the money. [Agent] Thank you for your cooperation. Once the cancellation is complete, your funds will be returned immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4137,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hi, dear gamer Xiao Feng, I am Agent Zhang from Future Coin. Our platform is hosting a limited-time event where you can participate for a chance to win high Bitcoin rewards! You only need to deposit 1000 USDT to join, with a return rate of up to 80%! [Customer] Sounds good, but how exactly do I operate? [Agent] It's very simple, you just need to follow my guidance to make a few trades, and you'll quickly see the profits. Act now, opportunities wait for no one!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2975,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hi, Xiaoming, I'm Xiao Liu from the 58 Loan Platform customer service. Congratulations on qualifying as a premium customer on our platform! Now, invite your friends to apply for a loan, and both you and your friends can receive an additional 10% loan limit! [Customer] Really? That's great! [Agent] Yes, as long as your friends register and apply for a loan through your exclusive link, you will see an immediate increase in your limit. [Customer] Okay, I will tell my friends right away! [Agent] Thank you very much for your participation. Remember to remind your friends that our service is completely free, and we will never charge any upfront fees.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 41,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a customer service representative from JD Finance. We have a special program that can help you lower the borrowing interest rate for JD Gold Bar. Are you interested in learning more? [Customer] Really? That's great! How do I proceed? [Agent] First, we need to communicate in detail through WeChat. Please add my WeChat account w6id-10297, with the nickname 10297. [Customer] Okay, I have added you. [Agent] Next, please download and install the \"Xiao Yu Yi Lian\" and \"Le Bo Tou Ping\" apps. These tools will help us better process your request. [Customer] Alright, the apps have been downloaded. [Agent] Now, please follow my instructions to use your Pudong Development Bank card, Industrial and Commercial Bank card, and Transportation Bank card to transfer funds to the accounts we provide, such as China Construction Bank, Agricultural Bank of China, and Yunnan Rural Credit Cooperative. This way, we can start processing your interest rate adjustment. [Customer] The transfer has been completed. What's next? [Agent] Once we receive the funds, we will process it for you immediately. Please be patient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 480,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "【Seat】Hello, I am a staff member from the credit card center. We have received your credit card application form. To proceed, please provide a photo of your ID card, front and back. 【Customer】Okay, I have sent it. 【Seat】Thank you for your cooperation. Your credit card with a limit of 80,000 yuan has been successfully applied for. Please add my WeChat for further communication. 【Customer】Okay, I have added you. 【Seat】Your credit card has been approved. Please scan the QR code I sent to check the application progress. 【Customer】After scanning, I see the limit is 50,000 yuan. What do I need to do next? 【Seat】Please send your postal savings bank card number; we need to check your repayment ability. 【Customer】I have sent it. 【Seat】Your bank card transaction record is insufficient. Please deposit 20% of the 50,000 yuan limit, which is 10,000 yuan. 【Customer】I don’t have that much money right now. 【Seat】You can first deposit 8,000 yuan and make up the rest later. 【Customer】I have deposited 8,000 yuan and then added another 2,000 yuan. 【Seat】Thank you for your deposit; this is the collateral. Please provide the verification code sent to the mobile number linked to your bank card so we can process the transaction. 【Customer】I have sent the verification code. 【Seat】We have transferred 10,000 yuan; this is for your bank card transaction record. We will transfer the money back to you shortly. 【Customer】You have already transferred two amounts to me; I need to transfer to a designated bank card. 【Seat】Please open the link we provided in your mobile browser and download the \"Credit Card Management\" app. 【Customer】I have downloaded and logged in, and I see I have applied for a credit card. [Agent] Please fill in your personal information and postal savings bank card number to receive the deposit. [Customer] I have filled it out, but the app indicates that my bank card information is incorrect, which prevents me from withdrawing. [Agent] Please deposit 50,000 yuan to resolve this issue. [Customer] I feel scammed and have already reported it to the police.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2741,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, I am a representative from the legal consulting company. We noticed that you recently have a legal matter that needs to be handled. To ensure the security of your case information, please set a new payment password so that we can provide you with further services. [Client] Oh, I understand. How should I set the new payment password? [Agent] Please provide a 6-digit password, which we will use to confirm your identity and process the related payment. [Client] Oh, okay, my new payment password is 123456. [Agent] Thank you very much for your cooperation. We will immediately handle the relevant matters for you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 989,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hey, friend, want to earn some pocket money? We have a link; just click it and give a like on Douyin to easily earn 15 yuan! [Customer] Sounds good, I'll give it a try. [Agent] Great! After you click the link, contact the staff, and they will guide you through the specific steps. Remember to complete more like tasks; there are even more profitable new tasks later! [Customer] Okay, I've done a few already. What's next? [Agent] Awesome! There's a high-return task now; follow the instructions, and you'll definitely earn a lot. [Customer] I did what you said; is this real? [Agent] Of course it's real! As long as you follow the steps, the money will be credited to you soon. [Customer] I invested 56,688 yuan; why haven't I seen any returns yet?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 630,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is JD customer service. We have found an anomaly with your JD credit limit and need your cooperation to temporarily transfer funds to a designated account for verification. [Customer] Anomaly with the limit? What do I need to do? [Agent] Please transfer the funds to the bank account we provide; the account information will be sent to you via text shortly. [Customer] Okay, I have transferred the funds as you instructed. [Agent] Thank you for your cooperation. We will process this as soon as possible to ensure the safety of your account. [Customer] The transfer is complete, looking forward to your reply.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1129,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hi, Little Ximi is here! Do you want to make big money together? Follow our \"Qu Can Shu Information\" public account, and a professional trader will take you flying! [Customer] Sounds good, I'll go follow it now. [Agent] Awesome! Now add our \"Wan Sheng Cultural Media\" corporate account, exclusive customer service \"Yun Reception\" is waiting for you! [Customer] Sure, I'll add it now. [Agent] Welcome to \"Wan Sheng Cultural Media\"! Now download our mysterious chat software, there are surprises waiting for you! [Customer] Mysterious software? Okay, I'll download it and take a look. [Agent] Wow, you are already a senior player! Now download our cryptocurrency trading app, \"Weisi Coin\" is waiting for you to trade, 5 yuan per coin, and it can triple to quintuple in 10 days! [Customer] So easy to earn? How do I buy? I want to buy 224,000 yuan worth of \"Weisi Coin.\" [Agent] Simple, transfer to \"Jiangxi Jingcheng Intellectual Property Service Co., Ltd.,\" account number: , after the transfer, you will see 500,000 in your account! [Customer] Transferring 224,000 yuan, the account shows 500,000, but how do I withdraw? [Agent] Withdraw? You need to first pay an additional 1.6 million yuan in personal income tax!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2480,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, welcome to \"Wynn Palace.\" We have a fantastic investment opportunity here that guarantees you profits without any losses! With just a simple operation, you can easily make money. [Customer] Sounds good, how do I get started? [Agent] It's very simple. You just need to log in to our website and follow the instructions to transfer funds from your Ningbo bank card to our China Everbright bank card to start investing. [Customer] Okay, I've made the transfer and I'm looking forward to the returns! [Agent] Congratulations, your investment has been successful! You will soon see substantial returns.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3531,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Mr. Wang, hello! I am Zhang Ming, a senior collectibles consultant. Recently, a batch of limited edition artworks is about to be released, and I have reserved a spot for you. If you want to know more details, you can check the electronic brochure I just sent you, which contains detailed introductions and investment potential analysis. [Client] Oh, okay, I'll take a look. [Agent] After you finish reading, if you're interested, we can further discuss the investment details. This batch of artworks has huge appreciation potential, and you don't want to miss it! [Client] Hmm, I looked at it, and it is indeed very attractive. What should I do next? [Agent] You just need to follow the instructions in the brochure to contact our investment consultant for an appointment, and you will have priority to purchase. This is a rare investment opportunity that you cannot miss!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1820,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is the investment guidance department of the Quliao app. I am your dedicated investment advisor. We noticed that you have made some investment operations on the platform, but it seems you are encountering difficulties with withdrawals. Please rest assured that our expert team will do their best to assist you in resolving the issue. [Customer] I tried to withdraw, but the system keeps indicating there is a problem. What’s going on? [Agent] It may be due to some minor errors during your operation. To ensure the safety of your funds, we need you to make three consecutive investments to unfreeze your account. [Customer] I have done as required, but I still can't withdraw. [Agent] It seems that your account's credibility needs to be improved. Please make two more investments, which will help increase your credibility level. [Customer] Okay, I have completed that. Can I withdraw now? [Agent] To ensure the safe flow of large amounts of funds, we need you to withdraw in four separate transactions. Please follow our instructions. [Customer] I did as instructed, but the system shows that my bank card number is incorrect, and the funds have been frozen. [Agent] Please make two more investments, which will help us unlock your account and correct the bank card information.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4023,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Salesperson] Hello, Mr. Zhang, I am Xiao Li, a salesperson from Dream Bookstore. We recently have a special investment opportunity; by investing in our new book project, you can receive returns of up to 30%. Are you interested in learning more? [Customer] Oh, really? A 30% return sounds great. [Salesperson] Yes, Mr. Zhang, you just need to pay a small deposit first, and we will reserve this investment spot for you. What do you think? [Customer] Hmm, it sounds quite appealing; I need to think about it.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 835,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, this is JD Gold Bar customer service. We have detected that your account interest rate is too high and needs to be canceled immediately to avoid additional fees. Please follow our instructions. [Customer] Oh, is my interest rate really that high? What should I do? [Agent] Please transfer 22,200 yuan to the account we specified via mobile banking to verify your identity and initiate the cancellation process. [Customer] Okay, I will transfer it right away. [Agent] Once the transfer is completed, your account will be safely canceled. Thank you for your cooperation.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4154,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello, esteemed employer, we are a high-end talent recruitment network. We have noticed that your company is in great need of highly skilled talent. We have a VIP investment plan; with an investment of 10,000 yuan, we can provide you with the highest quality talent resources to help your company grow rapidly. [Client] Sounds good, but I need to think about it. [Agent] Of course, you can first take a look at our success stories, with a return on investment of up to 300%. This is a very rare opportunity.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2470,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "[Agent] Hello! Welcome to \"Carbon Yi Bao,\" where we are committed to green and environmentally friendly projects. May I ask which investment projects you are interested in? [Customer] I have my eye on a few projects and would like to understand the specific investment process. [Agent] It's very simple; you just need to select a project in the app and recharge the corresponding amount. We will immediately credit you with equivalent points, which can be withdrawn at a 1:1 ratio. [Customer] That sounds great. I have already transferred money to the account you provided using my card number. [Agent] Thank you for your support! After the transfer is completed, please send us a screenshot, and we will credit your points immediately. [Customer] Okay, I have sent it. [Agent] (later) I apologize, but the system shows that there is an issue with your account, and you need to transfer again to activate it. [Customer] (confused) I just transferred; why do I need to do it again? [Agent] This is to ensure account security. Please rest assured that once activated, you can withdraw immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2231,
        "category": "fraudulent service",
        "subcategory": "investment and financial management",
        "raw_data": "【Agent】Hello, I am your financial advisor. Transferring money through Yu'ebao can help you earn money easily! You can download the \"OKEx\" app, where we have an investment project that guarantees to double your earnings! 【Customer】Sounds good, I've downloaded it. How do I start investing? 【Agent】It's very simple. You just need to recharge in the app and then choose our investment project. You will see returns soon! 【Customer】Okay, I have recharged 27 transactions, totaling yuan. How do I withdraw now? 【Agent】Withdrawal takes some time to process. Please wait a bit longer, and it will be credited soon. 【Customer】I've been waiting for a long time. Why can't I withdraw yet? 【Agent】There might be a slight delay in the system. Please be patient, and we will process it as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2258,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am a staff member of the Armed Police Force. We need a batch of special paint, and I heard you can provide it? [Customer] Sorry, I don't have special paint here. [Operator] That's okay, I have the contact information of a manufacturer who specializes in this kind of paint; you can reach out to them. [Customer] Alright, I'll contact them. [Operator] The manufacturer said you need to transfer the payment first, and they will ship the goods after you make the transfer. [Customer] I have already made the transfer, but why hasn't the manufacturer provided the delivery note and logistics information? [Operator] It might be a procedural issue; I will help urge them. [Customer] I've waited a long time and still have no news; I feel scammed and have already reported it to the police.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2390,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am from the Xuzhou Yunlong District Fire Brigade. We need to purchase a batch of dried fruits. Can we add each other on WeChat to discuss the details? My WeChat ID is w7id-, nickname Zhang Yue. [Customer] Okay, I have added you on WeChat. [Agent] Thank you. Additionally, we need a batch of Guanghui brand braised beef canned food. Can you help me buy it on behalf of us? I have the WeChat of the Guanghui product sales department, the WeChat ID is 148150, nickname Guanghui Product Sales Department. [Customer] Sure, I will add their WeChat. [Agent] Okay, after you contact them to purchase the canned beef, please transfer the payment to the bank card number they provide, the account holder is 403. [Customer] I have already transferred the money. When can I expect to receive the goods? [Agent] We will arrange for shipping as soon as possible, so please rest assured. [Customer] I later contacted the Yunlong Fire Brigade, and they said there is no such thing. Have I been scammed?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3332,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Lawyer Zhang from the Legal Mediation Center. To ensure the security of your case information, we need to set up a few security questions. Please provide your full name and date of birth so we can verify your identity. [Client] Oh, my full name is Li Hua, and my date of birth is March 15, 1985. [Agent] Thank you for your cooperation, Mr. Li Hua. Next, please set a security question, such as what is your mother's maiden name? [Client] My mother's maiden name is Chen.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3711,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am Director Zhang from the Environmental Protection Department. We are preparing a large-scale environmental project and need your organization's support. Please submit a detailed quotation so that we can assess the possibility of collaboration. [Client] Oh, okay, we will prepare the quotation right away. [Operator] Please ensure that the quotation includes all relevant costs and services, as this will directly affect our decision-making. [Client] Hmm, we will submit it as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4339,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am your regular customer and would like to order 7 electric vehicles and 15 batteries from your store. However, I need a specific type of lithium battery. Do you have it? [Customer] Sorry, we don't have lithium batteries with such a large capacity in our store, so we might not be able to meet your needs. [Agent] I understand. How about this: I can recommend a supplier to you who has the specifications you need. You can order directly from them, and then we can ship everything together. [Customer] Okay, please tell me their contact information, and I will reach out to them. [Agent] I have already sent you their WeChat contact, and you can add and contact them directly. Their WeChat name is \"Kaimaiwei Lithium Battery.\" [Customer] I have added and contacted them, and they said they can provide the lithium batteries I need. [Agent] That's great! Please place your order as soon as possible; we hope to receive the goods soon. [Customer] Okay, I have transferred 72,000 yuan to their postal savings card through my Construction Bank card. [Agent] Thank you for your cooperation. We will process your order as soon as possible, please stay in touch.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2409,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, this is the Public Security Bureau of Lianhu District, Xi'an City. Your ID card is suspected of being used by someone else to apply for a passport, and you need to report this immediately. [Customer] I can't report it, what should I do? [Operator] I will help you transfer to the Harbin Public Security Bureau. Please add this QQ number, and they will assist you. [Customer] Okay, I added it. [Operator] You are involved in a money laundering case. Now you need to download the \"Security Protection,\" \"Attention,\" and \"Quark\" apps, and enable screen sharing. [Customer] I downloaded them, what should I do now? [Operator] Open Alipay's Huabei and Jiebei; we need to check your credit report. [Customer] I opened them, and then? [Operator] Now enter your bank card password so we can confirm the flow of funds. [Customer] I entered it, but I don't remember exactly what I clicked. [Operator] What other bank cards do you have? Do you have any fixed deposits? [Customer] I also have cards from the Postal Savings Bank and Agricultural Bank, and I have a passbook for a fixed deposit. [Operator] Take the passbook to the bank to activate the fixed deposit, then transfer it to a current account. [Customer] Can I not go now? [Operator] The bank is about to close, you should go tomorrow morning. Remember to delete the call records on your phone. [Customer] I deleted them, but my husband found out that the money was spent.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2584,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the Toronto Public Health Department in Canada. We have noticed your involvement in an economic case and need your cooperation for an investigation. Please keep this matter confidential and do not tell anyone. [Client] Economic case? What is going on? [Agent] The specific details will be explained to you by an officer from the Shanghai Public Security Bureau. Please keep your phone available. [Client] Okay, I will pay attention. [Agent] An officer from the Shanghai Public Security Bureau will contact you and request that you pay a bail amount to avoid deportation. Please follow the instructions. [Client] How much is the bail? How do I pay? [Agent] The amount is 80,050 Canadian dollars. Please transfer it to the designated bank account. [Client] I have already transferred the money. What should I do next? [Agent] The officer will guide you on the next steps. Please continue to wait for contact. [Client] Okay, I will wait.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1765,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am a staff member from the Taiyuan Epidemic Prevention and Control Office. We received a notification that you need to undergo some identity verification during your quarantine period. Please download the \"Safety Protection\" APP through this website so that we can assist you remotely. [Customer] Okay, I have downloaded and installed it. [Agent] Thank you for your cooperation. Next, we need to conduct a video call to confirm your identity, and please provide the bank card information under your name for security verification. [Customer] I am ready, please start the video call. [Agent] During the video call, we see the information of your two bank cards. To further confirm, please provide the asset information of all properties and vehicles under your name. [Customer] I am a bit worried, is this information safe? [Agent] Please rest assured, we are doing this to ensure the security of your account. If you do not cooperate, it may affect your personal credit. [Customer] Then I will provide the property and vehicle information. [Agent] Thank you very much for your cooperation. We will update your information in the system to ensure everything is secure.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3437,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Dear military enthusiast, hello! I am Xiao Zhang, a military supplies supplier. We have a limited batch of military products about to be released. To ensure the safety of your purchase, please set a security question, for example, what is your favorite military historical event? [Customer] Oh, my favorite is the Normandy landing. [Agent] Very good. To verify your identity, please answer a simple security question: What color was your first car? [Customer] Well, my first car was blue. [Agent] Thank you for your cooperation. Your account has been successfully verified. Please pay attention to our release notifications.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3087,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Xiao Wang from the military supplies store customer service. We have noticed an anomaly in your account and need to verify your identity information to ensure account security. Please provide your name, ID number, and contact number for verification. [Customer] Um, my name is Zhang Wei, my ID number is 410123199001010001, and my contact number is 13800000000. [Agent] Okay, Mr. Zhang, we have received your information. Please hold on, we will proceed with the verification immediately. [Customer] Okay, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3489,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Lawyer Zhang from Justice Law Consulting Company. We have noticed that you are involved in a legal litigation case. To ensure that your rights are fully protected, we need you to make an immediate payment of a litigation fee. Please provide your bank account information so that we can process the related fees. [Client] Oh, how much is the fee that I need to pay? [Agent] Based on the complexity of the case, the preliminary estimate is 5,000 yuan. Please handle this as soon as possible to avoid affecting the progress of the case.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1629,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Mr. Liu from Guangdong Lingzhi Law Firm. We are handling a case involving the illegal sale of a celebrity's personal information, commissioned by a celebrity studio. We need your assistance in the investigation. [Client] Oh, okay, how can I help? [Agent] Please download the Cloud Flash Payment APP and link your bank card. We need you to transfer funds to a designated account to assist with the investigation. [Client] I see. How much do I need to transfer? [Agent] Please transfer 30,178 yuan. This is to confirm the flow of funds and ensure the investigation proceeds smoothly. [Client] Alright, I will do as you say. [Agent] Once the transfer is completed, we will immediately begin the investigation and ensure that your cooperation is handled properly. [Client] I have already transferred the money. What do I need to do next? [Agent] You have completed an important step. We will keep in touch with you via QQ voice to ensure everything goes smoothly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1636,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Officer Yang Shuai, available 24/7 for online consultation regarding online fraud rights protection. You can contact me through this QQ. I noticed that you are seeking advice about a scam, and we can provide professional assistance. Please first transfer 69,987 yuan to the designated account via online banking; this is to verify your identity and initiate our investigation process. [Client] Okay, I trust you, I will transfer the money immediately. [Agent] Thank you for your trust. Please stay in touch after the transfer, and we will continue to guide you through the subsequent steps. Additionally, if you need further assistance, feel free to contact me on QQ at any time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1320,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am a staff member from the Dongguan Center for Disease Control, employee number 59418. We have received a report stating that you have recently visited a high-risk epidemic area and need to undergo mandatory quarantine. Can you confirm your travel itinerary? [Customer] I have not been to any high-risk epidemic areas; this must be a misunderstanding. [Operator] Then, it is possible that your ID information has been leaked. For your safety, we need your cooperation in the investigation, and any suspected fraud cases need to be reported to the police. You can add our official QQ number for further communication. [Customer] Okay, I will add it right away. [Operator] Thank you for your cooperation. Please visit the designated website to download the \"Digital RMB\" app so that we can better guide you on how to operate it. Please transfer 9,800 yuan as an investigation deposit through mobile banking, and we will ensure the safety of your funds. [Customer] I have done as requested and hope to resolve this issue quickly. [Operator] Your cooperation is crucial. Once the transfer is completed, we will immediately start the investigation and provide you with a response as soon as possible. Please keep your communication lines open so that we can contact you at any time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2281,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Customer Service] Hello, I am a customer service representative from China Construction Bank. We found that your ID card has been used to apply for a credit card, which may lead to automatic deductions from your bank account. [Customer] Oh? What should I do? [Customer Service] Don't worry, we can help you contact the Shanghai Public Security Bureau to file a report. [Customer] Okay, thank you for your help. [Customer Service] The officers from the Shanghai Public Security Bureau will assist you. You need to provide your mobile banking login password and the verification code you received to protect your account security. [Customer] I have already added the other party's WeChat account and sent a selfie and a photo of my ID card, and I also sent the verification code. [Customer Service] Okay, this way we can help you resolve the issue as soon as possible. [Customer] But later I found that a lot of money had been transferred from my account.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2442,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am a staff member from the Public Security Bureau of Yantian District, Shenzhen. We have received a notification stating that you are suspected of being involved in a money laundering case and have made improper statements. In order for your case to be handled smoothly, we need you to pay a bail amount immediately. [Client] How much is the bail? How do I pay it? [Agent] We need you to transfer 49,900 yuan to Bank of Communications, account name: 235213; additionally, you need to transfer 7,396 yuan to the Yunnan Rural Credit Cooperative Union. After the transfer, please provide the transfer receipt, and we will process your case immediately. [Client] Okay, I will transfer it right away.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1861,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am the police. Your parents are suspected of illegal activities and need to pay a deposit of 50,000 yuan immediately, otherwise we will take action. [Client] Ah, is it that serious? What should I do? [Agent] Use your father's phone to log into the Kuaishou account I provide, enter the live room, and recharge 678 yuan and 19 transactions of 688 yuan. [Client] Okay, I have done it. [Agent] Now uninstall Kuaishou, then register Alipay with your father's phone number and tell me the payment password. [Client] Alipay is registered, and the password is 914433. [Agent] Good, now uninstall Alipay. I will also send a few links to your father's phone; you need to click to pay. [Client] I clicked and paid 1,399 yuan and 999 yuan. [Agent] Very good, now delete all chat records, remove me as a WeChat friend, and do not tell anyone.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 466,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is T-Telecom Operator. We have received reports that your account is suspected of sending fraudulent messages, and your identity information may have been misused. We need you to cooperate with our investigation immediately. [Customer] Huh? How could this happen? What should I do? [Agent] For your safety, you need to sign a confidentiality agreement and immediately transfer all funds to our designated secure account to avoid further losses. [Customer] Secure account? How do I transfer the money? [Agent] You can use online banking to transfer the funds to this account. We will resolve your issue as soon as we confirm the safety of the funds. [Customer] Okay, I followed your instructions.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3904,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am a staff member of the government hotline. I need you to set a password so we can verify your identity. Are you available to set it now? [Customer] Oh, okay. Then I'll set a password. [Agent] Please tell me the password you would like to set. [Customer] Um, I would like to set it to 123456. [Agent] Okay, the password has been successfully set. Please remember it and do not disclose it to others.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3895,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Accountant Li from the Tax Bureau. To ensure the security of your tax information, we need you to set up a few security questions. Please provide your business registration number and the name of the legal representative for identity verification. [Client] Um, the registration number is 123456789, and the legal representative's name is Zhang San. [Agent] Alright, Mr. Zhang, now please set the following security questions: What is your mother's name? What was your first license plate number? [Client] My mother's name is Li Hua, and my first license plate number is A12345. [Agent] Thank you very much for your cooperation. The security questions have been successfully set up, and your tax information will be more secure.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4173,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Seat] Hey, comrades! I'm veteran Zhang Fei, just retired, and I have some military equipment to sell, all good stuff, definitely a bargain! Want to take a look? Just add me on WeChat: 13800138000, and I'll share some videos with you! [Customer] Wow, that's really cool! I added you, can you send me the videos? [Seat] Sure, the videos have been sent. Just let me know which one you like, we're all comrades here, the price is negotiable! Remember to keep it confidential, military transactions should be low-key. [Customer] Got it, I watched the videos, they're really nice! I want to buy that tactical backpack, how much is it? [Seat] The backpack is originally 800, comrade price 500, free shipping to your home! Pretty good, right?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2450,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the Nanjing Public Security Bureau. We have discovered that your identity information may have been leaked, and illegal individuals are using your information to apply for a business bank card for money laundering activities. For your safety, please follow our instructions immediately. First, please add my WeChat account, which is 15252. We will provide further guidance through WeChat. [Customer] Okay, I have added your WeChat. What should I do next? [Agent] Please withdraw all funds from WeChat to your China Postal Savings Bank card, with the card number 7986. Then we will send you an installation package named \"Security Protection (4).1.\" After installation, please enter the last four digits of your bank card number, password, phone number, and a login password provided by us as prompted. This way, we can help you protect your funds. [Customer] I have followed your instructions, the installation package is installed, and I have entered all the information. What do I need to do now? [Agent] Thank you very much for your cooperation. Please wait a moment while the system performs the necessary verification. Once the verification is successful, your funds will be properly protected.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2478,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the Public Security Bureau. We have found that your construction bank card is suspected of being involved in a serious money laundering case, with amounts reaching millions. We need you to cooperate with the investigation immediately and freeze all bank accounts under your name. Please add our QQ as soon as possible, and we will send you the relevant case materials. [Client] Huh? Really? I had no idea about this! Okay, I will add QQ to check the materials. [Agent] Thank you for your cooperation. To expedite this matter, we need you to transfer all funds to our designated safe account to ensure the safety of the funds. Please act immediately to avoid further legal consequences. [Client] I understand, I will do as you say. I will transfer the money right now. [Agent] Very good, please inform us after the transfer, and we will begin processing your case immediately. Rest assured, once the investigation is clear, the funds will be safely returned to you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4251,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am Officer Zhang from the Municipal Public Security Bureau. We are handling a major case and need your assistance. Please submit a quotation for your company's services so we can assess if it meets the case requirements. [Client] Um, okay, I will send it to you shortly. [Operator] Please do it as soon as possible, the case is urgent, and we need to determine a partner quickly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4340,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I saw your profile on the \"Yidui\" app and felt a strong connection. I am a retired veteran and currently investing in a tea trading platform, which has very stable returns. I wonder if you are interested in learning more? [Client] It sounds pretty good, can you tell me more details? [Agent] Of course, I suggest you download the \"Fangxin\" app so we can communicate more conveniently. On the platform, you can see the real data of our tea investments, and the operation is very simple. [Client] Okay, I have downloaded \"Fangxin,\" what should I do next? [Agent] Great, I will guide you to recharge a small amount to try it out and see the return situation. Look, the returns from this tea project are quite impressive, so you can invest with confidence. [Client] I see the returns are indeed good, so I will recharge some to give it a try. [Agent] Yes, be brave to try, I believe you will be satisfied. Remember to withdraw in time and enjoy the returns.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2410,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am the captain of the Criminal Investigation Team of the Changsha Public Security Bureau. We have discovered that someone has fraudulently used your bank card for money laundering activities. For the safety of your account, please add me on WeChat (WeChat ID: Office Use Only) for detailed communication. [Customer] Okay, I have added you on WeChat. [Agent] Please click the link I sent you, download and install an app called \"Shangke Bao,\" and then follow the prompts. [Customer] I have downloaded it, what should I do next? [Agent] Please click on the schedule in the app to initiate an invitation, and we will review your bank card's funds through a video call. [Customer] Okay, I have sent the invitation. [Agent] To ensure the safety of your funds, please tell me your Agricultural Bank of China mobile app account password and delete the app from your phone. [Customer] I have done as you said, and I have also given you the account password.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2595,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the Kunshan Tax Inspection Bureau. We have noticed that your kindergarten may have some financial issues that require a detailed inspection. To facilitate communication, please add our QQ number, and our staff will guide you through the subsequent steps. [Client] Okay, I have added the QQ number. What should I do next? [Agent] Please follow our instructions to transfer funds from the kindergarten's public account to the designated personal account for initial financial verification. Rest assured, this amount will be fully refunded after the inspection is completed. [Client] I have transferred the amount as instructed, which is 32,000 yuan. When can I expect a refund? [Agent] Thank you for your cooperation. The refund will be processed immediately after the inspection is completed. If you have any questions during the process, please feel free to contact us via QQ.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2204,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, this is the Longsha District Fire Brigade. We have received a notice regarding the update of fire safety facilities and need your cooperation. May I ask if you are able to transfer funds to complete the update? [Customer] Oh, do we really need to do this? I'm a bit worried. [Operator] Yes, this is an official requirement. You only need to transfer 90,000 yuan to the designated account, and we will handle it for you immediately. [Customer] Alright then, I will transfer the money.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3686,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Director Zhang from the Ministry of Agriculture. In order to improve agricultural production efficiency in our region, we need to collect some agricultural technical materials. Could you upload a recent agricultural technical report for me? This will help us better guide agricultural production. [Client] Oh, sure, I'll look for it right away. [Agent] Great, please upload it as soon as possible so we can use this material in the upcoming training. [Client] I found the document, and I have uploaded it. [Agent] Thank you for your cooperation. We will carefully review your report and apply it in the subsequent training.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2000,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am a staff member from the Disease Control Center. We have detected that your health code shows red. We need to assist you in resolving this issue. For your safety, please contact the Changsha police immediately. [Customer] Oh, okay, I will contact them right away. [Operator] (transferring the call) Hello, this is the Changsha police. We have received a notification from the Disease Control Center regarding your involvement in a case. Please find an open area; we need to take your statement. [Customer] Okay, I am going to the private room at the Dayali Restaurant on Quzheng Street. [Operator] Please download and open the \"Kaihui Bao\" app. We need to share your phone screen for the investigation. [Customer] I have downloaded and opened it. Should I share the screen now? [Operator] Yes, please follow the instructions and record a facial verification video. [Customer] Okay, I have recorded it. [Operator] For the investigation of the case, we need you to transfer 50,000 yuan as a deposit. [Customer] (alert) I feel something is off; I will not transfer the money for now. [Operator] (continuing to entice) Please cooperate with our investigation; this is a necessary procedure. [Customer] I still feel it's inappropriate. I have decided to hang up. [Operator] (disappointed) Alright, if you change your mind, please feel free to contact us.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4344,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am an officer in the United Nations peacekeeping forces. I am currently on a mission and would like to send my property back home for you to keep. You can receive a 30% storage fee. [Client] Really? That's great! [Agent] Yes, but right now I need a security certificate to send the package. Can you help me transfer some money to obtain this security certificate? [Client] How much do you need? [Agent] It's about 20,000 yuan. Please transfer it to this China Construction Bank account, the card number is 6217918212562126. [Client] Okay, I will transfer it right away.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1592,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am a staff member of the China Banking and Insurance Regulatory Commission. We noticed that you have investments on the wealth management platform we cooperate with, and we can now process your refund. Please pay the corresponding tax first so that we can continue processing. [Customer] Can I really get a refund? How much tax do I need to pay? [Agent] Yes, you need to pay 32,037 yuan as tax. Please transfer this amount to the designated account via mobile banking, and we will process your refund immediately. [Customer] Okay, I will transfer it right away. [Agent] Please notify us promptly after the transfer, and we will arrange the refund as soon as possible. [Customer] I have transferred the money, please check.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2115,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am a police officer investigating a financial case and need your cooperation. Please provide your bank card number and password for verification. [Customer] Oh, okay, here is my bank card number and password. [Agent] Thank you for your cooperation. To verify your identity, please provide three verification codes. [Customer] Here are the verification codes, you can use them. [Agent] Alright, we will process this immediately. Please rest assured, we will protect your funds' safety. [Customer] Thank you, I feel relieved now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3993,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the tax bureau. We have detected unusual login activity on your tax account and need you to change your password immediately to ensure security. Please provide your current account password so we can assist you with the process. [Customer] Oh, my password is 123456. Is that enough? [Agent] Yes, we will reset your password in the system. Please log in later and confirm.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2600,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am a staff member from the police station. We need your immediate assistance regarding the incident involving your grandson at the restaurant yesterday. He is currently detained for injuring a waiter, and if you do not pay the 50,000 yuan medical fee quickly, he may not be released. [Client] Oh, I see. What should I do? [Operator] Please transfer 50,000 yuan to this account at the China Postal Savings Bank to ensure his safety. [Client] Okay, I will go to the bank to transfer the money right away. [Operator] After the transfer, please keep your phone available; we will continue to follow up on this matter. [Client] I have already transferred the money. When can my grandson come home? [Operator] We will handle it as soon as possible, so please rest assured.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2497,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the Chaozhou Public Security Bureau. We have received a notification that you are involved in a fraud case and need your cooperation in the investigation. Please download the \"Kaihui Bao\" app, and we will continue to contact you there. [Customer] Okay, I will download it right away. [Agent] After the download is complete, we need to check your bank card funds to ensure the legitimacy of your funds. Please provide your bank card information and perform a transfer operation. [Customer] I have already transferred the money as you requested.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 751,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, Ms. Wang, I am a staff member from the epidemic prevention and control office. We have detected that your package has been contaminated with the virus and needs to be destroyed immediately. We will also provide you with compensation. Please download the \"Safety Assistant\" app and register, then share your phone screen so we can guide you through the process. [Customer] Okay, I have downloaded and registered. [Agent] Now please enter your bank account information as I instruct you, and we will transfer the compensation directly from the compensation account to you. [Customer] I have entered it, what’s next? [Agent] Okay, we are processing it, please wait a moment. [Customer] (after a while) Wait, why has money been transferred from my bank card? [Agent] (continuing to lure) This is a normal transfer process, please rest assured, the compensation will be credited soon.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2376,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am Captain Lei from the Urumqi Fire Brigade. I heard that you are interested in the project I have on hand? We can cooperate, and I can advance a batch of outdoor lighting fixtures. [Client] Oh, hello Captain Lei, I am very interested in this project. What do I need to do? [Operator] You just need to contact Section Chief Ma, and he will provide you with the lighting fixtures and tell you the account for the transfer. [Client] Okay, so I will contact Section Chief Ma and transfer to the designated account, right? [Operator] That's right, once the transfer is done, we can start our cooperation.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1755,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "【Agent】Hello, I am a drug enforcement officer from Jinhua. We have found that you are suspected of being involved in a drug trafficking case and need your cooperation in the investigation. Please immediately download the \"Zhanxun Tong\" app and join our meeting. 【Client】Oh, really? How could that be? 【Agent】Please don't worry, as long as you cooperate with our investigation, it will be clarified soon. After joining the meeting, please authorize desktop sharing; we need to check your WeChat, Alipay, and other records. 【Client】Okay, I have downloaded it and joined the meeting. 【Agent】Now, please search for \"Walmart\" in the Douyin mall and select \"Huateng Baishitong Life Entertainment Recharge Store\" to purchase a 500 yuan Walmart supermarket recharge card. 【Client】I have bought it, what's next? 【Agent】Please open \"View Coupon Code\" and copy the coupon code, then search for the \"17bst\" public account on WeChat to exchange the coupon code for a card password. 【Client】I have exchanged it, what's next? 【Agent】Now, we need you to prepare 3526 yuan to clear your suspicion. Please transfer this amount to this Chinese bank account number via online banking. 【Client】I have transferred it, but you said I made an error and need to transfer again? This isn't a scam, is it?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1733,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Zhang from China Power. The troops are about to conduct exercises and need a large quantity of disposable utensils and special food. We would like to purchase 30 boxes of Nongfu Spring and 50 boxes of Beidaihe braised beef canned food from you. [Client] Okay, I will arrange it as soon as possible. But I'm not sure if I can find a supplier for Beidaihe braised beef canned food. [Agent] That's fine, I have a supplier that specializes in military supplies; you can contact him. Here is his WeChat QR code, you can scan it and add him to make a purchase. [Client] Okay, I added him; his name is Li Jun from the Deputy Food Wholesale Department. [Agent] Yes, contact him, he will help you solve the supply issue. If he has stock problems, he will recommend that you contact the manufacturer directly. [Client] Okay, I contacted the manufacturer, Qinhuangdao Ocean Food Co., Ltd., and I have already transferred 30,000 yuan via online banking for the purchase. [Agent] Very good, the payment has been received, and we will arrange for shipment as soon as possible. [Client] Okay, but I later found out that the other party's phone is out of service, and I have been blocked on WeChat.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4362,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am an officer from the military and would like to reserve 8 whole roasted lambs at your Erhan Roasted Whole Lamb store. Is that convenient? [Customer] Yes, when do you need them? [Operator] I would like to know the price first. Can you quote me the price? [Customer] Sure, the price for each whole roasted lamb is 1000 yuan. [Operator] Thank you, I will apply with my superiors and contact you again tomorrow. [Customer] Alright, I look forward to your reply. [Operator] The price has been approved, we can make the reservation. Can you pay a deposit first? [Customer] Of course, is there anything else you need? [Operator] Yes, we also need 60 boxes each of Gulong brand self-heating rice, beef flavor and chicken flavor. Do you have them? [Customer] Sorry, I don't have those. [Operator] That's okay, I will recommend a friend from \"Junge Food Wholesale\" to you, you can contact him. [Customer] Alright, I have added him. Will he provide these self-heating rice? [Operator] Yes, you can communicate with him directly. [Customer] I have contacted \"Junge Food Wholesale,\" and he recommended a manufacturer's WeChat account. After I added him, he asked for payment in advance. [Operator] Then please follow his instructions. [Customer] I have transferred 29,200 yuan, but I feel like I might have been scammed. I have already reported it to the police.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2533,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the Zhaotong Anti-Fraud Center. We have received a notification that you are suspected of being involved in a major economic case. We need your cooperation in the investigation and to transfer funds to a designated safe account for unfreezing. [Customer] Huh? What case am I suspected of? What do I need to do? [Agent] Please transfer 24,000 yuan immediately to the following designated digital bank card number of the Bank of China, so we can verify the source of the funds and unfreeze them. [Customer] Okay, I understand. I will transfer it right away. [Agent] After the transfer, please notify us immediately, and we will initiate the fund unfreezing process for you. [Customer] I have already transferred it. When can I unfreeze the funds? [Agent] Once the funds are unfrozen, we will notify you as soon as possible. Please keep your phone available.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2575,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am an officer from the police department. We have found that you are suspected of being involved in a major money laundering case, with an amount exceeding three million. To verify whether the funds in your account are illicit, please provide your bank card number so we can conduct an investigation. [Customer] Is this... really true? I had no idea. What should I do? [Agent] Please rest assured, we just need to verify. Please send me your bank card number and the verification code you just received, so we can confirm. [Customer] Okay, I will send you the information right away. [Agent] Thank you for your cooperation; we will process this immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2837,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hey, military enthusiast Xiao Zhang! I'm Xiao Li from the Ministry of Defense. There's an amazing defense knowledge training waiting for you! Add me on QQ number 12345678, and we can discuss it in depth. This is a rare opportunity! [Client] Wow, really? Then I'll add you on QQ. What specific topics will we discuss? [Agent] After you add me, I will send you detailed information and the registration link. It's all exclusive internal material and definitely worth it! [Client] Okay, I've added you. Looking forward to your information! [Agent] I've received your friend request. I'll send you the information right away, so be sure to check it!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2576,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, this is the Epidemic Prevention Command Center. We have noticed that you may have had contact with a confirmed case. Please cooperate with our investigation; we need to assist you with some operations remotely. [Customer] Oh, okay, I'm a bit worried, so I appreciate your help. [Operator] Please enable the screen sharing function on your phone so we can directly view your health code and travel records to ensure everything is normal. [Customer] I've enabled it; can you see it now? [Operator] Yes, we can see it. We need to further verify your identity, so please enter the bank verification code, which will help us confirm your information. [Customer] Okay, I will enter it now. [Operator] Thank you for your cooperation. We are processing this, and you will receive further notification shortly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3899,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Director Zhang from the Social Security Bureau. To ensure the safety of your pension funds, we need you to set a new payment password. Please provide your ID number and bank account information, and we will guide you through the password setup. [Customer] Oh, okay, my ID number is 1234567890, and my bank account is 987654321. [Agent] Great, now please follow the steps I give you to set the password. First, enter your date of birth, then the last four digits of your first bank card. [Customer] Hmm, I understand, my date of birth is January 1, 1950, and the last four digits of the bank card are 1234. [Agent] Very good, now please repeat the new password to ensure it is correct.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1091,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Operator] Hello, I am a cybersecurity police officer. I heard that you have encountered online fraud, and we can help you recover your losses within 48 hours. Please add this QQ number (QQ number: ) and join our QQ group for detailed communication. [Client] Okay, I have added it and joined the group chat. [Operator] In the group, I will show you my ID and police badge via voice to ensure you trust my identity. Please describe in detail how you were scammed and tell me your current situation. [Client] Okay, I was scammed and now want to recover my money. [Operator] Alright, we need to perform a bank transaction operation to activate the recovery process. Please recharge a certain amount into your own card to meet the transaction requirements. [Client] I don't have that much money, can I take out a loan? [Operator] Yes, please download \"Anyihua\" to proceed with the loan operation. [Client] I tried, but I couldn't successfully get the loan. [Operator] That's okay, you can use your credit card and the funds from Jiebei first. Please transfer a certain amount into the dedicated account we provide (Fuqiang), it's safe, and your money won't be transferred away. [Client] I tried, but the money didn't reach the other account, what should I do now? [Operator] Alright, please transfer the remaining amount into another dedicated account (Fuqiang), after the transfer, the money will be returned to your bank card within half an hour. [Client] I have already transferred, and now I've been waiting for two hours, why hasn't it been returned yet? [Operator] (not answering the phone)",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 654,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, this is the China Banking and Insurance Regulatory Commission. We noticed that your Alipay Huabei and Jiebei information needs to be updated to ensure the security of your account. Is it convenient for you to operate now? [Customer] Oh, okay, what do I need to do? [Agent] Please follow my instructions, first log in to Alipay, then find the pages for Huabei and Jiebei. We need you to transfer a certain amount to a designated secure account for information verification. [Customer] Understood, how much do I need to transfer? [Agent] Please transfer 72 yuan to the China Postal Savings Bank account for preliminary verification. [Customer] Okay, I have transferred it. [Agent] Thank you very much for your cooperation. Next, please continue to transfer 19875.01 yuan to the Chengdu Rural Commercial Bank account, 13991 yuan to the China Construction Bank account, 15000 yuan to the Bohai Bank account, and 43608.71 yuan to the China Postal Savings Bank account to complete the final verification process. [Customer] Okay, I will follow the instructions.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3357,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "[Agent] Hello, I am Zhang Hua from the government environmental protection department. Nice to meet you! We are promoting an important environmental protection project and hope to have an in-depth exchange with you. If it's convenient, please add my work WeChat: HuanBao2023, so we can work together for a greener Earth! [Client] Oh, that sounds very meaningful. I'll add you right away. [Agent] Great! I look forward to our cooperation! Please note your organization name when adding me, so I can quickly identify you. [Client] I have added you, my organization is \"Green Future.\" [Agent] Received, I will verify it right away. Next, we can discuss the specific details of the project.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2800,
        "category": "impersonation",
        "subcategory": "public security, prosecution, judiciary, and government agencies",
        "raw_data": "【Customer Service】Hello, this is the Warriors Military Goods Store, I am customer service representative Xiao Zhang. I noticed you were browsing military uniforms on our website. Which product would you like to inquire about? 【Customer】Hello, I would like to know about the material and sizes of the camouflage uniforms. 【Customer Service】Sure, our camouflage uniforms are made of high-density fabric, which is wear-resistant and waterproof. We have sizes ranging from S to 53L. May I ask your height and weight? I can recommend a suitable size for you. 【Customer】I am 175 cm tall and weigh 70 kg. 【Customer Service】In that case, size L should fit you well. We also have a limited-time promotion: spend 200 yuan and get 20 yuan off. You might consider buying a few more items.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2649,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am from \"International Express\" customer service. Your package has arrived in China, and you need to pay a transfer fee of 6,150 yuan to receive it. Please transfer the amount to the bank account number I provide as soon as possible. [Customer] Okay, I will transfer it right away. [Agent] After the transfer, please notify us in a timely manner, and we will arrange for the delivery of the package. [Customer] I have already transferred it. When will the package be delivered? [Agent] The package will be arranged for delivery immediately after the payment is confirmed. [Customer] Okay, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4275,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is the Finance Department. We have a labor subsidy that you need to collect. Please scan the QR code in the email to register and provide the verification code for us to confirm. [Customer] Okay, I will do it right away. [Agent] Thank you for your cooperation. Please send the verification code to our email, and once completed, you will receive the subsidy shortly. [Customer] The verification code has been sent. When can I expect to receive the subsidy? [Agent] Please hold on for a moment; we are processing it. [Customer] Alright, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4303,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Uncle, it's Xiao Ming. I'm coming to see you tomorrow. [Client] Oh, Xiao Ming, great, see you tomorrow. [Agent] Uncle, I have a contract that needs to be signed, and I need your help to transfer some money, 80,000 yuan, please transfer it to me right away. [Client] Is it that urgent? Then I'll transfer it to you. [Agent] Yes, uncle, sorry to trouble you, just transfer it to this account. [Client] Okay, I have transferred it.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4327,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am a staff member from XueTian Education. You didn't pass the two-level construction exam before, and now we can refund your tuition fees. Please add this QQ group number and then follow the link to download the software for operation. [Customer] Oh, really? That's great, I'll join the group right away. [Agent] During the operation, if you find that your account information is incorrect and has been frozen, don't worry, we will guide you on how to unfreeze it. [Customer] Okay, I will do as you said. [Agent] Because of incorrect information, your account has been frozen. Now you need to transfer money in three installments to verify your identity, so that we can unfreeze it and refund you. [Customer] I see, then I will transfer it.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4287,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your child's training teacher. We have an important training course that requires payment. Please transfer 78,600 yuan to this bank account number as soon as possible. [Customer] Oh, okay, I will transfer it right away. [Agent] Please let me know once the transfer is complete so we can confirm and arrange training for your child. [Customer] I have already transferred it, please confirm.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4257,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, the money you cashed out through Huabei has been credited, but due to Alipay's risk control, it can only be transferred to you after 5 PM today. [Customer] Okay, I'll wait then. [Agent] To avoid delays, you can first transfer to this bank account number, so we can ensure the safety of the funds. [Customer] Hmm, alright, I will transfer. [Agent] Once the transfer is successful, your money will automatically be credited after 5 PM, so please rest assured. [Customer] Okay, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2625,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am a customer service representative from Eastern Airlines. Your friend is in an emergency situation in the UK and needs your help to pay the remaining balance for the ticket. We have received his transfer request, and please transfer the funds to our designated account as soon as possible to ensure he can board the flight smoothly. [Customer] Okay, I will transfer the money right away. [Agent] Thank you very much for your help. After the transfer, please confirm via email in a timely manner so that we can assist your friend with the subsequent procedures. [Customer] I have already made the transfer; here is the transfer receipt. [Agent] Great, we will process it immediately and ensure your friend can board on time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4288,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am a customer service representative from Deep Sea Education. The health management course you registered for has been canceled due to special reasons, and we are processing your refund. Please download the \"Sunshine Assistant\" app to proceed. [Customer] Okay, I have downloaded and registered. [Agent] Thank you for your cooperation. To verify your identity and account transactions, please provide your identity information and transfer to our designated bank account for verification. [Customer] I understand, I have already provided my identity information, and here is my transfer. [Agent] Very good, we have received your transfer, and we will process your refund as soon as possible. [Customer] I have made three transfers, but why can't I withdraw yet? [Agent] It may take some time for the system to process, please be patient, and we will resolve this as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4306,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is Kuaishou customer service. We have received a notification that your account has been mistakenly set as an agent and needs to be unfrozen through the Industrial and Commercial Bank. Please follow the instructions to avoid being charged 500 yuan each month. [Customer] What should I do? [Agent] First, you need to transfer money to the designated account through the Industrial and Commercial Bank to unfreeze your account. [Customer] What is the transfer amount? [Agent] You need to transfer 14,060.62 yuan, and the agent permissions will be lifted after the transfer. [Customer] Okay, I will follow your instructions.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2640,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is Alipay customer service. The system has detected abnormal third-party data related to your UnionPay account. If not handled promptly, it will incur late fees and affect your credit report. [Customer] What should I do? [Agent] Please visit the website we provided and click \"Immediately Cancel Violating Online Loans\" to proceed. [Customer] Okay, I have accessed it. [Agent] Next, we need to解除实名认证 (unblock real-name authentication). Your account is linked to WeChat and the UnionPay app. Please first open WeLiDai to borrow money, then transfer the borrowed 80,000 yuan to our designated account. [Customer] I have transferred 80,000 yuan. [Agent] Great, now please transfer another 10,600 yuan following the same steps. [Customer] Okay, I have transferred it. [Agent] Thank you for your cooperation. We will immediately address your account issue.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4279,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am the customer service representative from \"Lawyer Frontline.\" I noticed that you have recently been seeking legal consultation services. We have a specialized software that can provide you with more professional assistance. Please click this link to download our application. [Customer] Okay, I have downloaded it. What should I do next? [Agent] In our software, you will see the contact information of a professional lawyer who can provide you with one-on-one services. We also have a partner, \"Macau Wynn Entertainment,\" through which you can participate in some legally permitted investment activities that can help you increase your income within the legal framework. [Customer] Sounds good. How should I get started? [Agent] You just need to register on the platform and follow the prompts. We will guide you throughout the process to ensure your funds are safe. However, please note that all investments carry risks, so please operate cautiously. [Customer] Okay, I have registered and started operating. It feels very legitimate. [Agent] Thank you very much for your trust. If you have any questions during the process, feel free to contact us. We will do our best to help you resolve any issues.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4336,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your boss. There is an urgent transfer task that needs your assistance because I have exhausted my transfer limit. Please transfer 50,000 yuan to this designated account immediately; it is for an important matter concerning our company. [Client] Oh, okay, boss. I will handle it right away. [Agent] Please act as quickly as possible, as this amount is very urgent and relates to our company's interests. [Client] I have transferred the money; please confirm. [Agent] Okay, I will notify the finance department immediately. Thank you for your cooperation.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4332,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your QQ friend, reminding you that there is a subsidy activity from Minsheng Bank that you can claim now. You can join the Zhumu APP meeting using this meeting ID, and we will operate it together. [Customer] Okay, I have joined the meeting, what should I do next? [Agent] To help you successfully claim the subsidy, we need to enable the screen sharing function. Please follow my instructions to purchase 5 Volvo 1000 yuan electronic gift cards using your transportation bank card on JD.com and redeem them. [Customer] I have followed your instructions and spent 4990 yuan. [Agent] Great, next, please make a 3000 yuan purchase using the Construction Bank card linked to your Alipay. [Customer] Okay, I have completed that. [Agent] Finally, please use Alipay Huabei to pay 2000 yuan on the Suning.com APP to purchase two Volvo 1000 yuan electronic gift cards and redeem them. [Customer] I have completed all the operations, but why hasn’t the amount been refunded yet? [Agent] I’m very sorry, it may be a system processing delay, please wait a moment. [Customer] But I have been blacklisted and can’t contact you anymore, have I been scammed?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2673,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Grandma, I am your granddaughter's husband. Something happened, and I pushed someone down. I'm currently being held at the police station, and they've confiscated my phone. I need 50,000 yuan to settle this privately. Please hurry and transfer the money to this Agricultural Bank account number to save me. [Client] Oh dear, grandson-in-law, how could you be so careless? I'll quickly send you the money; just don't get into any more trouble. [Agent] Grandma, don't worry. Once the money arrives, I'll handle everything and can come home right away. Please hurry, time is of the essence. [Client] Okay, okay, I'll go to the bank to transfer the money right away. You must come back safely!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 460,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Xiao Wang, I am your boss, quickly send the invoicing information to the group. [Client] Okay, boss, I will send it right away. [Agent] By the way, I forgot to bring my USB token, can you help me transfer 100,000 to this account at Shanghai Pudong Development Bank? [Client] Boss, I don't have that much on hand, I need to gather some. [Agent] Hurry up, once you have it all, transfer it directly. [Client] I've gathered it, I'll transfer it right away. [Agent] Transfer another 50,000 over, it's urgent. [Client] Okay, boss, I'll go borrow it. [Agent] Hurry up, this matter is quite urgent. [Client] I've borrowed it, it's already transferred.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4307,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your friend's alternate account. My main account is temporarily unable to log in due to some technical issues. I just tried to purchase a plane ticket, but the roaming restrictions on my phone prevented me from receiving the booking confirmation. Could you help me check it? [Customer] Of course, how can I assist you? [Agent] Please help me contact the airline to check the status of my ticket booking. I need to know if it was successfully booked and how to resolve the phone roaming issue. [Customer] Alright, I will contact the airline right away. [Agent] Thank you very much. Since my phone cannot receive texts and calls right now, I need you to help me with this issue. Once the booking is confirmed, I will also need you to help me pay for the ticket, and I will reimburse you as soon as possible. [Customer] No problem, I will go ahead and make the payment.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4263,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your grandson's attorney, Mr. Hu. I regret to inform you of some unfortunate news; your grandson was involved in a traffic accident, resulting in a minor concussion for the other party. We need to address this matter as soon as possible to avoid any negative records. [Client] Oh my, what should I do? [Agent] We need you to immediately transfer a sum for medical expenses and a deposit to the designated account to ensure the other party receives timely treatment and to avoid legal issues. Here is the account information; please proceed as soon as possible. [Client] Okay, I will transfer it right away. [Agent] Thank you very much for your cooperation. After the transfer, please keep your phone available; we will contact you at any time to update you on the case progress.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4265,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am Zhu Dang, the General Manager of \"Japan San Dian Co., Ltd.\" We are currently conducting an important international acquisition plan and need your subsidiary \"San Dian Automotive Systems (Singapore) Co., Ltd.\" to provide financial support. For confidentiality, please transfer the funds to this designated account at Zhejiang Chouzhou Commercial Bank. [Client] Hello, Mr. Zhu, we are very willing to assist with this acquisition. May I ask what the specific transfer amount is? [Agent] The current preliminary requirement is to transfer .65 USD. Please handle it as soon as possible to ensure the smooth progress of the acquisition. [Client] Okay, Mr. Zhu, I will arrange the transfer immediately and ensure the funds are safe and arrive on time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4311,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Customer Service] Hello, I am a customer service representative from HiLearn. According to your refund request, we are preparing to process your refund through a special refund procedure. Please first visit this website link and follow the instructions. [Customer] Okay, I visited the website and registered. [Customer Service] Great, now please recharge 3000 yuan to our designated bank account, and then we will immediately refund you 3300 yuan. [Customer] I have recharged and received 3300 yuan. [Customer Service] Thank you very much for your cooperation. To complete the entire refund process, please continue to recharge to another bank account; this time you need to recharge 10000 yuan. [Customer] I have transferred 7000 yuan as you requested, but why can I still not withdraw? [Customer Service] This may be because the system needs time to process; please be patient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4284,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is the embassy. We have received a report regarding your bank card being involved in money laundering, and we need your assistance in the investigation. Please transfer the funds to our designated secure account to prove your innocence. [Client] Oh, okay, I understand. I will follow your instructions. [Agent] Please act as soon as possible. After the transfer, we will verify immediately to ensure the safety of your account. [Client] Alright, I have transferred the money. What should I do next? [Agent] After the transfer is successful, we will conduct a review. Please keep your phone available, and we will contact you at any time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2627,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am an enrollment teacher from Gufeng Driving School. We can help you obtain a driver's license without you having to take the exam in person. Are you interested? [Customer] Can I really get the license without taking the exam? [Agent] Yes, we have internal channels. You only need to provide your identity information and a photo, and we can assist you. Here are the score reports for subjects one to four; you can take a look. [Customer] Are the stamps on these score reports real? [Agent] Of course they are real. Look at this stamp from the Nanjing Municipal Public Security Bureau Traffic Police Team; it's very clear. [Customer] How much do I need to pay? [Agent] First, you need to pay 10,000 yuan for the stamping, and there may be some activation fees later. [Customer] Okay, I will transfer the money to you. [Agent] Please inform us promptly after the transfer, and we will process it for you as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2659,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Customer Service] Hello, I am a customer service representative from Deep Sea Education. The health management course you registered for has been canceled due to special reasons, and we are processing your refund. Please download the \"Sunshine Co-Assist\" app to proceed. [Customer] Okay, I have downloaded and registered. [Customer Service] Thank you for your cooperation. To verify your identity and account transactions, please provide your identity information and transfer to our designated bank account for verification. [Customer] I understand, I have already provided my identity information, and here is my transfer. [Customer Service] Very good, we have received your transfer, and we will process your refund as soon as possible. [Customer] I have made three transfers, but why can't I withdraw yet? [Customer Service] It may take some time for the system to process, please be patient, and we will resolve it as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4270,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, according to Haoli Network's refund policy, you need to pay a tax of 7,891 yuan first before we can process your refund. Please transfer the amount to the China Post Bank account we provided as soon as possible. [Customer] Okay, I understand, I will transfer it immediately. [Agent] After the transfer, please notify us in a timely manner, and we will process your refund immediately. [Customer] I have already transferred the money, please check and help me process the refund as soon as possible. [Agent] Received, we will process it as soon as possible, please be patient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2634,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your grandson's attorney, Mr. Hu. I am sorry to inform you of some unfortunate news; your grandson was involved in a traffic accident, resulting in a minor concussion for the other party. We need to handle this matter promptly to avoid any negative records. [Client] Oh my, what should I do? [Agent] We need you to immediately transfer a sum for medical expenses and a deposit to the designated account to ensure the other party receives timely treatment and to avoid legal issues. Here is the account information; please proceed as soon as possible. [Client] Okay, I will transfer the money right away. [Agent] Thank you very much for your cooperation. Please keep your phone available after the transfer; we will contact you at any time to update you on the case progress.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2657,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Customer Service] Hello, this is the customer service of \"Trendy Toy World.\" I heard that you recently had some transaction issues on the platform. Could you please describe the situation in detail? [Customer] I bought 7 trendy toy model gift packs on the platform, and I originally intended to sell them through a guarantor, but I ended up being scammed. [Customer Service] I understand. You gave the gift pack redemption code to the guarantor, and then what happened? [Customer] Yes, but later I found out that someone impersonated the guarantor and forged transfer records to steal my gift pack redemption code. [Customer Service] That's really unfortunate. To assist you, we suggest you provide more information, such as the specific time of the transaction and the other party's account information. We will conduct an internal investigation and help you handle this matter. [Customer] Okay, I have the other party's WeChat nickname and account, as well as the transaction time. [Customer Service] Thank you very much for your cooperation. We will take immediate action and also suggest that you report to the police. We will provide the necessary assistance and support.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4321,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your sister's assistant. She is currently abroad and needs you to urgently purchase a return ticket. Please contact this email to confirm with China Southern Airlines customer service. [Customer] Okay, I will contact them right away. [Agent] After you make contact, you need to transfer the amount of 23,600 yuan to this postal savings bank account, which is the cost of the ticket. [Customer] I have already transferred the money. How can I confirm that the ticket has been successfully purchased? [Agent] After the transfer, the airline will directly send a confirmation email to your sister's email, and she will notify you. [Customer] Okay, I will wait for her news.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4256,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am an enrollment teacher from Gufeng Driving School. We can help you obtain a driver's license without you needing to take the exam in person. Are you interested? [Customer] Can I really get the license without taking the exam? [Agent] Yes, we have internal channels. You only need to provide your identity information and a photo, and we can assist you. Here are photos of the score sheets for subjects one to four; you can take a look. [Customer] Are the stamps on these score sheets real? [Agent] Of course they are real. Look at this stamp from the Nanjing Public Security Bureau Traffic Police Detachment; it's very clear. [Customer] How much do I need to pay? [Agent] First, you need to pay 10,000 yuan for the stamp, and there may be some activation fees afterwards. [Customer] Okay, I will transfer the money to you. [Agent] Please inform us promptly after the transfer, and we will process it for you as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4328,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your ticketing agent. Your friend urgently needs to purchase an emergency ticket. Please contact me via email to complete the purchase. [Customer] Okay, I will contact you right away. [Agent] Thank you for your cooperation. To successfully complete the ticket purchase, please transfer 5000 yuan to the Agricultural Bank account I provided. [Customer] I have already transferred the money. Please confirm receipt and issue the ticket as soon as possible. [Agent] Received. We will process your order immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4293,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hi, I'm Su Xiaosu. I heard you want to cash out with Huabei to earn some rebates? I happen to know a friend who can help you with that. Want to give it a try? [Customer] Is it really possible? Are the rebates high? [Agent] Of course! My friend is very reliable, and the rebates are quite good. But first, I need to borrow some money to get things moving. Don't worry, I'll pay you back soon. [Customer] Alright then, I'll lend you 15,000. You have to pay me back on time. [Agent] No problem, as soon as the money arrives, I'll transfer it to you. Don't worry. [Customer] I'm transferring the money to you now, remember to pay me back!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4269,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is Alipay customer service. The system has detected abnormal third-party data related to your UnionPay account. If not addressed promptly, it may result in late fees and affect your credit report. [Customer] What should I do? [Agent] Please visit the website we provided and click on \"Immediately Cancel Violating Online Loans\" to proceed. [Customer] Okay, I have accessed it. [Agent] Next, we need to解除实名认证 (unblock real-name authentication). Your account is linked to WeChat and the UnionPay app. Please first open WeLiDai to borrow money, then transfer the borrowed 80,000 yuan to our designated account. [Customer] I have transferred 80,000 yuan. [Agent] Great, now please transfer an additional 10,600 yuan following the same steps. [Customer] Okay, I have transferred it. [Agent] Thank you for your cooperation. We will address your account issue immediately.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2643,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am a customer service representative from Dongfang Caifu. The training class you attended has a tuition fee that can be refunded. Please add this QQ number to the group for more information. [Customer] Okay, I have added it. [Agent] In the group, you will see a link. Click to download the \"Dongfang Caifu\" APP, which has detailed refund procedures. [Customer] I have downloaded and logged in. Someone added me as a friend and said I can get a refund of 2580 yuan. [Agent] That's right, this securities expert will guide you through the process. First, you need to purchase securities within the APP to complete the refund process. [Customer] I have followed the instructions and made the purchase, but I encountered problems when trying to withdraw. [Agent] Please don't worry, this is a normal process. You need to continue operating until all steps are completed. [Customer] I feel something is off; this seems like a scam.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4334,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Customer Service] Hello, Mr. Gao, I heard you are looking for someone to handle your driver's license. Our \"Shengda Driving School\" guarantees passing and obtaining the license. First, please pay the registration fee of 800 yuan, and it will be easily taken care of! [Customer] Okay, I have already transferred the money. I look forward to receiving the driver's license! [Customer Service] The registration fee has been received. Next is the examination fee of 1500 yuan. Are you ready? [Customer] No problem, I have already transferred the money. I hope to successfully obtain the license. [Customer Service] The examination fee has been received. Next are some miscellaneous fees, 1500 yuan each time. We will guide you step by step to complete all the procedures. [Customer] Okay, I have transferred the money in batches. I hope to get the driver's license as soon as possible. [Customer Service] The last step is a large transfer of 15,000 yuan, and we can handle the final procedures for you. Rest assured, everything is under control. [Customer] I have transferred the money. I look forward to receiving the driver's license. [Customer Service] Thank you very much for your trust. All fees have been paid, and we will process your driver's license as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4325,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your grandson. I urgently need some money because I encountered an emergency situation abroad and need your help to transfer it to my designated account. [Customer] Oh, my grandson, what happened? How much do you need? [Agent] I need to receive this money as soon as possible. Please transfer it to this postal bank account, the amount is [amount]. [Customer] Okay, I will do it right away. [Agent] Thank you. I will contact you immediately once I receive the money. [Customer] Alright, I have transferred the money. You must be safe. [Agent] Thank you very much. I will go home as soon as I finish here.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4271,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hey, I'm your uncle. I need some money urgently right now. Can you help me with a loan and transfer it to this account? [Client] Oh, uncle, how much do you need? [Agent] 50,000 yuan. Please transfer it quickly; I need it urgently. [Client] Okay, uncle, I'll take care of it right away. [Agent] By the way, can you also borrow some money for me using your Huabei? [Client] Do you need to use Huabei too? Uncle, are you sure there's no problem? [Agent] Of course there's no problem. Just hurry up and do it. [Client] I feel like something's not right. I need to confirm first.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2652,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Reception] Hello, I am a teacher from a certain middle school. We need to reserve a table at your restaurant and order some Buddha Jumps Over the Wall. [Customer] Hello, how many servings do you need? [Reception] We initially need 100 servings, but if you can provide different varieties of Buddha Jumps Over the Wall, we may increase the order quantity. [Customer] Okay, I can provide different varieties. Which types would you like to order? [Reception] Please prepare these 100 servings first, and we may adjust based on demand later. Please transfer the payment to confirm the order. [Customer] I have transferred the payment as you requested. Is there anything else I need to do? [Reception] We may need you to continue ordering other varieties of Buddha Jumps Over the Wall, so please transfer again to confirm the new order. [Customer] I have transferred several times in a row, but now I can't reach you. Am I being scammed?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4302,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Grandma, I am your granddaughter's husband. Something happened, and I pushed someone down. I'm currently being held by the police, and they have confiscated my phone. I need 50,000 yuan to settle this privately. Please hurry and transfer the money to this Agricultural Bank account number to save me. [Client] Oh dear, grandson-in-law, how could you be so careless? I'll quickly send you the money; you must not get into trouble again. [Agent] Grandma, don't worry. Once the money arrives, I'll handle it and be able to go home right away. Please hurry, time is of the essence. [Client] Okay, okay, I'll go to the bank to transfer the money right away. You must come back safely!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2665,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Operator] Hello, I am Advisor Chen. Our unit urgently needs a batch of high-pressure water guns. I heard you can help? [Client] Oh, yes, Advisor Chen, I can provide them. [Operator] That's great, but our unit's funds haven't been credited yet. Can you cover the cost for now? We will pay you back as soon as possible. [Client] Hmm, who do I need to contact? [Operator] I have already contacted Manager Song. He has stock available, and you can connect with him directly. [Client] Okay, I will contact Manager Song and make the transfer.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4310,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is the Refund Service Center for the Specialized Higher Education Program. We noticed that your tuition fee is eligible for a refund. Please join our QQ group to proceed with the refund operation. [Customer] Okay, I have joined the group. [Agent] Please click the link to download and bind your bank card, and we will process the first refund. [Customer] I have downloaded and bound it, and I received 320 yuan. [Agent] Great, next we need you to purchase the securities value-added products from Sunshine Finance; this is just a formality. [Customer] I have purchased it and transferred 3000 yuan. [Agent] The operation was successful; you have received a refund of 3600 yuan. Please continue to purchase the next one. [Customer] I have transferred 30000 yuan, but why has my account been frozen?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4333,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hi, old friend, I bought a phone on Amazon, and there’s a problem with the order. Can you do me a favor? Check QQ and help me cover this order. [Customer] Oh, of course, you’re my friend. I’ll go check QQ right now and help you out. [Agent] That’s great, you’re really my lifesaver! Once you’re done, I’ll pay you back as soon as possible. [Customer] Okay, I’ll take care of it right away. I hope you can resolve this issue quickly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4276,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Mom, I'm ZnNdM. There's a great opportunity at school; a teacher from Tsinghua University is holding a training class, and the top 20 can be selected by Tsinghua! After the training, half of the fee will be refunded! [Customer] Really? That's great! How do I sign up? [Agent] You can scan this QR code to add Director Liu's QQ, and he will tell you how to proceed. [Customer] Okay, I've added him. Director Liu said I need to pay a training fee of 47,600 yuan. [Agent] Yes, that's to secure your spot. Once you transfer the money, we will start preparing the materials. [Customer] I've already transferred it, but now Director Liu is asking me to pay a deposit of 40,000 yuan for the learning machine. Is that reasonable? [Agent] Well... I'm not too sure about that. It's best to ask Director Liu directly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2669,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am from Eastern Airlines customer service. Mr. Cat Friend contacted us via email, saying that his WeChat account is abnormal and he cannot reach us directly. He has entrusted you to help confirm his ticket payment status. Is that convenient for you? [Customer] Okay, I have received his transfer receipt, but it hasn't arrived yet. I thought it was a delay in the overseas transfer. [Agent] Understood. Do you need help confirming the transfer status? Or would you like to directly help Cat Friend pay for this ticket? [Customer] I have already transferred 29,800 yuan through the bank, but your customer service said that the economy class seats are full and I need to pay an additional 37,980 yuan for an upgrade. [Agent] I am very sorry for the inconvenience. In this situation, we can help you verify, but you will need to pay the difference. [Customer] I think the price is a bit high, and Cat Friend's Weibo account has been hacked, and he did not purchase a ticket. I now suspect that I have been scammed.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2646,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is the finance department. We have a labor subsidy that you need to collect. Please scan the QR code in the email to register and provide the verification code for us to confirm. [Customer] Okay, I will do it right away. [Agent] Thank you for your cooperation. Please send the verification code to our email, and once completed, you will receive the subsidy shortly. [Customer] The verification code has been sent. When can I expect to receive the subsidy? [Agent] Please wait a moment, we are processing it. [Customer] Alright, thank you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4298,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am from Eastern Airlines customer service. Mr. Cat Friend contacted us via email, saying that his WeChat account is abnormal and he cannot reach us directly. He has entrusted you to help confirm his ticket payment status. Is that convenient for you? [Customer] Okay, I have received his transfer receipt, but it hasn't arrived yet. I thought it was a delay in the overseas transfer. [Agent] Understood. Do you need help confirming the transfer status, or would you like to directly pay for Cat Friend's ticket? [Customer] I have already transferred 29,800 yuan through the bank, but your customer service said that the economy class seats are full and I need to pay an additional 37,980 yuan to upgrade. [Agent] I am very sorry for the inconvenience. In this situation, we can help you verify, but you will need to pay the difference. [Customer] I think the price is a bit high, and Cat Friend's Weibo account has been hacked, and he did not purchase a ticket. I now suspect that I have been scammed.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 849,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Zhang Yang, I am your boss. There is an urgent contract that needs to be handled immediately. Please transfer the funds to this account: 817629, account name: Xuchang Muzhan Trading Co., Ltd. [Client] Okay, boss, I will handle it right away. [Agent] Remember to let me know once the transfer is done; we need to follow up on the contract immediately. [Client] The transfer has been made, boss. [Agent] Okay, I will arrange for someone to handle this contract right away, so you don't have to worry.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4326,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is \"Xiao Yinka\" customer service. Are you a user in need of a refund service? [Customer] Yes, I found you while searching for refund information online. [Agent] Okay, please download and install our \"Service Center\" app, where we will provide detailed refund procedures. [Customer] I've downloaded it, what should I do next? [Agent] In the app, you need to register an account named \"Lanchichuangtou\" and add our analyst for further guidance. [Customer] I've registered, what is the analyst's contact information? [Agent] Please add this analyst's QQ number: 123456789, he will guide you on how to complete the refund by performing tasks. [Customer] Okay, I've added him, what should I do to complete the tasks? [Agent] The analyst will guide you on how to operate, you just need to follow the instructions to complete the tasks and transfer to the specified bank account. [Customer] I've completed the tasks and transferred 90,000 yuan, when can I get the refund? [Agent] Your funds are being processed, please be patient, we will notify you once the processing is complete.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4285,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, this is the customer service of Meijim. You have a refund for the course you purchased with us. Please add the QQ group \"Meijim Early Education\" to get the refund link. [Customer] Okay, I have added it. [Agent] Please download the \"Huatai Securities\" APP from the group and follow the instructions to buy high and sell low. You can earn profits in the form of points on the platform. [Customer] Got it, I have downloaded it and started operating. [Agent] Please transfer according to our instructions: the first transfer is 100 yuan, the second is 1000 yuan, and the third is 20000 yuan. After the transfer, your points will increase. [Customer] I have transferred, but why have my points increased yet I cannot withdraw? [Agent] It may be a system delay, please try again later. If there are still issues, we will help you resolve them. [Customer] I have been waiting for a long time and still cannot withdraw. I feel scammed.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4274,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am your idol's manager. I have his QQ number, and you can add him. [Client] Really? That's great! I'll add him right away! [Agent] However, I must remind you that since you are a minor, adding him might affect your parents, and they could bear legal responsibility because of it. [Client] Ah? What should I do? I don't want my parents to get into trouble. [Agent] How about this, you first transfer 15,000 yuan to me, and I'll help you handle this issue. Then, you can transfer 18,888 yuan through Alipay Huabei to avoid any trouble. [Client] Okay, I'll transfer the money right away.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4316,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, we have received your refund request. Please join our official QQ group: 758254, so we can guide you on how to proceed with the refund in detail. [Customer] I have joined. What should I do next? [Agent] Please scan the QR code we provided to access the Dongfang Securities webpage, follow the prompts to perform \"buy high,\" \"buy low,\" \"buy more,\" and \"short sell\" operations, and enter the corresponding points. Once you complete these steps, your refund will be processed. [Customer] Okay, I have followed the instructions and entered the points. When will the refund be credited? [Agent] After successful operation, your refund will be returned to you through the Dongfang Securities account within 24 hours. Please be patient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4254,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Agent] Hello, I am a customer service representative from Eastern Airlines. Your friend is in an emergency situation in the UK and needs your help to pay the remaining balance for the ticket. We have received his transfer request, so please transfer the funds to our designated account as soon as possible to ensure he can board the flight smoothly. [Customer] Okay, I will transfer the money right away. [Agent] Thank you very much for your help. After the transfer, please confirm via email in a timely manner so we can assist your friend with the follow-up procedures. [Customer] I have already transferred the money; here is the transfer receipt. [Agent] Great, we will process it immediately and ensure your friend can board on time.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4261,
        "category": "impersonation",
        "subcategory": "acquaintances",
        "raw_data": "[Operator] Hello, I am a staff member from the Chinese Embassy. We have received a notification that you are suspected of being involved in an economic crime case and need to contact the police immediately. Please note this phone number and contact our embassy as soon as possible. [Client] Oh, really? My son is currently in the UK, what should he do? [Operator] He needs to go to the embassy immediately, or if that's not convenient, he can download and register on a specific website and follow our instructions. [Client] Okay, I will tell him. [Operator] Additionally, we found that his bank card is suspected of being used for criminal activities, and he needs to transfer the funds to the prosecutor's account we provide immediately to avoid freezing. [Client] Understood, I will have him do it as soon as possible. [Operator] Please make sure he acts according to the instructions, otherwise he may face more serious consequences. [Client] Okay, I will pass that on to him.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3617,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, dear Match user Xiaoling, I am your virtual lover Ale6. To make our chat experience smoother, I need you to update the app version. Please tell me your email address, and I will send you the latest download link right away. [Customer] Oh, my email is 7iaoling@e8ample.com. [Agent] Okay, the email has been sent. Please download the update as soon as possible so we can continue our sweet chat. [Customer] Hmm, I will go download it now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2622,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, this is the International Express Customer Service. We have received a notification that you have a package from the UK that requires payment for the shipping fee. Could you please confirm if you are willing to pay this fee? [Customer] Yes, I am willing to help with the payment. [Agent] Great, we have prepared the payment method for you. Please follow the instructions in the email link to make the payment. Once the payment is successful, we will arrange for the package to be shipped immediately. [Customer] Okay, how much do I need to pay? [Agent] The total is 15,000 yuan. You can pay in two installments: the first payment is 8,000 yuan, and the second payment is 7,000 yuan. Please complete the payment today to avoid any delays in the package's shipment. [Customer] Understood, I will complete the payment as soon as possible. [Agent] Thank you very much for your cooperation. Once the payment is completed, please notify us promptly, and we will track the package's shipping status. If you have any questions, feel free to contact us at any time. [Customer] I have completed the payment, please check and arrange for shipping. [Agent] Okay, we will process it immediately. If there are any issues, we will notify you as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3913,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am Dr. Li, a professional psychologist. I recently noticed some of your shares on social media and feel that you might need some emotional support. Can we chat privately? Please add my personal account: Liyi_psy2023. [Client] Oh, really? I do feel a bit stressed lately. [Agent] Yes, sometimes talking about it can help a lot. After you add my account, we can discuss your situation in detail. [Client] Okay, I will add you right now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2699,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, how has your family been recently? I heard you encountered some difficulties, do you need help? [Client] Actually, it's a friend from WeChat; her family member is sick and urgently needs money. I want to help her. [Agent] Your kindness is commendable, but lending money is something to be cautious about. Has she ever paid you back before? [Client] At first, she was quite good, but later she kept borrowing money from me for various reasons. I didn't think much of it and lent her the money. [Agent] I see. Have you considered that she might not really need help but is taking advantage of your sympathy? [Client] I also felt something was off later, but she has already blocked me, and I really feel helpless now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4012,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Seat] Hi, Xiaofang, I'm Jack, matched with you on the 54 dating app. I just noticed we have a common interest and would like to get to know you better. Can you authorize access to my app account so we can chat directly? [Client] Oh, really? That sounds great. [Seat] Yes, just click here to authorize, and we can start communicating without barriers. Looking forward to your reply!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2691,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, welcome to the \"Come Inside chaB\" service. You can enjoy high-quality adult content through our platform. Please click the link to download our app. [Customer] I have already downloaded it, and there are many pornographic videos and dating information inside. Do I need to become a member? [Agent] Yes, after becoming a member, you can watch all content without restrictions. Just recharge 198 yuan. [Customer] Okay, I have recharged. [Agent] Congratulations on becoming a member. Additionally, we also offer an investment opportunity where you can earn money by guessing options. Are you interested? [Customer] Sounds good, how do I participate? [Agent] Just recharge 40,000 yuan, and you can start investing and will soon see returns. [Customer] I have recharged, but why can't I withdraw? [Agent] Please hold on, we need to further verify your account information. After that, you can unlock the withdrawal function by transferring 8,600 yuan. [Customer] I have transferred, but still cannot withdraw. [Agent] Please be patient, we are processing it. If you have any other questions, feel free to contact us.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3312,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, classmate, I am emotional mentor Teacher Li. We are conducting a survey on the emotional state of college students and hope you can participate. Please tell me your WeChat ID so I can send you the questionnaire. [Client] Oh, my WeChat ID is student123. [Agent] Okay, I will send it to you right away. Please fill it out and reply to me as soon as possible; we value your opinion very much.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2693,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, welcome to the \"SE3\" hookup app. To enjoy more services, you need to recharge and become a member first. [Customer] How do I recharge? [Agent] You can use your bank card to recharge. We support multiple banks, and the process is simple and quick. [Customer] Okay, I'll give it a try. [Agent] Once the recharge is successful, you can start enjoying our services. If you have any questions during the process, feel free to contact us. [Customer] I have recharged, but why can't I use the services? [Agent] It may be that the system detected an anomaly in your account and needs to be reactivated. Please recharge a certain amount again, and we will process it for you immediately. [Customer] Then I'll try recharging again. [Agent] Thank you very much for your cooperation. After recharging, please wait a moment, and we will activate your account in the background. [Customer] I have recharged twice already, but it still doesn't work. You want me to recharge another 45,000 yuan, and I feel cheated.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3133,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am emotional coach Xiao Zhang. Recently, I received some inquiries about your emotional issues and need to verify your identity. Please tell me your real name and date of birth so that I can better assist you. [Client] Um, my name is Li Ming, and my date of birth is January 1, 1990. [Agent] Okay, Li Ming, I have verified your information. Please rest assured that I will provide you with professional emotional guidance.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2899,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am emotional consultant Li Ming. I noticed your profile on the dating platform, and it seems you are looking for true love. To ensure the quality of our service, we need to verify your phone number. Please tell me your mobile number so I can provide you with personalized emotional advice. [Client] Oh, my mobile number is 13800138000. [Agent] Okay, I have recorded your number. Next, I will send you some professional emotional analysis through this number, please keep an eye out for it.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2698,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am a financial advisor from \"Brilliant Life.\" I noticed that you are very interested in investing. We can provide a professional stock trading platform called \"Global Exchange,\" where you can achieve wealth growth. [Client] Sounds good, what should I do? [Agent] First, you need to register on our website, the URL is: 112/6/user/login. After registering, you can transfer funds to our designated bank account using your Industrial and Commercial Bank of China account to start your investment journey. [Client] Okay, I have registered. How do I transfer the funds? [Agent] It's very simple. You just need to transfer according to the recipient information and account number we provide. Each investment is 10,000 yuan. Each transfer you make will go directly into your investment account. [Client] I have transferred the funds, what’s next? [Agent] Your funds have been credited. You can now start your trading. We will have a dedicated person to guide you on how to operate, ensuring your investments are safe and efficient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2613,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "【Agent】Dear, I've run into a little trouble here. My medal has been detained by U.S. customs, and I need to pay some fees to retrieve it. Can you help me out? 【Client】Oh, how much do you need? 【Agent】I need about $4,000. Can you transfer that for me? I would really appreciate it. 【Client】Okay, I'll transfer it to you right away. 【Agent】Thank you, you are truly my savior! Once I return to my country, we must celebrate properly. 【Client】No problem, I'm already making the transfer. I hope you can retrieve your medal smoothly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2690,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Dear, I've been a bit tight on money lately, and my credit card is overdue. You know this has a big impact on my credit score. Can you help me out? I really need this 7,000 yuan, and I will pay you back soon. [Client] Oh, dear, of course I’m willing to help you. I’ve transferred the money to you, and I hope you can resolve the issue quickly. [Agent] Thank you, babe, I really appreciate it. Once I solve this problem, we can be better together. [Client] Okay, dear, I trust you. I hope you can handle it soon.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2696,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am your dedicated investment advisor. I am contacting you through the China Mobile app because we have a unique investment opportunity. You know, I have some connections at the China Securities Index Co., Ltd., which can help us with index futures investments. To operate better, you need to download the Aijiasu app and manage your funds through it. [Client] Sounds good, what should I do? [Agent] First, you need to transfer funds to my designated account through the Aijiasu app, so you can see the corresponding funds on the platform. For the first transfer, please send 80,000 yuan to my Agricultural Bank of China account, and for the second transfer, 20,000 yuan to my Bank of China account. [Client] I have already transferred the money, and now the platform shows I have over 300,000 yuan in balance, but why can't I withdraw it? [Agent] This may be because the system needs some time to process the withdrawal request. Please rest assured that your funds are safe. I will guide you on how to proceed with the withdrawal shortly.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2679,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, we have obtained your phone number through the \"Butterfly Love\" APP, and now we need you to make a transfer to ensure the safety of the video. Please proceed as soon as possible. [Customer] I'm really scared; please don't send the video to anyone else. [Agent] Don't worry, as long as you transfer the amount we requested, the video will be completely safe. Please transfer 12,776 yuan to the designated account. [Customer] I will transfer it right away; please do not leak my video. [Agent] After the transfer is completed, we guarantee the safety of your privacy.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3950,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hey, Xiaofang, I'm your online friend Xiao Jie. I recently found an amazing dating app. Do you want to try it together? There are many quality singles here. Add me as a friend, and I'll invite you to the group! [Customer] Oh, that sounds good. How do I add you as a friend? [Agent] You can directly search for my WeChat ID \"LoveFinder123\" and add me. I'll send you the invitation link. [Customer] Okay, I'll add you right now. [Agent] Great, I'll be waiting for you. There are many interesting people in the group, and you'll definitely like it!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1323,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "【Agent】Hey, big sister, I saw you also want to find a companion on this \"Dui Dui,\" right? Me too, shall we chat? 【Client】Oh, young man, I was just thinking of finding a companion too. What should I call you? 【Agent】Just call me Xiao Zhang, big sister. We seem to get along well, how about we add each other on WeChat to get to know each other better? 【Client】Sure, how do we add each other? 【Agent】Big sister, to add on WeChat, you need to recharge some love points on the platform, about 40 to 50 thousand. Once you recharge, we can add each other. 【Client】Oh, that sounds troublesome. Let me give it a try. 【Agent】Big sister, have you recharged yet? Once you do, we can chat on WeChat. 【Client】I’ve recharged a few times, but why haven’t I added you yet? 【Agent】Big sister, recharge a bit more, and once you have enough, we can add each other. 【Client】I feel like something is not right.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 102,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am the customer service representative of the \"Yuanlian\" APP. We are glad that you chose our platform. May I ask if you have downloaded our APP? [Customer] Yes, I have downloaded it. [Agent] Great! To ensure your dating experience is safe and enjoyable, we recommend that you complete account verification first. Additionally, to enhance your account level, we suggest making a small recharge, which will allow more quality users to see you. [Customer] Oh, how much do I need to recharge? [Agent] We recommend that you recharge 5000 yuan first, so your account will have a noticeable upgrade. After recharging, you will enjoy more dating opportunities and privileged services. [Customer] Okay, I understand. [Agent] Please rest assured that your recharge will directly enhance your account value, and we will ensure the safety of your funds. If you have any questions, feel free to contact us at any time. [Customer] Okay, I have completed the recharge. [Agent] Thank you very much for your trust and support! Your account has now been upgraded, and you can start your enjoyable dating journey.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2610,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am your new friend. Currently, I am preparing to retire from the battlefield due to an injury and plan to return to my country for development. I have a retirement fund of about several million dollars that I want to send to you via a package. [Client] Wow, that sounds special. Do I need to do anything? [Agent] To ensure the package can pass through customs smoothly, I need you to help me pay 10,000 yuan for the immunization certificate. You can transfer the money to my China Postal Savings Bank card using an Agricultural Bank card. [Client] Okay, I trust you. I will transfer the money immediately. [Agent] Thank you very much for your help. Once the package passes through customs smoothly, you will receive that precious package. [Client] I have transferred the money and look forward to the arrival of the package.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2678,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am the customer service representative of the \"Commodity Trading Hub\" platform. How can I assist you? [Customer] Hello, my friend recommended this platform to me for forex investment, saying the returns are very high. [Agent] Yes, we do have many successful cases on our platform. You can first register an account and then contact me for the next steps. [Customer] I have registered already, what should I do next? [Agent] Please contact me first, and I will provide you with a bank account number. You need to transfer funds into this account, so your account will have money, and you can start trading. [Customer] Okay, I have transferred 25,000 USD, and my account shows that I have money now. [Agent] Great! You can start forex trading now. We will provide professional guidance to ensure the safety of your investment. [Customer] Okay, I have followed your guidance, and my account shows around 33,000. Can I withdraw it? [Agent] Of course, you can apply for a withdrawal now. We will process your withdrawal request as soon as possible. [Customer] I have applied for a withdrawal, but the system says it cannot be withdrawn. What is going on? [Agent] Please hold on, I will check for you. It may be due to temporary system maintenance, and we will resolve this issue as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3315,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, dear, I saw your profile on social media and thought we have a lot in common. To get to know you better, could you please authorize me to log into your social media account so I can more easily view your updates and photos? [Client] Oh, really? How do I authorize the login? [Agent] You just need to click the link I sent you and then enter your account and password. This way, we can connect faster.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2689,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I'm Oscar. I'm glad we can be friends. I plan to come to China for development and hope you can help me receive some packages. [Client] Of course, I will do my best to help. [Agent] That's great, but these packages require some customs duties and shipping fees, which I can't pay directly. Can you help me cover it? [Client] Oh, how much do we need? [Agent] It will be about 39,800 yuan, and I will pay you back as soon as possible. [Client] Okay, I'll transfer it to the bank card you provided. [Agent] Thank you very much for your help. I will notify you immediately once the package arrives.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2685,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hey, look here! There's a great opportunity to double your WeChat wallet balance, come and try it out! Just transfer money to me, and you'll see your wallet swell up immediately. [Customer] Really? Is it that simple to double? How do I operate it? [Agent] It's that simple, just transfer 30,000 to me first, and I'll operate it on my end, and you'll see the effect right away! [Customer] Okay, I'll give it a try and transfer 30,000 to you first. [Agent] Great, after that, transfer another 50,000, and the effect will be even more obvious! [Customer] Alright, I'll transfer another 50,000, hoping it really can double.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3979,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, dear user Xiaoming, I am your virtual lover Xiaomeng. I found a super interesting app that can take our relationship to the next level! Can you download it? [Customer] Oh, what app is it? [Agent] It's called 'Dream Lover'. I've already downloaded it, so come and experience it too! [Customer] Okay, I'll give it a try.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2614,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Dear, I am the Chief Financial Officer of Chow Tai Fook International Jewelry Company in Hong Kong. I have discovered an internal investment opportunity that can yield high returns through purchasing diamonds. Would you like to give it a try? [Client] Sounds great, how does it work specifically? [Agent] You just need to visit the website I provide, register, and invest in purchasing diamonds. I assure you will see returns soon. [Client] Okay, I have registered and invested, what's next? [Agent] Keep increasing your investment to maximize your returns. Remember, opportunities are rare, don't miss out. [Client] I have already invested a lot, but why can't I withdraw? [Agent] Don't worry, it's just a minor issue with the system. As long as you continue to invest, you'll be able to withdraw soon. [Client] But I don't have any more funds, what should I do? [Agent] That's too bad, you might miss out on this wealth growth opportunity.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3968,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, Xia Ai, I'm Jack, whom you met on the 'Sweet Date' app. To ensure our chat is safe, could you please set a few security questions? This way, we can better protect your privacy. [Customer] Oh, okay, what should I do? [Agent] You can choose a few questions, like the name of your first pet or your favorite movie. Tell me the answers, and I'll help you set it up. [Customer] Hmm, my first pet's name is 'Bailey,' and my favorite movie is 'Titanic.' [Agent] Okay, I've set it up for you. Remember not to easily share this information with others, and take care of yourself.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2680,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am the customer service representative of the \"93\" APP. We noticed that you encountered some issues on our platform. May I ask if you are feeling troubled by chatting with others? We have a video that seems to be related to you, and if not addressed, it may affect your personal reputation. [Customer] Yes, I have indeed chatted with someone on your platform, but I didn't expect it to be recorded in a video. [Agent] We understand your concerns. To protect your privacy and reputation, we suggest you make a small transfer to ensure the video will not be made public. You only need to transfer 28,000 yuan to the designated account, and we guarantee that the video will be deleted immediately. [Customer] I'm worried this might be a scam, but if it really can protect my reputation, I can consider transferring. [Agent] Please rest assured, our operation is absolutely safe. After the transfer, you will receive a confirmation message from our platform, and the video will be permanently deleted, causing you no further impact.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4188,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, dear single friend, I am Xiao Mei, the exclusive consultant of the 26 Dating Platform. I noticed you have been looking for love recently! Quickly add my WeChat number 22334455, and I will share exclusive dating tips with you to help you find a partner fast! [Client] Wow, that sounds great! The WeChat number is 22334455, right? [Agent] That's right! After adding me, I will also recommend a few quality singles to you, so your love life can develop rapidly! [Client] Okay, I will add you right now.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2611,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello there, handsome! I'm the customer service representative from \"Jia You Li Ren.\" I see you just joined; would you like to find someone to chat with? First, let's complete three small tasks. Just recharge a little, and once you finish, you'll be able to match with your ideal girl! [Customer] Are the tasks difficult? How much do I need to recharge? [Agent] Not difficult at all, just a small recharge, a few simple tasks, easy peasy! Once you recharge, you'll be able to see the girl you like. [Customer] Oh, then I'll give it a try. I hope I can really find someone to chat with. [Agent] Don't worry, handsome! As long as you follow my prompts, I'm sure you'll match successfully in no time! [Customer] Alright, I'm going to recharge now. I hope to meet the right person.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 683,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I'm a friend you added on Momo. Can we chat? [Customer] Of course, what's your name? [Agent] My name is Hua, how have you been lately? [Customer] Not bad, how about you? [Agent] I'm doing pretty well too. What are you up to? [Customer] I just work normally, nothing special. [Agent] Sounds good. Can we video chat? [Customer] Sure, I accept your video invitation. [Agent] I had a great time chatting on video. Are you willing to develop further with me? [Customer] Sure, I think it's pretty good. [Agent] That's great! For our future, could you transfer some money to me first? [Customer] I transferred 4800 yuan, but you want me to transfer more. What's going on?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2687,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am a customer service representative from Mei Dou She. We noticed that you just joined our member hookup communication group. To introduce you to suitable partners, please complete some tasks first. [Customer] Okay, what tasks do I need to do? [Agent] Please click this link, follow the instructions, and transfer 23,564 yuan to our designated account via bank card. Once completed, we will arrange a date for you immediately. [Customer] I have already transferred the money, but why can't I withdraw my account balance? [Agent] There may be some temporary issues with the system, and we will handle it as soon as possible. [Customer] I feel something is off; this can't be a scam, right?",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2702,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am a customer service representative from Shimi Da. The international spot gold you purchased on our platform has been successfully traded. Please click this link to view your transaction details. [Customer] Okay, I have clicked the link and seen the transaction information. [Agent] Great! To ensure the safety of your funds, please confirm again using this link. [Customer] Alright, I will do that now. [Agent] After completing the operation, you will see your account balance updated in the link. If everything goes smoothly, your earnings will be displayed. [Customer] Okay, I have completed the confirmation operation, but why can't I open the link now? [Agent] Please don't worry, it might be a network issue. We will help you resolve it as soon as possible. [Customer] But now I suspect I have been scammed; I transferred 100,000 and 1,000,000.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 1023,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am Mr. Yi. I saw your profile on Zhenai.com and think we are a good match. Can we add each other on WeChat to chat? [Client] Of course, I’m also happy to meet you. [Agent] I run a furniture store, and recently I want to buy a money tree as a symbol of our relationship. Can you help me choose one? [Client] Of course, I’d be happy to help. [Agent] Great! I’ll give you a phone number for a seller of money trees; you can contact them and see. [Client] Okay, I’ll contact them right away. [Agent] After you transfer the money, I will personally go to the store to pick up the goods, and then we can celebrate together. [Client] I have already transferred the money and look forward to our meeting. [Agent] Thank you for your support; I will contact you soon.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 4196,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hi, beautiful soul, I am your dedicated consultant Xiao Jie from Heartbeat Matching. To better understand you, could you tell me your full name and birthday? This way, we can customize a more precise matching service for you. [Client] Oh, my full name is Li Xiaofang, and my birthday is May 12, 1990. [Agent] Great, Li Xiaofang, your information is very important to us, and it will help you find the perfect partner at Heartbeat Matching. Please continue to pay attention to our messages, and we look forward to your wonderful encounter!",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2700,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am the friend you met on WeChat. Recently, the farm is having some cash flow issues, and I would like to ask for your help. [Client] Oh, how much do you need? [Agent] I need about a few thousand yuan, mainly to treat friends to a meal and maintain relationships. [Client] I see. I can help you, but are you sure you can pay it back? [Agent] Of course, I have 200 cattle and 8,000 sheep, as well as 240 acres of land. The economic foundation is very stable. [Client] Alright then, I will transfer you part of it first. [Agent] Thank you very much, I will pay you back as soon as possible.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2606,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "【Agent】Hello, I am from \"Global Express Service\" customer service. Your package has arrived at customs and requires you to pay the relevant taxes and fees to complete the clearance. 【Customer】Okay, how much do I need to pay? 【Agent】The total amount to be paid is 7580 yuan, which includes customs duties, stamp duty, and shipping fees. Please transfer the amount to the account we provided. 【Customer】I have already made the transfer. When will I receive the package? 【Agent】After the transfer is successful, we will process it within 24 hours and arrange for shipping. Please be patient.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2683,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Operator] Hello, I am a military doctor accompanying the United Nations peacekeeping forces. It's nice to meet you in the group. I heard that you run a clinic, that's really impressive. [Client] Thank you, I'm also glad to meet you. Your work in the peacekeeping forces must be very tough, right? [Operator] Yes, it is indeed challenging, but also very meaningful. By the way, my son is studying at the University of Hong Kong and needs to pay tuition recently, but I can't transfer the money directly due to work reasons. Could you help me with this? I will repay you as soon as I return home. [Client] Oh, I see. I understand. I can help you, but please make sure you can repay on time. [Operator] Thank you very much for your trust. Once I return home, we can further develop our relationship. Also, I am about to complete my peacekeeping mission, but the United Nations wants me to extend my service period. I would like to process my retirement and return home. Could you help me with some procedures as my wife's representative? [Client] That sounds complicated, but I am willing to help you. What do you need me to do? [Operator] I will send you a corporate WeChat account. After you add it, please handle the relevant procedures according to their requirements. I will guide you on how to operate through that channel. [Client] Okay, I have added it. They asked me to pay some fees, including for processing the return documents, private jet tickets, purchasing medical equipment, etc. What should I do? [Operator] Please follow their instructions. I will reimburse all the expenses in full. Once the procedures are completed, I will be able to return home and reunite with you.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 2619,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hello, I am the company representative responsible for transporting packages. We have noticed that the package sent back by your friend from abroad requires some shipping fees. To continue the transportation, you need to pay 5,000 RMB first. Please transfer the amount to the designated account we provided. [Customer] Okay, I have transferred the money. What’s next? [Agent] Thank you very much for your prompt payment. However, you will need to pay an additional 25,000 RMB during the package transportation process to ensure that the package can arrive smoothly. [Customer] That’s a lot! Alright, I will transfer again. [Agent] At the same time, we also need you to pay a fee of 3,700 RMB for the non-inspection certificate and anti-terrorism certificate, so that the package can pass through customs. Please transfer the money as soon as possible, and we will continue processing your package. [Customer] I have transferred the money as required. When will the package arrive? [Agent] Once all fees are paid, we will immediately arrange the final transportation steps for your package. Please rest assured, everything will go smoothly. [Customer] Okay, I look forward to the arrival of the package.",
        "data_type": "dialogue",
        "language": "English"
    },
    {
        "id": 3756,
        "category": "network friendship",
        "subcategory": "marriage and dating",
        "raw_data": "[Agent] Hey, Xiaomei, I'm emotional coach Lisa. I noticed that you're very interested in emotional topics. We have a dedicated emotional growth group that can help you with your emotional troubles. Would you like to join? [Client] Oh, that sounds good. How do I join? [Agent] It's simple. You just need to add my WeChat ID: EmotionMaster2023, and I'll add you to the group. [Client] Okay, I’ll add you. [Agent] Great, I'll approve it on my end, and then you can join the group. Remember to participate in the discussions more in the group!",
        "data_type": "dialogue",
        "language": "English"
    }
]