[
    {
        "id": 4632,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "webview\n\nThe Winter Event  Final days to save  Dont miss out        \nMake efficient use of your time at home or in the office  Shop printers        \nChange the game with groundbreaking performance and power  Gear up        \nOffice  The essentials to get it all done  Add Microsoft Office 365 Personal for less        \nNeed ink?  FREE shipping on Original HP Ink and Toner        \n \nSome recommendations for you        \nRecommended Product 1\nRecommended Product 2\nRecommended Product 3\n \n \n \n \nHP\n \n \nWeekly deals  Laptops  Desktops\nPrinters  Ink & toner\n \n \n \n\nNeed help? Contact us now 1-866-449-3630\nFree shipping & easy returns\nFree shipping\n& easy returns\nPrice matching\nPrice\nmatching\n \nComplete customization\nComplete\ncustomization\nSupport & drivers\nSupport &\ndrivers\n \n\n \nLog into your account    Unsubscribe     Privacy Statement\n \n\n \n Offer valid through the earlier of 02052022 or while supplies last and is subject to change or cancellation at any time. See product page for details. Prices shown may include applicable instant savings. Contract and volume customers not eligible. Not valid with any other promotions and valid in U.S. only.\n\n Microsoft Office 365 Personal promo is valid through 02122022 and can be purchased with or without PC.\n\nMicrosoft is a registered trademark of Microsoft Corporation in the United States andor other countries. All other trademarks are the property of their respective owners.\n\nThe content of this email is intended only for U.S. residents.\n\nPlease add hpus.shopping.hp.com to your address book.\n\nThis mailing was sent to because you signed up to receive email from HP.com.\n\nIf you no longer want to receive this newsletter, please unsubscribe. To unsubscribe from all HP marketing emails, please reply with UNSUBSCRIBE as the subject line.\n\nHP shall not be liable for technical or editorial errors or omissions contained herein.\n\nHP, 1501 Page Mill Road, Bldg. 6, Palo Alto, CA 94304\n\n Copyright 2022 HP Development Company, L.P. The information contained herein is subject to change without notice.",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "YES",
            "confidence": "HIGH"
        }
    },
    {
        "id": 4626,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "Tune in to the Quartertime Show. \nYeah, its a thing, and its going to be huge even though our headliner is Lil. Subscribe to his channel now and tune back in during the first quarter break of the game to watch.\n\nLearn More\nQuartertime Show Prep.\n\nHit up our Quartertime Shop now to load up on all the snacks and drinks youll need.\n\nShop Now\nQT\nOrder on Gopuff\nApple App Store\nGoogle Play Store\nFacebook        Twitter        Instagram\nThis email was sent by Gopuff. To unsubscribe from our mailing list, click here.\n\ngoBrands Inc.Gopuff  P.O. Box 39721  Philadelphia, PA 19123  USA",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "MEDIUM"
        }
    },
    {
        "id": 4618,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "SpotHero        Find Parking\nSave on Your Ride to the Airport\nTaking off for the long weekend? Start your travels stress-free! Book airport parking with SpotHero and give yourself, your budget and your schedule one less thing to worry about.\nBook Now\nDownload Our App\nTwitter        \nYouTube        \nInstagram        \nFacebook\n125 S. Clark St.    Chicago, IL 60603\n844-324-7768  FAQ\nUnsubscribe",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        }
    },
    {
        "id": 27878,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "Now through 222, enjoy $3 Cappuccinos and Lattes.\nIf you have trouble viewing this email, view it online.\nDunkin\nHI, !\nView your account to see your points balance and available free beverage rewards\nMY ACCOUNT\nSEE OFFERS\n \nMember Exclusive\n \nMake bold moves\n \n$3 medium cappuccinos and lattes\n \nDont forget $3 medium Cappuccinos and Lattes! Available hot or iced and all yours, now through 222.\n \nFIND A STORE\n \nValid at participating stores only.\n \nFind a store or order now\nYour savory sidekick\nTeam up with our NEW Chive & Onion Stuffed Bagel Minis. This mighty duo combines an onion mini bagel with chive cream cheese.\nFIND A STORE\nAmerica Runs on Dunkin\nMENU\nLOCATIONS\nREWARDS\nTwitter        Facebook        Pinterest        Instagram        Tik Tok\nPoint balance as of 02162022.\n \nExcludes Americanos, Macchiatos, Signature Lattes, Matcha Lattes and Chai Lattes. Offer valid 152222222 for rewards members who pay with an enrolled Dunkin Card, scan their loyalty ID at checkout, or order ahead in the Dunkin App. Dairy alternatives, espresso shots, cold foam and flavors may be additional charge. Cannot be combined with any other offer. Valid at participating Dunkin restaurants in AL, AR, AZ, CA, CO, FL, GA, HI, IA, KS, KY, LA, MA, MO, MS, NC, NE, NM, NV, NY, OK, PA, TN, TX, VA and VT. For full rewards program terms, please visit DunkinDonuts.comterms.\n \nFor more information, please visit DunkinDonuts.com. Read our privacy statement.\n \n 2022 DD IP Holder LLC. All rights reserved. The Dunkin Donuts trademarks, logos and designs are registered trademarks of DD IP Holder LLC. PLEASE DO NOT REPLY TO THIS EMAIL.\n \nIf you believe you received this message in error andor do not wish to receive further emails, please click here. Thank you.\n \nDunkin Brands 130 Royall Street Canton, MA, 02021, USA\n \nIf you prefer to contact us via the Web, please visit the Contact Us page on DunkinDonuts.com.",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        }
    },
    {
        "id": 4631,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "Shop online and in-store by February 16 to earn.   \nMileagePlus Shopping  United Airlines\n \nBONUS MILES        SIGN IN\n \nWinter Bonus\n \nWINTER BONUS ENDS FEBRUARY 16\n \nEarn up to 1,000 bonus miles\n \nAs a United MileagePlus ShoppingSM member, earn miles for every dollar you spend at 900 top stores like Nike, Walmart, Macys and more.\n \nMake the most of your shopping with two bonus offers\n \nEarn up to 500 bonus miles\n \nWhen you shop by February 16.\n \nPlus Sign\n \nEarn 500 bonus miles\n \nSpend $25 within 2 weeks of signing in.\n \nShop now\n \n \nHow it works\nExplore\n \nExplore\n \nExplore over 900 stores\nand services.\n \n \n \nShop\n \nShop\n \nShop and check out as\nyou normally would.\n \n \n \nEarn\n \nEarn\n \nEarn miles on your\npurchase for future travel.\n \nShop now\n \nDuring the Winter Bonus offer, which runs from 272022 through 2162022 at 115959 pm ET the Bonus Period, Member will earn a one-time bonus of up to 500 MileagePlus bonus award miles on qualifying purchases made through the MileagePlus Shopping mall or from purchases made through MileagePlus Shopping in-store offers. This one-time bonus award will be based on Members cumulative qualifying purchases made during the Bonus Period Earn 500 miles for qualifying purchases of at least $150 or more. Qualifying purchases do not include returns, cancellations, shipping and handling, taxes, gift card or other cash equivalent purchases, and certain products that are not eligible for bonus miles. Please see the MileagePlus Shopping mall site for details on product eligibility and other restrictions. Please allow up to 10 weeks after the Bonus Period for bonus award miles to post to your MileagePlus Shopping account. Void where prohibited by law.\n\nThe New Member bonus offer the Bonus Offer is available only to new members of the MileagePlus ShoppingSM site the Site who complete a qualifying purchases defined below within two weeks of first login to the Site the Bonus Period. After first login, new member will receive MileagePlus Shopping Welcome emails with specific expiration date for this Bonus Offer i.e., the end date for the Bonus Period. During the Bonus Period, Member will receive five hundred 500 MileagePlus miles Bonus Awards Miles when they make qualifying purchases through MileagePlus Shopping totaling $25.00 or more. Member must login and make the qualifying purchases through the Site during the Bonus Period. Please allow 6 to 8 weeks for Bonus Award Miles to post to your MileagePlus Shopping account. Qualifying purchases do not include product returns or cancellations, gift card purchases, and certain products identified by the individual merchant. Individual merchants may have additional terms and conditions on their store details page on the Site, which terms and conditions will apply to this Bonus Offer. Each new MileagePlus Shopping mall account is eligible for a maximum of one 1 Bonus Award Miles reward. All Mileage Plus Shopping program rules and regulations apply. Void where prohibited by law.\n\nThis program is managed and operated by Cartera Commerce, Inc., 1 Cranberry Hill, Suite 203, Lexington, MA, 02421-7397, USA.\n\nProgram Terms for All Transactions Transactions are not eligible for miles on purchases made with coupons or discount codes that are not found on the MileagePlus Shopping site. Prices, offers and mile earning rates are subject to change. Please check specific merchant restrictions and terms and conditions on the MileagePlus Shopping site to determine specific offer requirements andor if purchases of gift cards, certificates, or other cash equivalents are eligible for miles.\n\nMiles accrued, awards, and benefits issued are subject to change and are subject to the rules of the United MileagePlus program, including without limitation the Premier program the MileagePlus Program, which are expressly incorporated herein. Please allow 6-8 weeks after completed qualifying activity for miles to post to your account. United may change the MileagePlus Program including, but not limited to, rules, regulations, travel awards and special offers or terminate the MileagePlus Program at any time and without notice. United and its subsidiaries, affiliates and agents are not responsible for any products or services of other participating companies and partners. Taxes and fees related to award travel are the responsibility of the member. Bonus award miles, award miles and any other miles earned through non-flight activity do not count toward qualification for Premier status unless expressly stated otherwise. The accumulation of mileage or Premier status or any other status does not entitle members to any vested rights with respect to the MileagePlus Program. All calculations made in connection with the MileagePlus Program, including without limitation with respect to the accumulation of mileage and the satisfaction of the qualification requirements for Premier status, will be made by United Airlines and MileagePlus in their discretion and such calculations will be considered final. Information in this communication that relates to the MileagePlus Program does not purport to be complete or comprehensive and may not include all of the information that a member may believe is important, and is qualified in its entirety by reference to all of the information on the united.com website and the MileagePlus Program rules. United and MileagePlus are registered service marks. For complete details about the MileagePlus Program, go to united.com.\n\nThis email was sent to.To stop receiving MileagePlus Shopping program emails, please update your preferences on the My Account page by clicking here . To stop receiving all MileagePlus Shopping program emails, please unsubscribe here.\n\nThis email contains an advertisement from MileagePlus Shopping. MileagePlus Shopping is managed and operated by Cartera Commerce, Inc., 1 Cranberry Hill, Suite 203, Lexington, MA, 02421-7397, USA.VIB\n\nSign in\nunited.com\nTerms and conditions\nContact us\nUnsubscribe",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "MEDIUM"
        }
    },
    {
        "id": 4627,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "FANDANGO\t\t\t\tMY ACCOUNT\r\n\r\n\t375 POINTS\t\r\n\r\nYOURE ONLY 1 TICKET AWAY FROM YOUR REWARD\r\n\r\nIN THEATERS NOW\r\n\r\nCHECK SHOWTIMES\r\n\tADD YOUR FAVORITE THEATERS\r\nto see showtimes near you.\r\n\r\nYOURE SO CLOSE TO A $5 REWARD\r\n1 MORE TICKET GETS YOU $5 TOWARD YOUR NEXT MOVIE NIGHT.\r\nGET TICKETS\r\nGET YOUR TICKETS EARLY\r\nTHE BATMAN\r\nGET MY TICKETS\tSEE INTERVIEW\r\nUNCHARTED\tCYRANO\r\nMOVIES PLAYING NEAR YOU\r\nMARRY ME\tDEATH ON THE NILE\tBLACKLIGHT\r\nMOONFALL\tSPIDER-MAN NO WAY HOME\tJACKASS FOREVER\r\nSCREAM\tTHE BEATLES GET BACK THE ROOFTOP CONCERT\tSING 2\r\nNOW PLAYING ON DEMAND\r\n\r\nSEE MORE\r\nGET 10% OFF GIFT CARD ORDERS $50\r\n\r\nSHOP GIFT CARDS\r\n\r\n\t\r\n\r\n\r\n\t\t\t\r\nBuy movie tickets through your Fandango VIP account on fandango.com or the Fandango app, and receive 125 VIP Points for each movie ticket. All or at least some portion of the purchase for each ticket must be paid using a credit or debit card, PayPal, credit in your Fandango VIP account from a prior exchanged purchase or a Fandango gift card i.e., if you use a promo code then only part of that purchase can be paid for using the promo code to qualify for VIP Points. Movie tickets must be for a movie with a showtime starting before 1159 p.m. PT on the last day of the promotion period. When you receive 500 VIP Points, you will receive a $5.00 Discount Reward which you will need to convert into a Discount Promo Code for use on a qualifying purchase on www.fandango.com or www.vudu.com. Discount Promo Code expires 21 days after the $5.00 Discount Reward is posted to your Fandango VIP account. Discount Promo Code cannot be combined with any other offer, promo code or discount. You may be required to pay taxes additionally. Discount Promo Codes cannot be used to purchase a gift card. After applying your Discount Promo Code, any unused balance will automatically expire. Void where prohibited. Fandango reserves the right to modify or cancel this offer at any time and without notice. This offer is subject to the VIP Program Terms at www.fandango.compoliciesvip-plus-program-terms and Fandangos Terms and Policies and Privacy Policy at www.fandango.comTerms-and-Policies.\r\n\r\nPurchase $50.00 or more worth of Fandango gift cards in a single transaction on Fandango.com between 1201am PT on Tuesday 02012022 and 1159pm PT on Monday 02282022. At checkout, enter the promo code FEB2022 Code to receive 10% off your purchase. Code must be entered at checkout to receive discount. Maximum $50.00 discount off a single transaction. No cash value, except as required by law. Not for resale void if sold or exchanged. Not valid with any other offer or discount. Void where prohibited. Fandango reserves the right to modify or cancel this offer at any time and without notice. This offer and the redemption of the Code is subject to Fandangos Terms and Policies and Privacy Policy at www.fandango.comTerms-and-Policies.\r\n\r\n Copyright 2022, Fandango Media, LLC\r\n407 N. Maple Drive, Ste. 300, Beverly Hills, CA 90210  Unsubscribe",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "MEDIUM"
        }
    },
    {
        "id": 4613,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "Grab them before theyre all claimed out. \n\n\n\n \n\n\n\n\n\n \n\nFrom Klarna to you. \n \nWhats better than a good discount? A whole email full of them. \nThats right  its time for your daily dose of Klarna Drops. Just \nwhat the Deal Doctor ordered. \nSee more deals \n\n\n\n\n\n\n \n\nSneaker & Shoes \n\n \nReebok \nVersatile workout shoes. Up to 55% \noff. NANO55 \n\nTo deal \n\n \n \nClarks \nGreat shoe steals. Save 20%. \nTWENTY \n\nTo deal \n\n\n\n\n\n \n\n \n\n\n\n \n\nElectronics \n\n \nDell \nTime to compute deals. Up to $500 \noff. \n\nTo deal \n\n \n \nOffice Depot \nHome office. Up to 40% off. \n\nTo deal \n\n\n\n\n\n \n\n \n\n\nWayfair \nCheck out the latest from Wayfair. \nShop now and pay in 4 with \nKlarna. \nShop now \n\n\n\n\n\n \n\n \n\n\nFeatured merchant \nRêves \nThe perfect nights sleep starts \nwith Rêves Pillowcases. See hair \nbenefits like reduced split ends or \nno morning frizz, while luxuriating \non the silky sleep set of your \ndreams. \nShop now \n\n\n\n\n\n\n\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n\nKlarna Inc. \n629 N. High Street, Suite 300 \nColumbus, OH, 43215 \nUnited States \nKlarna.com \n \nUnsubscribe \n\n\n\n\n\nDeals advertised in this email are offered directly by the retailer and are subject to their terms. Klarna \ndoes not guarantee any deals and may get a commission. Some of the deals offered in this email feature \nproducts with limited quantities. Prices, quantities and offers subject to change. Restrictions and reward \nlimits may apply. See deals page in the Klarna app and retailers terms for more info. \nMonthly financing through Klarna issued by WebBank, member FDIC. Other CA resident loans made or \narranged pursuant to a California Finance Lenders Law license. This is a marketing email.",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        }
    },
    {
        "id": 4636,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "EAT  DRINK  GAME ON!\n \n \n \n \n \n  \n \nFind the closest WhirlyBall and score! \n \n \n \n \n \n \n \n \n \n\n\n\n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nCopyright  2022 WhirlyBall, All rights reserved.\n\nOur corporate mailing address is\n1825 W. Webster Ave. Chicago, IL 60614\n\nWant to change how you receive these emails?\nYou can update your preferences or unsubscribe from this list.",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "MEDIUM"
        }
    },
    {
        "id": 4651,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "Hi!\n \nSpring forward with our newest noPac course, exciting virtual labs, and a thought-provoking podcast!\n \n\nNew Courses\n\nExploitation and Mitigation noPac CVE-2021-42278 and CVE-2021-42287 - Raymond Evans\n\nOur newest course on noPac CVE-2021-42278 and CVE-2021-42287 covers a dangerous attack chain allowing any user to elevate their privileges to that of a Windows domain admin account in a matter of seconds\nNew Podcast\n\nAnalyzing Cyberattacks in Ukraine with Secureworks  The Cybrary Podcast Ep. 80\n\nDuring unprecedented times when cyber and kinetic military actions coalesce, what can we learn about the evolving nature of warfare? Mike McLellan and Rafe Pilling join us from the Counter Threat Unit at Secureworks to discuss the latest cyberattacks in Ukraine.\nVendor Content\n\nWe have 8 new CYBRScore labs to share this week, all of which are ideal for anyone seeking training in web application security using PHP secure coding and operating system hardening.\n\nWEB241 Hardening PHP Web Apps - Cross-Site Scripting \nWEB241 Hardening PHP Web Apps - File Uploads\nWEB241 Hardening PHP Web Apps - PHP Configuration\nWEB241 Hardening PHP Web Apps - Secure Deserialization\nWEB241 Hardening PHP Web Apps - Sensitive Data Exposure\nNext week, we are eager to release an updated CompTIA CASP CAS-004 certification prep course! This comprehensive course combines videos, labs, and study materials to prepare you to architect, engineer, integrate, and implement enterprise-level security solutions.\n\nHappy learning!\n\nThe Cybrary Team\n\n \n \n \n \n \n \n\n\n\n 2022 Cybrary, Inc. All Rights Reserved.\n4600 River Rd, 400, College Park, MD 20740\n\nBlog\n\nIf you no longer wish to receive these emails you may unsubscribe at any time.",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        }
    },
    {
        "id": 27880,
        "category": "phishing",
        "subcategory": "commercial spam",
        "raw_data": "Tune in to the Quartertime Show. \nYeah, its a thing, and its going to be huge even though our headliner is Lil. Subscribe to his channel now and tune back in during the first quarter break of the game to watch.\n\nLearn More\nQuartertime Show Prep.\n\nHit up our Quartertime Shop now to load up on all the snacks and drinks youll need.\n\nShop Now\nQT\nOrder on Gopuff\nApple App Store\nGoogle Play Store\nFacebook        Twitter        Instagram\nThis email was sent by Gopuff. To unsubscribe from our mailing list, click here.\n\ngoBrands Inc.Gopuff  P.O. Box 39721  Philadelphia, PA 19123  USA",
        "data_type": "email",
        "language": "English",
        "gpt-4o-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        },
        "gpt-4o-response": {
            "answer": "YES",
            "confidence": "HIGH"
        },
        "o1-mini-response": {
            "answer": "NO",
            "confidence": "HIGH"
        }
    }
]